[
  {
    "slug": "camry",
    "name": "Camry",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 1983,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Toyota Camry has been America's best-selling sedan for over two decades, offering a balanced combination of comfort, reliability, and fuel efficiency. Known for exceptional resale value and low cost of ownership, the Camry is the benchmark midsize sedan."
  },
  {
    "slug": "corolla",
    "name": "Corolla",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 1966,
    "yearEnd": null,
    "bodyType": "Sedan/Hatchback",
    "description": "The Toyota Corolla is the best-selling car in history with over 50 million units sold worldwide. Known for bulletproof reliability and low running costs, the Corolla offers practical transportation with modern technology and safety features."
  },
  {
    "slug": "rav4",
    "name": "RAV4",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 1996,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Toyota RAV4 is one of the best-selling SUVs in the world, pioneering the compact crossover segment in 1996. Available as a gas model, hybrid, plug-in hybrid, and the sporty RAV4 Prime, it offers versatility for every buyer."
  },
  {
    "slug": "highlander",
    "name": "Highlander",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 2001,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Toyota Highlander is a three-row midsize SUV that combines family-friendly space with Toyota reliability. Available with a fuel-efficient hybrid powertrain, the Highlander offers comfortable seating for up to eight passengers."
  },
  {
    "slug": "tacoma",
    "name": "Tacoma",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 1995,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Toyota Tacoma is the best-selling midsize pickup truck in America, prized for its off-road capability and legendary resale value. The TRD Pro trim is one of the most capable factory off-road trucks available."
  },
  {
    "slug": "civic",
    "name": "Civic",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 1973,
    "yearEnd": null,
    "bodyType": "Sedan/Hatchback",
    "description": "The Honda Civic is one of the most popular compact cars in history, known for excellent fuel efficiency, engaging driving dynamics, and long-term reliability. The Civic Type R is one of the most acclaimed performance hatchbacks available."
  },
  {
    "slug": "accord",
    "name": "Accord",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 1976,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Honda Accord is a midsize sedan that consistently earns top marks for quality, value, and driving enjoyment. The Accord has won more Car and Driver 10Best awards than any other vehicle in history."
  },
  {
    "slug": "cr-v",
    "name": "CR-V",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 1997,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Honda CR-V is one of the best-selling compact SUVs in America, offering a spacious interior, excellent fuel economy, and Honda's reputation for dependability. The CR-V Hybrid adds electric assistance for even better efficiency."
  },
  {
    "slug": "f-150",
    "name": "F-150",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 1948,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Ford F-150 has been America's best-selling vehicle for over 40 consecutive years, offering unmatched versatility from work truck to luxury hauler. The F-150 Lightning brings full-size truck capability to the electric age."
  },
  {
    "slug": "explorer",
    "name": "Explorer",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 1991,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Ford Explorer helped create the SUV boom of the 1990s and remains one of the most popular three-row SUVs in America. The Explorer offers seating for seven with a range of powertrains including a performance ST model."
  },
  {
    "slug": "mustang",
    "name": "Mustang",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 1965,
    "yearEnd": null,
    "bodyType": "Coupe/Convertible",
    "description": "The Ford Mustang is an American icon and the world's best-selling sports car, offering thrilling performance at accessible prices. From the turbocharged EcoBoost to the supercharged GT500, the Mustang delivers excitement for every budget."
  },
  {
    "slug": "silverado",
    "name": "Silverado",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 1999,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Chevrolet Silverado is one of America's best-selling full-size trucks, competing directly with the Ford F-150 and Ram 1500. Available in a wide range of trims from work truck to luxury High Country, the Silverado offers capability for every need."
  },
  {
    "slug": "equinox",
    "name": "Equinox",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 2005,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Chevrolet Equinox is a compact crossover SUV that offers a comfortable ride, good fuel economy, and a competitive price point. The all-electric Equinox EV brings affordable electric transportation to the mainstream market."
  },
  {
    "slug": "3-series",
    "name": "3 Series",
    "makeSlug": "bmw",
    "makeName": "BMW",
    "yearStart": 1975,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The BMW 3 Series is the sports sedan benchmark, setting the standard for driving dynamics in the luxury segment for nearly five decades. Available as a sedan and wagon, with rear-wheel and all-wheel drive options."
  },
  {
    "slug": "x3",
    "name": "X3",
    "makeSlug": "bmw",
    "makeName": "BMW",
    "yearStart": 2004,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The BMW X3 is one of the best-selling luxury compact SUVs, offering BMW's trademark driving dynamics in a practical package. The X3 M Competition delivers supercar-rivaling performance in an SUV body."
  },
  {
    "slug": "c-class",
    "name": "C-Class",
    "makeSlug": "mercedes-benz",
    "makeName": "Mercedes-Benz",
    "yearStart": 1993,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Mercedes-Benz C-Class is the entry point to the Mercedes luxury sedan lineup, offering cutting-edge technology, refined comfort, and the prestige of the three-pointed star badge. The AMG C 63 variant delivers explosive performance."
  },
  {
    "slug": "gle",
    "name": "GLE",
    "makeSlug": "mercedes-benz",
    "makeName": "Mercedes-Benz",
    "yearStart": 1998,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Mercedes-Benz GLE is a midsize luxury SUV that combines comfort, technology, and capability in a sophisticated package. Available with mild-hybrid, plug-in hybrid, and high-performance AMG powertrains."
  },
  {
    "slug": "a4",
    "name": "A4",
    "makeSlug": "audi",
    "makeName": "Audi",
    "yearStart": 1996,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Audi A4 is a compact luxury sedan known for its refined interior, advanced technology, and available quattro all-wheel drive. The A4 competes with the BMW 3 Series and Mercedes C-Class in the fiercely competitive entry luxury segment."
  },
  {
    "slug": "q5",
    "name": "Q5",
    "makeSlug": "audi",
    "makeName": "Audi",
    "yearStart": 2009,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Audi Q5 is one of the best-selling luxury compact SUVs, offering a premium interior, smooth ride, and Audi's legendary quattro all-wheel-drive system. The Q5 is available in standard, Sportback, and high-performance SQ5 variants."
  },
  {
    "slug": "altima",
    "name": "Altima",
    "makeSlug": "nissan",
    "makeName": "Nissan",
    "yearStart": 1993,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Nissan Altima is a midsize sedan that offers available all-wheel drive, a rarity in the segment, along with good fuel economy and a comfortable cabin. The Altima competes with the Camry, Accord, and Malibu."
  },
  {
    "slug": "rogue",
    "name": "Rogue",
    "makeSlug": "nissan",
    "makeName": "Nissan",
    "yearStart": 2008,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Nissan Rogue is one of the best-selling compact SUVs in America, offering a spacious interior, excellent fuel economy, and a comprehensive suite of safety technology. The Rogue was completely redesigned with bold styling."
  },
  {
    "slug": "elantra",
    "name": "Elantra",
    "makeSlug": "hyundai",
    "makeName": "Hyundai",
    "yearStart": 1991,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Hyundai Elantra is a compact sedan that punches above its weight with a stylish design, generous features, and excellent warranty coverage. The Elantra N variant offers genuine sports sedan performance at an accessible price."
  },
  {
    "slug": "tucson",
    "name": "Tucson",
    "makeSlug": "hyundai",
    "makeName": "Hyundai",
    "yearStart": 2005,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Hyundai Tucson is a compact crossover SUV with bold styling, a premium interior, and available hybrid and plug-in hybrid powertrains. The Tucson offers one of the best value propositions in its class."
  },
  {
    "slug": "sorento",
    "name": "Sorento",
    "makeSlug": "kia",
    "makeName": "Kia",
    "yearStart": 2003,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Kia Sorento is a midsize SUV offering three rows of seating, available hybrid and plug-in hybrid powertrains, and Kia's industry-leading warranty. The Sorento combines family practicality with attractive design."
  },
  {
    "slug": "telluride",
    "name": "Telluride",
    "makeSlug": "kia",
    "makeName": "Kia",
    "yearStart": 2020,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Kia Telluride quickly became one of the most acclaimed SUVs in America, winning multiple SUV of the Year awards with its spacious three-row interior, premium feel, and competitive pricing."
  },
  {
    "slug": "model-3",
    "name": "Model 3",
    "makeSlug": "tesla",
    "makeName": "Tesla",
    "yearStart": 2017,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Tesla Model 3 brought electric vehicles to the mainstream market with impressive range, instant acceleration, and access to the Tesla Supercharger network. The Model 3 is one of the best-selling electric vehicles in history."
  },
  {
    "slug": "model-y",
    "name": "Model Y",
    "makeSlug": "tesla",
    "makeName": "Tesla",
    "yearStart": 2020,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Tesla Model Y is a compact electric SUV that has become one of the best-selling vehicles in the world across all powertrains. Offering impressive range, cargo space, and Tesla's technology ecosystem."
  },
  {
    "slug": "wrangler",
    "name": "Wrangler",
    "makeSlug": "jeep",
    "makeName": "Jeep",
    "yearStart": 1987,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Jeep Wrangler is the ultimate off-road SUV, offering removable doors and roof panels, solid axles, and legendary Trail Rated capability. The Wrangler 4xe plug-in hybrid adds electric torque for trail crawling."
  },
  {
    "slug": "grand-cherokee",
    "name": "Grand Cherokee",
    "makeSlug": "jeep",
    "makeName": "Jeep",
    "yearStart": 1993,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Jeep Grand Cherokee is a premium midsize SUV that combines genuine off-road capability with on-road luxury. The Grand Cherokee L adds a third row, while the Grand Cherokee 4xe offers plug-in hybrid efficiency."
  },
  {
    "slug": "1500",
    "name": "1500",
    "makeSlug": "ram",
    "makeName": "Ram",
    "yearStart": 2010,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Ram 1500 is widely praised as having the most refined interior and smoothest ride in the full-size truck segment. The coil-spring rear suspension and available air suspension set it apart from competitors."
  },
  {
    "slug": "outback",
    "name": "Outback",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 1995,
    "yearEnd": null,
    "bodyType": "Wagon/SUV",
    "description": "The Subaru Outback is a rugged wagon-SUV crossover with standard all-wheel drive and impressive ground clearance. Popular with outdoor enthusiasts, the Outback offers reliable all-weather capability and excellent visibility."
  },
  {
    "slug": "cx-5",
    "name": "CX-5",
    "makeSlug": "mazda",
    "makeName": "Mazda",
    "yearStart": 2013,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Mazda CX-5 is a compact crossover that offers a premium driving experience at mainstream prices, with engaging handling and an upscale interior. The CX-5 consistently earns top ratings for driving dynamics in its class."
  },
  {
    "slug": "rx",
    "name": "RX",
    "makeSlug": "lexus",
    "makeName": "Lexus",
    "yearStart": 1999,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Lexus RX is the best-selling luxury SUV in America, pioneering the luxury crossover segment with its combination of comfort, reliability, and refinement. Available as a hybrid and plug-in hybrid for exceptional fuel efficiency."
  },
  {
    "slug": "jetta",
    "name": "Jetta",
    "makeSlug": "volkswagen",
    "makeName": "Volkswagen",
    "yearStart": 1979,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Volkswagen Jetta is a compact sedan that offers German engineering and build quality at an accessible price point. The Jetta GLI provides genuine sport sedan performance with an affordable price tag."
  },
  {
    "slug": "tiguan",
    "name": "Tiguan",
    "makeSlug": "volkswagen",
    "makeName": "Volkswagen",
    "yearStart": 2008,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Volkswagen Tiguan is a compact SUV that offers European driving dynamics, a spacious interior, and available third-row seating. The Tiguan combines VW's engineering heritage with everyday practicality."
  },
  {
    "slug": "cayenne",
    "name": "Cayenne",
    "makeSlug": "porsche",
    "makeName": "Porsche",
    "yearStart": 2003,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Porsche Cayenne redefined the luxury performance SUV segment, offering genuine Porsche driving dynamics in a practical five-seat package. Available with twin-turbo V6, V8, and plug-in hybrid powertrains."
  },
  {
    "slug": "911",
    "name": "911",
    "makeSlug": "porsche",
    "makeName": "Porsche",
    "yearStart": 1964,
    "yearEnd": null,
    "bodyType": "Coupe/Convertible",
    "description": "The Porsche 911 is one of the most iconic sports cars ever made, evolving over six decades while maintaining its distinctive rear-engine layout. From the base Carrera to the track-focused GT3 RS, the 911 offers performance for every enthusiast."
  },
  {
    "slug": "xc60",
    "name": "XC60",
    "makeSlug": "volvo",
    "makeName": "Volvo",
    "yearStart": 2009,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Volvo XC60 is a compact luxury SUV that prioritizes safety, Scandinavian design, and comfort. Available with mild-hybrid and plug-in hybrid powertrains, the XC60 combines elegance with environmental consciousness."
  },
  {
    "slug": "range-rover",
    "name": "Range Rover",
    "makeSlug": "land-rover",
    "makeName": "Land Rover",
    "yearStart": 1970,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Range Rover is the definitive luxury SUV, combining aristocratic elegance with genuine off-road capability. Each generation has advanced the art of luxury motoring, with the latest offering hybrid powertrains and breathtaking refinement."
  },
  {
    "slug": "escalade",
    "name": "Escalade",
    "makeSlug": "cadillac",
    "makeName": "Cadillac",
    "yearStart": 1999,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Cadillac Escalade is an icon of American luxury, featuring a massive OLED display, Super Cruise hands-free driving, and opulent appointments. The Escalade-V adds supercharged V8 power for performance luxury."
  },
  {
    "slug": "navigator",
    "name": "Navigator",
    "makeSlug": "lincoln",
    "makeName": "Lincoln",
    "yearStart": 1998,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Lincoln Navigator is a full-size luxury SUV that competes with the Cadillac Escalade, offering serene comfort, premium materials, and the spaciousness of a true three-row luxury vehicle."
  },
  {
    "slug": "tundra",
    "name": "Tundra",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 2000,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Toyota Tundra is a full-size pickup truck that brings Toyota reliability to the segment dominated by Detroit trucks. The third-generation Tundra features a twin-turbo V6 with available hybrid powertrain, replacing the previous V8. Known for exceptional durability and strong resale value."
  },
  {
    "slug": "4runner",
    "name": "4Runner",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 1984,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Toyota 4Runner is a body-on-frame midsize SUV built for off-road capability while serving as a practical daily driver. One of the last true truck-based SUVs in its class, the 4Runner has a dedicated following among outdoor enthusiasts. The sixth-generation 4Runner launched in 2025 with modern technology and a hybrid powertrain."
  },
  {
    "slug": "prius",
    "name": "Prius",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 2001,
    "yearEnd": null,
    "bodyType": "Hatchback",
    "description": "The Toyota Prius pioneered the hybrid vehicle segment and remains synonymous with fuel efficiency and eco-friendly driving. The fifth-generation Prius debuted with dramatically improved styling and performance while maintaining exceptional fuel economy. The Prius Prime plug-in hybrid offers extended electric-only range for daily commuting."
  },
  {
    "slug": "pilot",
    "name": "Pilot",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 2003,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Honda Pilot is a three-row midsize SUV that combines family-friendly practicality with Honda engineering and reliability. Redesigned for the fourth generation, the Pilot offers a refined cabin, available TrailSport trim for light off-roading, and seating for up to eight passengers."
  },
  {
    "slug": "odyssey",
    "name": "Odyssey",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 1995,
    "yearEnd": null,
    "bodyType": "Minivan",
    "description": "The Honda Odyssey is consistently rated among the best minivans available, offering versatile seating, a smooth ride, and Honda dependability. The Magic Slide second-row seats provide unmatched flexibility, and the available rear entertainment system keeps passengers entertained on long trips."
  },
  {
    "slug": "hr-v",
    "name": "HR-V",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 2016,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Honda HR-V is a subcompact crossover SUV that offers surprising interior space thanks to Honda Magic Seat flexibility. The second-generation HR-V grew in size and refinement, competing with the Toyota Corolla Cross and Hyundai Kona in the rapidly growing small SUV segment."
  },
  {
    "slug": "ridgeline",
    "name": "Ridgeline",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 2006,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Honda Ridgeline is a unibody midsize pickup truck that prioritizes on-road comfort and daily drivability over traditional truck ruggedness. Unique features include an in-bed trunk, dual-action tailgate, and standard all-wheel drive. The Ridgeline appeals to buyers who want truck utility with car-like refinement."
  },
  {
    "slug": "escape",
    "name": "Escape",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 2001,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Ford Escape is a compact crossover SUV that has been a consistent top seller since its introduction. Available with gas, hybrid, and plug-in hybrid powertrains, the Escape offers versatile efficiency options for every buyer. The latest generation features sleek styling and Ford Co-Pilot360 driver assistance technology."
  },
  {
    "slug": "bronco",
    "name": "Bronco",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 2021,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Ford Bronco returned in 2021 after a 25-year hiatus, offering serious off-road capability to rival the Jeep Wrangler. Available in two-door and four-door configurations with removable roof panels and doors, the Bronco combines rugged capability with modern technology."
  },
  {
    "slug": "ranger",
    "name": "Ranger",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 1983,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Ford Ranger is a midsize pickup truck that offers a balance of capability and maneuverability for buyers who do not need a full-size truck. The current-generation Ranger features a turbocharged engine, available Tremor off-road package, and modern technology including a large touchscreen display."
  },
  {
    "slug": "expedition",
    "name": "Expedition",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 1997,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Ford Expedition is a full-size three-row SUV built on a truck platform for maximum towing and passenger capacity. Available in standard and extended MAX wheelbases, the Expedition offers seating for up to eight with best-in-class cargo space."
  },
  {
    "slug": "edge",
    "name": "Edge",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 2007,
    "yearEnd": 2024,
    "bodyType": "SUV",
    "description": "The Ford Edge was a midsize two-row crossover SUV that offered a spacious interior and comfortable ride without the complexity of a third row. The Edge ST delivered performance-oriented driving dynamics with a twin-turbo V6. Ford discontinued the Edge after the 2024 model year."
  },
  {
    "slug": "tahoe",
    "name": "Tahoe",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 1995,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Chevrolet Tahoe is a full-size SUV that serves as the workhorse of American family hauling and towing. Built on a truck platform, the Tahoe offers seating for up to nine passengers, powerful V8 engines, and the ability to tow up to 8,400 pounds. The latest generation features an independent rear suspension for improved ride quality."
  },
  {
    "slug": "malibu",
    "name": "Malibu",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 1997,
    "yearEnd": 2024,
    "bodyType": "Sedan",
    "description": "The Chevrolet Malibu was a midsize sedan that offered affordable transportation with competitive fuel economy and a comfortable ride. The Malibu served as a value-oriented alternative to the Toyota Camry and Honda Accord for decades. Chevrolet discontinued the Malibu after the 2024 model year to focus on electric vehicles and SUVs."
  },
  {
    "slug": "traverse",
    "name": "Traverse",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 2009,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Chevrolet Traverse is a three-row midsize crossover SUV that offers one of the most spacious interiors in its class. With seating for up to eight passengers and generous cargo capacity, the Traverse is designed for families who need maximum utility."
  },
  {
    "slug": "colorado",
    "name": "Colorado",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 2004,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Chevrolet Colorado is a midsize pickup truck that offers truck capability in a more manageable size than the full-size Silverado. The ZR2 trim provides serious off-road performance with Multimatic DSSV dampers and locking differentials. The Colorado competes with the Toyota Tacoma and Ford Ranger."
  },
  {
    "slug": "camaro",
    "name": "Camaro",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 2010,
    "yearEnd": 2024,
    "bodyType": "Coupe/Convertible",
    "description": "The Chevrolet Camaro is an iconic American muscle car that competed with the Ford Mustang and Dodge Challenger. Available as a coupe or convertible with engines ranging from a turbo-four to the supercharged ZL1 V8, the Camaro offered something for every performance enthusiast. Chevrolet ended Camaro production in 2024."
  },
  {
    "slug": "corvette",
    "name": "Corvette",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 1953,
    "yearEnd": null,
    "bodyType": "Coupe/Convertible",
    "description": "The Chevrolet Corvette is America's sports car, delivering exotic-level performance at a fraction of the price of European rivals. The eighth-generation C8 Corvette moved to a mid-engine layout for the first time in the model's history. The Z06 and E-Ray hybrid variants push performance even further."
  },
  {
    "slug": "forester",
    "name": "Forester",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 1998,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Subaru Forester is a compact crossover SUV with standard all-wheel drive, excellent visibility, and a reputation for reliability and safety. The Forester consistently earns top safety ratings and is popular in regions with challenging weather conditions. The Wilderness trim adds enhanced off-road capability."
  },
  {
    "slug": "crosstrek",
    "name": "Crosstrek",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 2013,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Subaru Crosstrek is a subcompact crossover that combines car-like fuel economy with SUV ground clearance and standard all-wheel drive. One of the most popular vehicles in the Subaru lineup, the Crosstrek appeals to active lifestyle buyers. A plug-in hybrid variant offers extended electric driving range."
  },
  {
    "slug": "impreza",
    "name": "Impreza",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 1993,
    "yearEnd": null,
    "bodyType": "Hatchback",
    "description": "The Subaru Impreza is a compact car with standard symmetrical all-wheel drive, making it one of the most capable vehicles in its class for all-weather driving. Available as a hatchback, the Impreza offers practical transportation with Subaru safety technology and all-wheel-drive confidence."
  },
  {
    "slug": "wrx",
    "name": "WRX",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 2002,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Subaru WRX is a performance sedan with a turbocharged boxer engine and standard all-wheel drive, born from Subaru's World Rally Championship heritage. The WRX offers accessible performance with everyday practicality, making it a favorite among enthusiasts."
  },
  {
    "slug": "legacy",
    "name": "Legacy",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 1990,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Subaru Legacy is a midsize sedan with standard all-wheel drive, distinguishing it from virtually every competitor in its class. The Legacy offers a comfortable, refined driving experience with the confidence of all-weather traction. An available turbocharged engine adds performance to the capable platform."
  },
  {
    "slug": "ascent",
    "name": "Ascent",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 2019,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Subaru Ascent is a three-row midsize SUV designed specifically for the North American market, offering seating for up to eight passengers. Standard all-wheel drive and a turbocharged boxer engine provide confident performance in all conditions. The Ascent was Subaru's first three-row vehicle."
  },
  {
    "slug": "brz",
    "name": "BRZ",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 2013,
    "yearEnd": null,
    "bodyType": "Coupe",
    "description": "The Subaru BRZ is a lightweight rear-wheel-drive sports coupe developed jointly with Toyota. Known for its exceptional handling balance and accessible performance, the BRZ is a pure driver's car in an era of heavy, tech-laden vehicles. The second generation added more power while maintaining the lightweight formula."
  },
  {
    "slug": "tlx",
    "name": "TLX",
    "makeSlug": "acura",
    "makeName": "Acura",
    "yearStart": 2015,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Acura TLX is a sport luxury sedan that combines precision handling with advanced technology and a premium interior. The Type S variant delivers genuine performance with a turbocharged V6 and torque-vectoring all-wheel drive. The TLX competes with the BMW 3 Series and Mercedes-Benz C-Class."
  },
  {
    "slug": "mdx",
    "name": "MDX",
    "makeSlug": "acura",
    "makeName": "Acura",
    "yearStart": 2001,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Acura MDX is a three-row luxury SUV that has been one of the best-selling vehicles in its segment since its introduction. Known for combining Honda reliability with premium appointments and available Super Handling All-Wheel Drive. The MDX Type S adds a turbocharged V6 for enhanced performance."
  },
  {
    "slug": "rdx",
    "name": "RDX",
    "makeSlug": "acura",
    "makeName": "Acura",
    "yearStart": 2007,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Acura RDX is a compact luxury crossover SUV that offers a turbocharged engine, a spacious interior, and Acura's precision-crafted design philosophy. The RDX features the True Touchpad Interface and available A-Spec styling for a sportier appearance. It competes with the Lexus NX and BMW X3."
  },
  {
    "slug": "integra",
    "name": "Integra",
    "makeSlug": "acura",
    "makeName": "Acura",
    "yearStart": 2023,
    "yearEnd": null,
    "bodyType": "Hatchback",
    "description": "The Acura Integra was revived in 2023 as a premium sport compact liftback, carrying on the legacy of the beloved original. Sharing its platform with the Honda Civic, the Integra offers a six-speed manual transmission and engaging driving dynamics. The Integra Type S delivers track-ready performance with a turbocharged engine."
  },
  {
    "slug": "charger",
    "name": "Charger",
    "makeSlug": "dodge",
    "makeName": "Dodge",
    "yearStart": 2006,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Dodge Charger is an American muscle sedan that combines aggressive styling with powerful engine options, including the legendary HEMI V8. The Charger SRT Hellcat and Redeye variants delivered supercharged performance exceeding 700 horsepower. Dodge has transitioned the Charger to an electrified platform for the next generation."
  },
  {
    "slug": "challenger",
    "name": "Challenger",
    "makeSlug": "dodge",
    "makeName": "Dodge",
    "yearStart": 2008,
    "yearEnd": 2024,
    "bodyType": "Coupe",
    "description": "The Dodge Challenger is a retro-styled muscle car that carried the torch for American V8 performance. From the V6 SXT to the supercharged Hellcat and the record-breaking Demon 170, the Challenger offered something for every performance enthusiast. Production ended in 2024 as Dodge transitions to electrified performance."
  },
  {
    "slug": "durango",
    "name": "Durango",
    "makeSlug": "dodge",
    "makeName": "Dodge",
    "yearStart": 2004,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Dodge Durango is a three-row performance SUV that stands apart from competitors with available V8 power and muscular styling. The Durango SRT and SRT Hellcat variants made it the fastest and most powerful three-row SUV available. The Durango combines family hauling capability with genuine performance credentials."
  },
  {
    "slug": "hornet",
    "name": "Hornet",
    "makeSlug": "dodge",
    "makeName": "Dodge",
    "yearStart": 2024,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Dodge Hornet is a compact performance crossover that brings the brand's muscle car attitude to the growing small SUV segment. Available with a turbocharged engine or a plug-in hybrid R/T powertrain with over 280 horsepower. The Hornet marks Dodge's entry into the electrified performance crossover market."
  },
  {
    "slug": "sierra",
    "name": "Sierra",
    "makeSlug": "gmc",
    "makeName": "GMC",
    "yearStart": 1999,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The GMC Sierra is a full-size pickup truck that shares its platform with the Chevrolet Silverado but adds premium features and distinctive styling. The Sierra Denali is one of the most luxurious trucks available, while the AT4 trim offers enhanced off-road capability. The Sierra was the first truck to offer a MultiPro tailgate with six unique functions."
  },
  {
    "slug": "yukon",
    "name": "Yukon",
    "makeSlug": "gmc",
    "makeName": "GMC",
    "yearStart": 1992,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The GMC Yukon is a full-size SUV built on the same platform as the Chevrolet Tahoe, offering a premium experience with three rows of seating and powerful V8 engines. The Yukon Denali is the flagship model with exclusive features, while the Yukon XL provides additional cargo and passenger space. The current generation features an independent rear suspension for improved ride quality."
  },
  {
    "slug": "terrain",
    "name": "Terrain",
    "makeSlug": "gmc",
    "makeName": "GMC",
    "yearStart": 2010,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The GMC Terrain is a compact crossover SUV that offers a refined cabin, good fuel economy, and GMC's professional-grade image. The Terrain competes with the Chevrolet Equinox and offers available all-wheel drive with a choice of turbocharged engines. The Denali trim adds premium materials and exclusive styling elements."
  },
  {
    "slug": "acadia",
    "name": "Acadia",
    "makeSlug": "gmc",
    "makeName": "GMC",
    "yearStart": 2007,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The GMC Acadia is a midsize crossover SUV offering available three-row seating in a more manageable footprint than the full-size Yukon. The Acadia Denali and AT4 trims cater to luxury and adventure buyers respectively. The Acadia provides a good balance of passenger space, cargo capacity, and driving dynamics."
  },
  {
    "slug": "canyon",
    "name": "Canyon",
    "makeSlug": "gmc",
    "makeName": "GMC",
    "yearStart": 2004,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The GMC Canyon is a midsize pickup truck that shares its platform with the Chevrolet Colorado but adds a more upscale presentation. The Canyon AT4X is one of the most capable off-road midsize trucks available, with Multimatic DSSV dampers and front and rear locking differentials. The Denali trim brings full-size luxury to the midsize segment."
  },
  {
    "slug": "gv70",
    "name": "GV70",
    "makeSlug": "genesis",
    "makeName": "Genesis",
    "yearStart": 2022,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Genesis GV70 is a compact luxury SUV that quickly established itself as a serious competitor to the BMW X3 and Mercedes-Benz GLC. Offering a choice of turbocharged four-cylinder and twin-turbo V6 engines with available all-wheel drive. The GV70 delivers exceptional value with standard features that are optional on German rivals."
  },
  {
    "slug": "gv80",
    "name": "GV80",
    "makeSlug": "genesis",
    "makeName": "Genesis",
    "yearStart": 2021,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Genesis GV80 is a midsize luxury SUV that announced Genesis as a legitimate luxury brand when it debuted. Available with three rows of seating, the GV80 features a serene cabin with premium materials and advanced technology. The GV80 competes with the BMW X5 and Mercedes-Benz GLE at a more accessible price point."
  },
  {
    "slug": "g70",
    "name": "G70",
    "makeSlug": "genesis",
    "makeName": "Genesis",
    "yearStart": 2019,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Genesis G70 is a compact sport sedan that has won multiple comparison tests against the BMW 3 Series and Mercedes-Benz C-Class. With a turbocharged 2.0T or powerful 3.3T twin-turbo V6, the G70 delivers engaging driving dynamics. Genesis includes complimentary scheduled maintenance and concierge service with every G70."
  },
  {
    "slug": "g80",
    "name": "G80",
    "makeSlug": "genesis",
    "makeName": "Genesis",
    "yearStart": 2017,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Genesis G80 is a midsize luxury sedan that competes with the BMW 5 Series and Mercedes-Benz E-Class. The G80 offers elegant design, a quiet and refined cabin, and an extensive list of standard features. An all-electric Electrified G80 variant brings EV luxury to the lineup."
  },
  {
    "slug": "outlander",
    "name": "Outlander",
    "makeSlug": "mitsubishi",
    "makeName": "Mitsubishi",
    "yearStart": 2003,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Mitsubishi Outlander is a compact crossover SUV that offers available three-row seating and one of the most affordable plug-in hybrid options in the market. The Outlander PHEV provides substantial electric-only range for daily commuting while maintaining SUV versatility. The latest generation features a bold new design and partnership-derived technology from the Nissan-Mitsubishi alliance."
  },
  {
    "slug": "eclipse-cross",
    "name": "Eclipse Cross",
    "makeSlug": "mitsubishi",
    "makeName": "Mitsubishi",
    "yearStart": 2018,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Mitsubishi Eclipse Cross is a compact crossover SUV that slots between the smaller Outlander Sport and the larger Outlander in the lineup. Featuring a distinctive coupe-like roofline and available Super All-Wheel Control, the Eclipse Cross offers a unique design in the crowded compact SUV market. Competitive pricing and a generous warranty make it a solid value proposition."
  },
  {
    "slug": "pacifica",
    "name": "Pacifica",
    "makeSlug": "chrysler",
    "makeName": "Chrysler",
    "yearStart": 2017,
    "yearEnd": null,
    "bodyType": "Minivan",
    "description": "The Chrysler Pacifica is widely regarded as the best minivan on the market, offering a refined interior, innovative Stow 'n Go seating, and available plug-in hybrid powertrain. The Pacifica Hybrid was the first electrified minivan, providing significant fuel savings for family transportation. Available all-wheel drive and the Uconnect 5 infotainment system keep the Pacifica competitive."
  },
  {
    "slug": "300",
    "name": "300",
    "makeSlug": "chrysler",
    "makeName": "Chrysler",
    "yearStart": 2005,
    "yearEnd": 2024,
    "bodyType": "Sedan",
    "description": "The Chrysler 300 was a full-size sedan that combined bold American styling with available V8 power and a rear-wheel-drive platform. The 300S offered a sportier driving experience, while the top-tier 300C featured the legendary 6.4-liter HEMI V8. Chrysler discontinued the 300 after the 2024 model year as the brand transitions toward electrification."
  },
  {
    "slug": "enclave",
    "name": "Enclave",
    "makeSlug": "buick",
    "makeName": "Buick",
    "yearStart": 2008,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Buick Enclave is a three-row luxury crossover SUV that offers a quiet, comfortable cabin with premium features at a more accessible price than many luxury competitors. The Enclave's spacious interior seats up to seven or eight passengers, making it a popular family vehicle. Buick's QuietTuning technology ensures a serene driving experience."
  },
  {
    "slug": "encore-gx",
    "name": "Encore GX",
    "makeSlug": "buick",
    "makeName": "Buick",
    "yearStart": 2020,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Buick Encore GX is a subcompact luxury crossover SUV that bridges the gap between the smaller Encore and the larger Envision. Offering available all-wheel drive and a choice of turbocharged three-cylinder engines, the Encore GX provides premium features in a compact package. The Sport Touring trim adds sporty visual elements and enhanced technology."
  },
  {
    "slug": "envision",
    "name": "Envision",
    "makeSlug": "buick",
    "makeName": "Buick",
    "yearStart": 2016,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Buick Envision is a compact luxury crossover SUV that offers a comfortable ride, a quiet cabin, and Buick's signature premium experience. Standard features include a turbocharged engine, an 8-inch touchscreen, and active safety technology. The Envision Avenir trim adds exclusive materials and design elements for a true luxury experience."
  }
]
