[
  {
    "slug": "camry",
    "name": "Camry",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 1983,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Toyota Camry has been America's best-selling sedan for over two decades, offering a balanced combination of comfort, reliability, and fuel efficiency. Known for exceptional resale value and low cost of ownership, the Camry is the benchmark midsize sedan."
  },
  {
    "slug": "corolla",
    "name": "Corolla",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 1966,
    "yearEnd": null,
    "bodyType": "Sedan/Hatchback",
    "description": "The Toyota Corolla is the best-selling car in history with over 50 million units sold worldwide. Known for bulletproof reliability and low running costs, the Corolla offers practical transportation with modern technology and safety features."
  },
  {
    "slug": "rav4",
    "name": "RAV4",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 1996,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Toyota RAV4 is one of the best-selling SUVs in the world, pioneering the compact crossover segment in 1996. Available as a gas model, hybrid, plug-in hybrid, and the sporty RAV4 Prime, it offers versatility for every buyer."
  },
  {
    "slug": "highlander",
    "name": "Highlander",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 2001,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Toyota Highlander is a three-row midsize SUV that combines family-friendly space with Toyota reliability. Available with a fuel-efficient hybrid powertrain, the Highlander offers comfortable seating for up to eight passengers."
  },
  {
    "slug": "tacoma",
    "name": "Tacoma",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 1995,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Toyota Tacoma is the best-selling midsize pickup truck in America, prized for its off-road capability and legendary resale value. The TRD Pro trim is one of the most capable factory off-road trucks available."
  },
  {
    "slug": "civic",
    "name": "Civic",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 1973,
    "yearEnd": null,
    "bodyType": "Sedan/Hatchback",
    "description": "The Honda Civic is one of the most popular compact cars in history, known for excellent fuel efficiency, engaging driving dynamics, and long-term reliability. The Civic Type R is one of the most acclaimed performance hatchbacks available."
  },
  {
    "slug": "accord",
    "name": "Accord",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 1976,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Honda Accord is a midsize sedan that consistently earns top marks for quality, value, and driving enjoyment. The Accord has won more Car and Driver 10Best awards than any other vehicle in history."
  },
  {
    "slug": "cr-v",
    "name": "CR-V",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 1997,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Honda CR-V is one of the best-selling compact SUVs in America, offering a spacious interior, excellent fuel economy, and Honda's reputation for dependability. The CR-V Hybrid adds electric assistance for even better efficiency."
  },
  {
    "slug": "f-150",
    "name": "F-150",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 1948,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Ford F-150 has been America's best-selling vehicle for over 40 consecutive years, offering unmatched versatility from work truck to luxury hauler. The F-150 Lightning brings full-size truck capability to the electric age."
  },
  {
    "slug": "explorer",
    "name": "Explorer",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 1991,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Ford Explorer helped create the SUV boom of the 1990s and remains one of the most popular three-row SUVs in America. The Explorer offers seating for seven with a range of powertrains including a performance ST model."
  },
  {
    "slug": "mustang",
    "name": "Mustang",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 1965,
    "yearEnd": null,
    "bodyType": "Coupe/Convertible",
    "description": "The Ford Mustang is an American icon and the world's best-selling sports car, offering thrilling performance at accessible prices. From the turbocharged EcoBoost to the supercharged GT500, the Mustang delivers excitement for every budget."
  },
  {
    "slug": "silverado",
    "name": "Silverado",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 1999,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Chevrolet Silverado is one of America's best-selling full-size trucks, competing directly with the Ford F-150 and Ram 1500. Available in a wide range of trims from work truck to luxury High Country, the Silverado offers capability for every need."
  },
  {
    "slug": "equinox",
    "name": "Equinox",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 2005,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Chevrolet Equinox is a compact crossover SUV that offers a comfortable ride, good fuel economy, and a competitive price point. The all-electric Equinox EV brings affordable electric transportation to the mainstream market."
  },
  {
    "slug": "3-series",
    "name": "3 Series",
    "makeSlug": "bmw",
    "makeName": "BMW",
    "yearStart": 1975,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The BMW 3 Series is the sports sedan benchmark, setting the standard for driving dynamics in the luxury segment for nearly five decades. Available as a sedan and wagon, with rear-wheel and all-wheel drive options."
  },
  {
    "slug": "x3",
    "name": "X3",
    "makeSlug": "bmw",
    "makeName": "BMW",
    "yearStart": 2004,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The BMW X3 is one of the best-selling luxury compact SUVs, offering BMW's trademark driving dynamics in a practical package. The X3 M Competition delivers supercar-rivaling performance in an SUV body."
  },
  {
    "slug": "c-class",
    "name": "C-Class",
    "makeSlug": "mercedes-benz",
    "makeName": "Mercedes-Benz",
    "yearStart": 1993,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Mercedes-Benz C-Class is the entry point to the Mercedes luxury sedan lineup, offering cutting-edge technology, refined comfort, and the prestige of the three-pointed star badge. The AMG C 63 variant delivers explosive performance."
  },
  {
    "slug": "gle",
    "name": "GLE",
    "makeSlug": "mercedes-benz",
    "makeName": "Mercedes-Benz",
    "yearStart": 1998,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Mercedes-Benz GLE is a midsize luxury SUV that combines comfort, technology, and capability in a sophisticated package. Available with mild-hybrid, plug-in hybrid, and high-performance AMG powertrains."
  },
  {
    "slug": "a4",
    "name": "A4",
    "makeSlug": "audi",
    "makeName": "Audi",
    "yearStart": 1996,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Audi A4 is a compact luxury sedan known for its refined interior, advanced technology, and available quattro all-wheel drive. The A4 competes with the BMW 3 Series and Mercedes C-Class in the fiercely competitive entry luxury segment."
  },
  {
    "slug": "q5",
    "name": "Q5",
    "makeSlug": "audi",
    "makeName": "Audi",
    "yearStart": 2009,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Audi Q5 is one of the best-selling luxury compact SUVs, offering a premium interior, smooth ride, and Audi's legendary quattro all-wheel-drive system. The Q5 is available in standard, Sportback, and high-performance SQ5 variants."
  },
  {
    "slug": "altima",
    "name": "Altima",
    "makeSlug": "nissan",
    "makeName": "Nissan",
    "yearStart": 1993,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Nissan Altima is a midsize sedan that offers available all-wheel drive, a rarity in the segment, along with good fuel economy and a comfortable cabin. The Altima competes with the Camry, Accord, and Malibu."
  },
  {
    "slug": "rogue",
    "name": "Rogue",
    "makeSlug": "nissan",
    "makeName": "Nissan",
    "yearStart": 2008,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Nissan Rogue is one of the best-selling compact SUVs in America, offering a spacious interior, excellent fuel economy, and a comprehensive suite of safety technology. The Rogue was completely redesigned with bold styling."
  },
  {
    "slug": "elantra",
    "name": "Elantra",
    "makeSlug": "hyundai",
    "makeName": "Hyundai",
    "yearStart": 1991,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Hyundai Elantra is a compact sedan that punches above its weight with a stylish design, generous features, and excellent warranty coverage. The Elantra N variant offers genuine sports sedan performance at an accessible price."
  },
  {
    "slug": "tucson",
    "name": "Tucson",
    "makeSlug": "hyundai",
    "makeName": "Hyundai",
    "yearStart": 2005,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Hyundai Tucson is a compact crossover SUV with bold styling, a premium interior, and available hybrid and plug-in hybrid powertrains. The Tucson offers one of the best value propositions in its class."
  },
  {
    "slug": "santa-fe",
    "name": "Santa Fe",
    "makeSlug": "hyundai",
    "makeName": "Hyundai",
    "yearStart": 2001,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Hyundai Santa Fe is a midsize SUV offering a comfortable ride, generous standard features, and available hybrid and plug-in hybrid powertrains. The Santa Fe provides excellent value with a spacious interior and Hyundai's comprehensive warranty."
  },
  {
    "slug": "sonata",
    "name": "Sonata",
    "makeSlug": "hyundai",
    "makeName": "Hyundai",
    "yearStart": 1985,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Hyundai Sonata is a midsize sedan known for its striking design, generous features, and excellent value. Available in hybrid and N Line performance variants, the Sonata offers a compelling alternative to traditional segment leaders."
  },
  {
    "slug": "kona",
    "name": "Kona",
    "makeSlug": "hyundai",
    "makeName": "Hyundai",
    "yearStart": 2018,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Hyundai Kona is a subcompact crossover SUV offering distinctive styling, a tech-rich interior, and available all-wheel drive. The Kona Electric variant provides a fully electric option with competitive range."
  },
  {
    "slug": "palisade",
    "name": "Palisade",
    "makeSlug": "hyundai",
    "makeName": "Hyundai",
    "yearStart": 2020,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Hyundai Palisade is a three-row SUV that elevated Hyundai's brand with premium materials, a refined ride, and a spacious cabin. The Palisade offers near-luxury features at a mainstream price."
  },
  {
    "slug": "venue",
    "name": "Venue",
    "makeSlug": "hyundai",
    "makeName": "Hyundai",
    "yearStart": 2020,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Hyundai Venue is an entry-level subcompact SUV offering an affordable starting price, easy maneuverability, and a surprisingly feature-rich interior for its class."
  },
  {
    "slug": "ioniq-5",
    "name": "IONIQ 5",
    "makeSlug": "hyundai",
    "makeName": "Hyundai",
    "yearStart": 2022,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Hyundai IONIQ 5 is an all-electric crossover built on Hyundai's dedicated E-GMP platform, featuring ultra-fast 800V charging, a retro-futuristic design, and a spacious flat-floor interior."
  },
  {
    "slug": "sorento",
    "name": "Sorento",
    "makeSlug": "kia",
    "makeName": "Kia",
    "yearStart": 2003,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Kia Sorento is a midsize SUV offering three rows of seating, available hybrid and plug-in hybrid powertrains, and Kia's industry-leading warranty. The Sorento combines family practicality with attractive design."
  },
  {
    "slug": "telluride",
    "name": "Telluride",
    "makeSlug": "kia",
    "makeName": "Kia",
    "yearStart": 2020,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Kia Telluride quickly became one of the most acclaimed SUVs in America, winning multiple SUV of the Year awards with its spacious three-row interior, premium feel, and competitive pricing."
  },
  {
    "slug": "sportage",
    "name": "Sportage",
    "makeSlug": "kia",
    "makeName": "Kia",
    "yearStart": 1993,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Kia Sportage is a compact SUV with bold styling, a tech-forward interior, and available hybrid and plug-in hybrid powertrains. The Sportage offers one of the most distinctive designs in its segment."
  },
  {
    "slug": "forte",
    "name": "Forte",
    "makeSlug": "kia",
    "makeName": "Kia",
    "yearStart": 2010,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Kia Forte is a compact sedan offering excellent value with a generous features list, a comfortable ride, and Kia's industry-leading warranty. Available in sedan and hatchback body styles."
  },
  {
    "slug": "soul",
    "name": "Soul",
    "makeSlug": "kia",
    "makeName": "Kia",
    "yearStart": 2010,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Kia Soul is a distinctive boxy crossover known for its funky styling, spacious interior, and value-oriented pricing. The Soul EV offers an all-electric variant for eco-conscious buyers."
  },
  {
    "slug": "k5",
    "name": "K5",
    "makeSlug": "kia",
    "makeName": "Kia",
    "yearStart": 2021,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Kia K5 replaced the Optima as Kia's midsize sedan, bringing a sportier design, available all-wheel drive, and a turbocharged GT variant with genuine performance credentials."
  },
  {
    "slug": "seltos",
    "name": "Seltos",
    "makeSlug": "kia",
    "makeName": "Kia",
    "yearStart": 2021,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Kia Seltos is a subcompact SUV slotting between the Soul and Sportage, offering a refined ride, available all-wheel drive, and a well-appointed interior at a competitive price."
  },
  {
    "slug": "ev6",
    "name": "EV6",
    "makeSlug": "kia",
    "makeName": "Kia",
    "yearStart": 2022,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Kia EV6 is an all-electric crossover built on the E-GMP platform, featuring ultra-fast charging, a striking design, and the high-performance GT variant producing over 576 horsepower."
  },
  {
    "slug": "model-3",
    "name": "Model 3",
    "makeSlug": "tesla",
    "makeName": "Tesla",
    "yearStart": 2017,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Tesla Model 3 brought electric vehicles to the mainstream market with impressive range, instant acceleration, and access to the Tesla Supercharger network. The Model 3 is one of the best-selling electric vehicles in history."
  },
  {
    "slug": "model-y",
    "name": "Model Y",
    "makeSlug": "tesla",
    "makeName": "Tesla",
    "yearStart": 2020,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Tesla Model Y is a compact electric SUV that has become one of the best-selling vehicles in the world across all powertrains. Offering impressive range, cargo space, and Tesla's technology ecosystem."
  },
  {
    "slug": "wrangler",
    "name": "Wrangler",
    "makeSlug": "jeep",
    "makeName": "Jeep",
    "yearStart": 1987,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Jeep Wrangler is the ultimate off-road SUV, offering removable doors and roof panels, solid axles, and legendary Trail Rated capability. The Wrangler 4xe plug-in hybrid adds electric torque for trail crawling."
  },
  {
    "slug": "grand-cherokee",
    "name": "Grand Cherokee",
    "makeSlug": "jeep",
    "makeName": "Jeep",
    "yearStart": 1993,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Jeep Grand Cherokee is a premium midsize SUV that combines genuine off-road capability with on-road luxury. The Grand Cherokee L adds a third row, while the Grand Cherokee 4xe offers plug-in hybrid efficiency."
  },
  {
    "slug": "1500",
    "name": "1500",
    "makeSlug": "ram",
    "makeName": "Ram",
    "yearStart": 2010,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Ram 1500 is widely praised as having the most refined interior and smoothest ride in the full-size truck segment. The coil-spring rear suspension and available air suspension set it apart from competitors."
  },
  {
    "slug": "outback",
    "name": "Outback",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 1995,
    "yearEnd": null,
    "bodyType": "Wagon/SUV",
    "description": "The Subaru Outback is a rugged wagon-SUV crossover with standard all-wheel drive and impressive ground clearance. Popular with outdoor enthusiasts, the Outback offers reliable all-weather capability and excellent visibility."
  },
  {
    "slug": "cx-5",
    "name": "CX-5",
    "makeSlug": "mazda",
    "makeName": "Mazda",
    "yearStart": 2013,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Mazda CX-5 is a compact crossover that offers a premium driving experience at mainstream prices, with engaging handling and an upscale interior. The CX-5 consistently earns top ratings for driving dynamics in its class."
  },
  {
    "slug": "rx",
    "name": "RX",
    "makeSlug": "lexus",
    "makeName": "Lexus",
    "yearStart": 1999,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Lexus RX is the best-selling luxury SUV in America, pioneering the luxury crossover segment with its combination of comfort, reliability, and refinement. Available as a hybrid and plug-in hybrid for exceptional fuel efficiency."
  },
  {
    "slug": "jetta",
    "name": "Jetta",
    "makeSlug": "volkswagen",
    "makeName": "Volkswagen",
    "yearStart": 1979,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Volkswagen Jetta is a compact sedan that offers German engineering and build quality at an accessible price point. The Jetta GLI provides genuine sport sedan performance with an affordable price tag."
  },
  {
    "slug": "tiguan",
    "name": "Tiguan",
    "makeSlug": "volkswagen",
    "makeName": "Volkswagen",
    "yearStart": 2008,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Volkswagen Tiguan is a compact SUV that offers European driving dynamics, a spacious interior, and available third-row seating. The Tiguan combines VW's engineering heritage with everyday practicality."
  },
  {
    "slug": "atlas",
    "name": "Atlas",
    "makeSlug": "volkswagen",
    "makeName": "Volkswagen",
    "yearStart": 2018,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Volkswagen Atlas is a three-row midsize SUV offering one of the most spacious interiors in its class, straightforward technology, and a comfortable ride designed specifically for American families."
  },
  {
    "slug": "taos",
    "name": "Taos",
    "makeSlug": "volkswagen",
    "makeName": "Volkswagen",
    "yearStart": 2022,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Volkswagen Taos is a subcompact SUV offering German engineering at an accessible price, with a roomy interior for its size and available all-wheel drive."
  },
  {
    "slug": "golf",
    "name": "Golf",
    "makeSlug": "volkswagen",
    "makeName": "Volkswagen",
    "yearStart": 1974,
    "yearEnd": null,
    "bodyType": "Hatchback",
    "description": "The Volkswagen Golf is an iconic hatchback known worldwide for its refined driving dynamics, practical design, and versatility. The Golf GTI and Golf R variants are benchmark hot hatches."
  },
  {
    "slug": "id-4",
    "name": "ID.4",
    "makeSlug": "volkswagen",
    "makeName": "Volkswagen",
    "yearStart": 2021,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Volkswagen ID.4 is an all-electric compact SUV built on VW's MEB platform, offering a spacious interior, competitive range, and an approachable entry point into electric vehicle ownership."
  },
  {
    "slug": "atlas-cross-sport",
    "name": "Atlas Cross Sport",
    "makeSlug": "volkswagen",
    "makeName": "Volkswagen",
    "yearStart": 2020,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Volkswagen Atlas Cross Sport is a two-row midsize SUV with a sportier roofline than the standard Atlas, offering a stylish design, generous cargo space, and available V6 power."
  },
  {
    "slug": "cayenne",
    "name": "Cayenne",
    "makeSlug": "porsche",
    "makeName": "Porsche",
    "yearStart": 2003,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Porsche Cayenne redefined the luxury performance SUV segment, offering genuine Porsche driving dynamics in a practical five-seat package. Available with twin-turbo V6, V8, and plug-in hybrid powertrains."
  },
  {
    "slug": "911",
    "name": "911",
    "makeSlug": "porsche",
    "makeName": "Porsche",
    "yearStart": 1964,
    "yearEnd": null,
    "bodyType": "Coupe/Convertible",
    "description": "The Porsche 911 is one of the most iconic sports cars ever made, evolving over six decades while maintaining its distinctive rear-engine layout. From the base Carrera to the track-focused GT3 RS, the 911 offers performance for every enthusiast."
  },
  {
    "slug": "xc60",
    "name": "XC60",
    "makeSlug": "volvo",
    "makeName": "Volvo",
    "yearStart": 2009,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Volvo XC60 is a compact luxury SUV that prioritizes safety, Scandinavian design, and comfort. Available with mild-hybrid and plug-in hybrid powertrains, the XC60 combines elegance with environmental consciousness."
  },
  {
    "slug": "range-rover",
    "name": "Range Rover",
    "makeSlug": "land-rover",
    "makeName": "Land Rover",
    "yearStart": 1970,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Range Rover is the definitive luxury SUV, combining aristocratic elegance with genuine off-road capability. Each generation has advanced the art of luxury motoring, with the latest offering hybrid powertrains and breathtaking refinement."
  },
  {
    "slug": "escalade",
    "name": "Escalade",
    "makeSlug": "cadillac",
    "makeName": "Cadillac",
    "yearStart": 1999,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Cadillac Escalade is an icon of American luxury, featuring a massive OLED display, Super Cruise hands-free driving, and opulent appointments. The Escalade-V adds supercharged V8 power for performance luxury."
  },
  {
    "slug": "navigator",
    "name": "Navigator",
    "makeSlug": "lincoln",
    "makeName": "Lincoln",
    "yearStart": 1998,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Lincoln Navigator is a full-size luxury SUV that competes with the Cadillac Escalade, offering serene comfort, premium materials, and the spaciousness of a true three-row luxury vehicle."
  },
  {
    "slug": "tundra",
    "name": "Tundra",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 2000,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Toyota Tundra is a full-size pickup truck that brings Toyota reliability to the segment dominated by Detroit trucks. The third-generation Tundra features a twin-turbo V6 with available hybrid powertrain, replacing the previous V8. Known for exceptional durability and strong resale value."
  },
  {
    "slug": "4runner",
    "name": "4Runner",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 1984,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Toyota 4Runner is a body-on-frame midsize SUV built for off-road capability while serving as a practical daily driver. One of the last true truck-based SUVs in its class, the 4Runner has a dedicated following among outdoor enthusiasts. The sixth-generation 4Runner launched in 2025 with modern technology and a hybrid powertrain."
  },
  {
    "slug": "prius",
    "name": "Prius",
    "makeSlug": "toyota",
    "makeName": "Toyota",
    "yearStart": 2001,
    "yearEnd": null,
    "bodyType": "Hatchback",
    "description": "The Toyota Prius pioneered the hybrid vehicle segment and remains synonymous with fuel efficiency and eco-friendly driving. The fifth-generation Prius debuted with dramatically improved styling and performance while maintaining exceptional fuel economy. The Prius Prime plug-in hybrid offers extended electric-only range for daily commuting."
  },
  {
    "slug": "pilot",
    "name": "Pilot",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 2003,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Honda Pilot is a three-row midsize SUV that combines family-friendly practicality with Honda engineering and reliability. Redesigned for the fourth generation, the Pilot offers a refined cabin, available TrailSport trim for light off-roading, and seating for up to eight passengers."
  },
  {
    "slug": "odyssey",
    "name": "Odyssey",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 1995,
    "yearEnd": null,
    "bodyType": "Minivan",
    "description": "The Honda Odyssey is consistently rated among the best minivans available, offering versatile seating, a smooth ride, and Honda dependability. The Magic Slide second-row seats provide unmatched flexibility, and the available rear entertainment system keeps passengers entertained on long trips."
  },
  {
    "slug": "hr-v",
    "name": "HR-V",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 2016,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Honda HR-V is a subcompact crossover SUV that offers surprising interior space thanks to Honda Magic Seat flexibility. The second-generation HR-V grew in size and refinement, competing with the Toyota Corolla Cross and Hyundai Kona in the rapidly growing small SUV segment."
  },
  {
    "slug": "ridgeline",
    "name": "Ridgeline",
    "makeSlug": "honda",
    "makeName": "Honda",
    "yearStart": 2006,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Honda Ridgeline is a unibody midsize pickup truck that prioritizes on-road comfort and daily drivability over traditional truck ruggedness. Unique features include an in-bed trunk, dual-action tailgate, and standard all-wheel drive. The Ridgeline appeals to buyers who want truck utility with car-like refinement."
  },
  {
    "slug": "escape",
    "name": "Escape",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 2001,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Ford Escape is a compact crossover SUV that has been a consistent top seller since its introduction. Available with gas, hybrid, and plug-in hybrid powertrains, the Escape offers versatile efficiency options for every buyer. The latest generation features sleek styling and Ford Co-Pilot360 driver assistance technology."
  },
  {
    "slug": "bronco",
    "name": "Bronco",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 2021,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Ford Bronco returned in 2021 after a 25-year hiatus, offering serious off-road capability to rival the Jeep Wrangler. Available in two-door and four-door configurations with removable roof panels and doors, the Bronco combines rugged capability with modern technology."
  },
  {
    "slug": "ranger",
    "name": "Ranger",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 1983,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Ford Ranger is a midsize pickup truck that offers a balance of capability and maneuverability for buyers who do not need a full-size truck. The current-generation Ranger features a turbocharged engine, available Tremor off-road package, and modern technology including a large touchscreen display."
  },
  {
    "slug": "expedition",
    "name": "Expedition",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 1997,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Ford Expedition is a full-size three-row SUV built on a truck platform for maximum towing and passenger capacity. Available in standard and extended MAX wheelbases, the Expedition offers seating for up to eight with best-in-class cargo space."
  },
  {
    "slug": "edge",
    "name": "Edge",
    "makeSlug": "ford",
    "makeName": "Ford",
    "yearStart": 2007,
    "yearEnd": 2024,
    "bodyType": "SUV",
    "description": "The Ford Edge was a midsize two-row crossover SUV that offered a spacious interior and comfortable ride without the complexity of a third row. The Edge ST delivered performance-oriented driving dynamics with a twin-turbo V6. Ford discontinued the Edge after the 2024 model year."
  },
  {
    "slug": "tahoe",
    "name": "Tahoe",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 1995,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Chevrolet Tahoe is a full-size SUV that serves as the workhorse of American family hauling and towing. Built on a truck platform, the Tahoe offers seating for up to nine passengers, powerful V8 engines, and the ability to tow up to 8,400 pounds. The latest generation features an independent rear suspension for improved ride quality."
  },
  {
    "slug": "malibu",
    "name": "Malibu",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 1997,
    "yearEnd": 2024,
    "bodyType": "Sedan",
    "description": "The Chevrolet Malibu was a midsize sedan that offered affordable transportation with competitive fuel economy and a comfortable ride. The Malibu served as a value-oriented alternative to the Toyota Camry and Honda Accord for decades. Chevrolet discontinued the Malibu after the 2024 model year to focus on electric vehicles and SUVs."
  },
  {
    "slug": "traverse",
    "name": "Traverse",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 2009,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Chevrolet Traverse is a three-row midsize crossover SUV that offers one of the most spacious interiors in its class. With seating for up to eight passengers and generous cargo capacity, the Traverse is designed for families who need maximum utility."
  },
  {
    "slug": "colorado",
    "name": "Colorado",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 2004,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Chevrolet Colorado is a midsize pickup truck that offers truck capability in a more manageable size than the full-size Silverado. The ZR2 trim provides serious off-road performance with Multimatic DSSV dampers and locking differentials. The Colorado competes with the Toyota Tacoma and Ford Ranger."
  },
  {
    "slug": "camaro",
    "name": "Camaro",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 2010,
    "yearEnd": 2024,
    "bodyType": "Coupe/Convertible",
    "description": "The Chevrolet Camaro is an iconic American muscle car that competed with the Ford Mustang and Dodge Challenger. Available as a coupe or convertible with engines ranging from a turbo-four to the supercharged ZL1 V8, the Camaro offered something for every performance enthusiast. Chevrolet ended Camaro production in 2024."
  },
  {
    "slug": "corvette",
    "name": "Corvette",
    "makeSlug": "chevrolet",
    "makeName": "Chevrolet",
    "yearStart": 1953,
    "yearEnd": null,
    "bodyType": "Coupe/Convertible",
    "description": "The Chevrolet Corvette is America's sports car, delivering exotic-level performance at a fraction of the price of European rivals. The eighth-generation C8 Corvette moved to a mid-engine layout for the first time in the model's history. The Z06 and E-Ray hybrid variants push performance even further."
  },
  {
    "slug": "forester",
    "name": "Forester",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 1998,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Subaru Forester is a compact crossover SUV with standard all-wheel drive, excellent visibility, and a reputation for reliability and safety. The Forester consistently earns top safety ratings and is popular in regions with challenging weather conditions. The Wilderness trim adds enhanced off-road capability."
  },
  {
    "slug": "crosstrek",
    "name": "Crosstrek",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 2013,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Subaru Crosstrek is a subcompact crossover that combines car-like fuel economy with SUV ground clearance and standard all-wheel drive. One of the most popular vehicles in the Subaru lineup, the Crosstrek appeals to active lifestyle buyers. A plug-in hybrid variant offers extended electric driving range."
  },
  {
    "slug": "impreza",
    "name": "Impreza",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 1993,
    "yearEnd": null,
    "bodyType": "Hatchback",
    "description": "The Subaru Impreza is a compact car with standard symmetrical all-wheel drive, making it one of the most capable vehicles in its class for all-weather driving. Available as a hatchback, the Impreza offers practical transportation with Subaru safety technology and all-wheel-drive confidence."
  },
  {
    "slug": "wrx",
    "name": "WRX",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 2002,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Subaru WRX is a performance sedan with a turbocharged boxer engine and standard all-wheel drive, born from Subaru's World Rally Championship heritage. The WRX offers accessible performance with everyday practicality, making it a favorite among enthusiasts."
  },
  {
    "slug": "legacy",
    "name": "Legacy",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 1990,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Subaru Legacy is a midsize sedan with standard all-wheel drive, distinguishing it from virtually every competitor in its class. The Legacy offers a comfortable, refined driving experience with the confidence of all-weather traction. An available turbocharged engine adds performance to the capable platform."
  },
  {
    "slug": "ascent",
    "name": "Ascent",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 2019,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Subaru Ascent is a three-row midsize SUV designed specifically for the North American market, offering seating for up to eight passengers. Standard all-wheel drive and a turbocharged boxer engine provide confident performance in all conditions. The Ascent was Subaru's first three-row vehicle."
  },
  {
    "slug": "brz",
    "name": "BRZ",
    "makeSlug": "subaru",
    "makeName": "Subaru",
    "yearStart": 2013,
    "yearEnd": null,
    "bodyType": "Coupe",
    "description": "The Subaru BRZ is a lightweight rear-wheel-drive sports coupe developed jointly with Toyota. Known for its exceptional handling balance and accessible performance, the BRZ is a pure driver's car in an era of heavy, tech-laden vehicles. The second generation added more power while maintaining the lightweight formula."
  },
  {
    "slug": "tlx",
    "name": "TLX",
    "makeSlug": "acura",
    "makeName": "Acura",
    "yearStart": 2015,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Acura TLX is a sport luxury sedan that combines precision handling with advanced technology and a premium interior. The Type S variant delivers genuine performance with a turbocharged V6 and torque-vectoring all-wheel drive. The TLX competes with the BMW 3 Series and Mercedes-Benz C-Class."
  },
  {
    "slug": "mdx",
    "name": "MDX",
    "makeSlug": "acura",
    "makeName": "Acura",
    "yearStart": 2001,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Acura MDX is a three-row luxury SUV that has been one of the best-selling vehicles in its segment since its introduction. Known for combining Honda reliability with premium appointments and available Super Handling All-Wheel Drive. The MDX Type S adds a turbocharged V6 for enhanced performance."
  },
  {
    "slug": "rdx",
    "name": "RDX",
    "makeSlug": "acura",
    "makeName": "Acura",
    "yearStart": 2007,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Acura RDX is a compact luxury crossover SUV that offers a turbocharged engine, a spacious interior, and Acura's precision-crafted design philosophy. The RDX features the True Touchpad Interface and available A-Spec styling for a sportier appearance. It competes with the Lexus NX and BMW X3."
  },
  {
    "slug": "integra",
    "name": "Integra",
    "makeSlug": "acura",
    "makeName": "Acura",
    "yearStart": 2023,
    "yearEnd": null,
    "bodyType": "Hatchback",
    "description": "The Acura Integra was revived in 2023 as a premium sport compact liftback, carrying on the legacy of the beloved original. Sharing its platform with the Honda Civic, the Integra offers a six-speed manual transmission and engaging driving dynamics. The Integra Type S delivers track-ready performance with a turbocharged engine."
  },
  {
    "slug": "charger",
    "name": "Charger",
    "makeSlug": "dodge",
    "makeName": "Dodge",
    "yearStart": 2006,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Dodge Charger is an American muscle sedan that combines aggressive styling with powerful engine options, including the legendary HEMI V8. The Charger SRT Hellcat and Redeye variants delivered supercharged performance exceeding 700 horsepower. Dodge has transitioned the Charger to an electrified platform for the next generation."
  },
  {
    "slug": "challenger",
    "name": "Challenger",
    "makeSlug": "dodge",
    "makeName": "Dodge",
    "yearStart": 2008,
    "yearEnd": 2024,
    "bodyType": "Coupe",
    "description": "The Dodge Challenger is a retro-styled muscle car that carried the torch for American V8 performance. From the V6 SXT to the supercharged Hellcat and the record-breaking Demon 170, the Challenger offered something for every performance enthusiast. Production ended in 2024 as Dodge transitions to electrified performance."
  },
  {
    "slug": "durango",
    "name": "Durango",
    "makeSlug": "dodge",
    "makeName": "Dodge",
    "yearStart": 2004,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Dodge Durango is a three-row performance SUV that stands apart from competitors with available V8 power and muscular styling. The Durango SRT and SRT Hellcat variants made it the fastest and most powerful three-row SUV available. The Durango combines family hauling capability with genuine performance credentials."
  },
  {
    "slug": "hornet",
    "name": "Hornet",
    "makeSlug": "dodge",
    "makeName": "Dodge",
    "yearStart": 2024,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Dodge Hornet is a compact performance crossover that brings the brand's muscle car attitude to the growing small SUV segment. Available with a turbocharged engine or a plug-in hybrid R/T powertrain with over 280 horsepower. The Hornet marks Dodge's entry into the electrified performance crossover market."
  },
  {
    "slug": "sierra",
    "name": "Sierra",
    "makeSlug": "gmc",
    "makeName": "GMC",
    "yearStart": 1999,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The GMC Sierra is a full-size pickup truck that shares its platform with the Chevrolet Silverado but adds premium features and distinctive styling. The Sierra Denali is one of the most luxurious trucks available, while the AT4 trim offers enhanced off-road capability. The Sierra was the first truck to offer a MultiPro tailgate with six unique functions."
  },
  {
    "slug": "yukon",
    "name": "Yukon",
    "makeSlug": "gmc",
    "makeName": "GMC",
    "yearStart": 1992,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The GMC Yukon is a full-size SUV built on the same platform as the Chevrolet Tahoe, offering a premium experience with three rows of seating and powerful V8 engines. The Yukon Denali is the flagship model with exclusive features, while the Yukon XL provides additional cargo and passenger space. The current generation features an independent rear suspension for improved ride quality."
  },
  {
    "slug": "terrain",
    "name": "Terrain",
    "makeSlug": "gmc",
    "makeName": "GMC",
    "yearStart": 2010,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The GMC Terrain is a compact crossover SUV that offers a refined cabin, good fuel economy, and GMC's professional-grade image. The Terrain competes with the Chevrolet Equinox and offers available all-wheel drive with a choice of turbocharged engines. The Denali trim adds premium materials and exclusive styling elements."
  },
  {
    "slug": "acadia",
    "name": "Acadia",
    "makeSlug": "gmc",
    "makeName": "GMC",
    "yearStart": 2007,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The GMC Acadia is a midsize crossover SUV offering available three-row seating in a more manageable footprint than the full-size Yukon. The Acadia Denali and AT4 trims cater to luxury and adventure buyers respectively. The Acadia provides a good balance of passenger space, cargo capacity, and driving dynamics."
  },
  {
    "slug": "canyon",
    "name": "Canyon",
    "makeSlug": "gmc",
    "makeName": "GMC",
    "yearStart": 2004,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The GMC Canyon is a midsize pickup truck that shares its platform with the Chevrolet Colorado but adds a more upscale presentation. The Canyon AT4X is one of the most capable off-road midsize trucks available, with Multimatic DSSV dampers and front and rear locking differentials. The Denali trim brings full-size luxury to the midsize segment."
  },
  {
    "slug": "gv70",
    "name": "GV70",
    "makeSlug": "genesis",
    "makeName": "Genesis",
    "yearStart": 2022,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Genesis GV70 is a compact luxury SUV that quickly established itself as a serious competitor to the BMW X3 and Mercedes-Benz GLC. Offering a choice of turbocharged four-cylinder and twin-turbo V6 engines with available all-wheel drive. The GV70 delivers exceptional value with standard features that are optional on German rivals."
  },
  {
    "slug": "gv80",
    "name": "GV80",
    "makeSlug": "genesis",
    "makeName": "Genesis",
    "yearStart": 2021,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Genesis GV80 is a midsize luxury SUV that announced Genesis as a legitimate luxury brand when it debuted. Available with three rows of seating, the GV80 features a serene cabin with premium materials and advanced technology. The GV80 competes with the BMW X5 and Mercedes-Benz GLE at a more accessible price point."
  },
  {
    "slug": "g70",
    "name": "G70",
    "makeSlug": "genesis",
    "makeName": "Genesis",
    "yearStart": 2019,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Genesis G70 is a compact sport sedan that has won multiple comparison tests against the BMW 3 Series and Mercedes-Benz C-Class. With a turbocharged 2.0T or powerful 3.3T twin-turbo V6, the G70 delivers engaging driving dynamics. Genesis includes complimentary scheduled maintenance and concierge service with every G70."
  },
  {
    "slug": "g80",
    "name": "G80",
    "makeSlug": "genesis",
    "makeName": "Genesis",
    "yearStart": 2017,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Genesis G80 is a midsize luxury sedan that competes with the BMW 5 Series and Mercedes-Benz E-Class. The G80 offers elegant design, a quiet and refined cabin, and an extensive list of standard features. An all-electric Electrified G80 variant brings EV luxury to the lineup."
  },
  {
    "slug": "outlander",
    "name": "Outlander",
    "makeSlug": "mitsubishi",
    "makeName": "Mitsubishi",
    "yearStart": 2003,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Mitsubishi Outlander is a compact crossover SUV that offers available three-row seating and one of the most affordable plug-in hybrid options in the market. The Outlander PHEV provides substantial electric-only range for daily commuting while maintaining SUV versatility. The latest generation features a bold new design and partnership-derived technology from the Nissan-Mitsubishi alliance."
  },
  {
    "slug": "eclipse-cross",
    "name": "Eclipse Cross",
    "makeSlug": "mitsubishi",
    "makeName": "Mitsubishi",
    "yearStart": 2018,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Mitsubishi Eclipse Cross is a compact crossover SUV that slots between the smaller Outlander Sport and the larger Outlander in the lineup. Featuring a distinctive coupe-like roofline and available Super All-Wheel Control, the Eclipse Cross offers a unique design in the crowded compact SUV market. Competitive pricing and a generous warranty make it a solid value proposition."
  },
  {
    "slug": "pacifica",
    "name": "Pacifica",
    "makeSlug": "chrysler",
    "makeName": "Chrysler",
    "yearStart": 2017,
    "yearEnd": null,
    "bodyType": "Minivan",
    "description": "The Chrysler Pacifica is widely regarded as the best minivan on the market, offering a refined interior, innovative Stow 'n Go seating, and available plug-in hybrid powertrain. The Pacifica Hybrid was the first electrified minivan, providing significant fuel savings for family transportation. Available all-wheel drive and the Uconnect 5 infotainment system keep the Pacifica competitive."
  },
  {
    "slug": "300",
    "name": "300",
    "makeSlug": "chrysler",
    "makeName": "Chrysler",
    "yearStart": 2005,
    "yearEnd": 2024,
    "bodyType": "Sedan",
    "description": "The Chrysler 300 was a full-size sedan that combined bold American styling with available V8 power and a rear-wheel-drive platform. The 300S offered a sportier driving experience, while the top-tier 300C featured the legendary 6.4-liter HEMI V8. Chrysler discontinued the 300 after the 2024 model year as the brand transitions toward electrification."
  },
  {
    "slug": "enclave",
    "name": "Enclave",
    "makeSlug": "buick",
    "makeName": "Buick",
    "yearStart": 2008,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Buick Enclave is a three-row luxury crossover SUV that offers a quiet, comfortable cabin with premium features at a more accessible price than many luxury competitors. The Enclave's spacious interior seats up to seven or eight passengers, making it a popular family vehicle. Buick's QuietTuning technology ensures a serene driving experience."
  },
  {
    "slug": "encore-gx",
    "name": "Encore GX",
    "makeSlug": "buick",
    "makeName": "Buick",
    "yearStart": 2020,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Buick Encore GX is a subcompact luxury crossover SUV that bridges the gap between the smaller Encore and the larger Envision. Offering available all-wheel drive and a choice of turbocharged three-cylinder engines, the Encore GX provides premium features in a compact package. The Sport Touring trim adds sporty visual elements and enhanced technology."
  },
  {
    "slug": "envision",
    "name": "Envision",
    "makeSlug": "buick",
    "makeName": "Buick",
    "yearStart": 2016,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Buick Envision is a compact luxury crossover SUV that offers a comfortable ride, a quiet cabin, and Buick's signature premium experience. Standard features include a turbocharged engine, an 8-inch touchscreen, and active safety technology. The Envision Avenir trim adds exclusive materials and design elements for a true luxury experience."
  },
  {
    "slug": "q50",
    "name": "Q50",
    "makeSlug": "infiniti",
    "makeName": "Infiniti",
    "yearStart": 2014,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Infiniti Q50 is a compact luxury sport sedan powered by a twin-turbocharged V6 engine, offering a balance of performance and everyday comfort. Available with rear-wheel or all-wheel drive, the Q50 Red Sport 400 delivers 400 horsepower for genuine sport sedan thrills."
  },
  {
    "slug": "qx60",
    "name": "QX60",
    "makeSlug": "infiniti",
    "makeName": "Infiniti",
    "yearStart": 2014,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Infiniti QX60 is a three-row luxury crossover SUV that combines a refined cabin with family-friendly versatility. Completely redesigned with bold new styling and a luxurious interior, the QX60 competes with the Acura MDX and Lexus RX L."
  },
  {
    "slug": "qx80",
    "name": "QX80",
    "makeSlug": "infiniti",
    "makeName": "Infiniti",
    "yearStart": 2011,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Infiniti QX80 is a full-size luxury SUV with seating for up to eight passengers and a powerful V8 engine. Known for its spacious cabin and commanding road presence, the QX80 competes with the Cadillac Escalade and Lincoln Navigator."
  },
  {
    "slug": "qx50",
    "name": "QX50",
    "makeSlug": "infiniti",
    "makeName": "Infiniti",
    "yearStart": 2019,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Infiniti QX50 is a compact luxury crossover featuring the world's first production variable-compression turbo engine. The QX50 offers a spacious interior with premium materials and competes with the BMW X3 and Audi Q5."
  },
  {
    "slug": "cooper",
    "name": "Cooper",
    "makeSlug": "mini",
    "makeName": "Mini",
    "yearStart": 2002,
    "yearEnd": null,
    "bodyType": "Hatchback",
    "description": "The Mini Cooper is an iconic compact car known for its go-kart-like handling, retro-modern design, and fun-to-drive character. Available in hardtop, convertible, and high-performance John Cooper Works variants, the Mini Cooper delivers driving excitement in a city-friendly package."
  },
  {
    "slug": "countryman",
    "name": "Countryman",
    "makeSlug": "mini",
    "makeName": "Mini",
    "yearStart": 2011,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Mini Countryman is the brand's largest model, offering more passenger and cargo space while maintaining Mini's signature driving dynamics. Available with all-wheel drive and a plug-in hybrid powertrain, the Countryman brings versatility to the Mini lineup."
  },
  {
    "slug": "f-pace",
    "name": "F-Pace",
    "makeSlug": "jaguar",
    "makeName": "Jaguar",
    "yearStart": 2017,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Jaguar F-Pace is a luxury performance SUV that combines Jaguar's sporting heritage with everyday practicality. Offering a range of powertrains including a supercharged V8 in the SVR variant, the F-Pace delivers engaging driving dynamics unusual for its class."
  },
  {
    "slug": "f-type",
    "name": "F-Type",
    "makeSlug": "jaguar",
    "makeName": "Jaguar",
    "yearStart": 2014,
    "yearEnd": 2024,
    "bodyType": "Coupe/Convertible",
    "description": "The Jaguar F-Type is a luxury sports car that carries on the legacy of the legendary E-Type. Available as a coupe or convertible with supercharged engines ranging from four cylinders to a thunderous V8, the F-Type is one of the most beautiful sports cars of its generation."
  },
  {
    "slug": "e-pace",
    "name": "E-Pace",
    "makeSlug": "jaguar",
    "makeName": "Jaguar",
    "yearStart": 2018,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Jaguar E-Pace is a compact luxury crossover SUV that brings Jaguar's design language and sporting character to the growing small luxury SUV segment. Standard all-wheel drive and a turbocharged engine provide confident performance in all conditions."
  },
  {
    "slug": "giulia",
    "name": "Giulia",
    "makeSlug": "alfa-romeo",
    "makeName": "Alfa Romeo",
    "yearStart": 2017,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Alfa Romeo Giulia is an Italian sport sedan that prioritizes driving engagement above all else. The Quadrifoglio variant delivers 505 horsepower from a Ferrari-derived twin-turbo V6, making it one of the fastest sport sedans available. Stunning design and a driver-focused cockpit set the Giulia apart from German rivals."
  },
  {
    "slug": "stelvio",
    "name": "Stelvio",
    "makeSlug": "alfa-romeo",
    "makeName": "Alfa Romeo",
    "yearStart": 2018,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Alfa Romeo Stelvio is a compact luxury SUV that brings Italian passion and driving dynamics to the SUV segment. Named after the famous Stelvio Pass in the Italian Alps, the Stelvio Quadrifoglio variant is one of the fastest SUVs around the Nurburgring."
  },
  {
    "slug": "tonale",
    "name": "Tonale",
    "makeSlug": "alfa-romeo",
    "makeName": "Alfa Romeo",
    "yearStart": 2024,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Alfa Romeo Tonale is a subcompact luxury crossover that expands the brand's SUV lineup with a more accessible entry point. Available with a plug-in hybrid powertrain, the Tonale features distinctive Italian styling and connects owners to the vehicle through an NFT-based digital certificate."
  },
  {
    "slug": "ghibli",
    "name": "Ghibli",
    "makeSlug": "maserati",
    "makeName": "Maserati",
    "yearStart": 2014,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Maserati Ghibli is an Italian luxury sport sedan named after a hot Saharan wind. Powered by Ferrari-built twin-turbo V6 engines, the Ghibli offers distinctive Italian design and an intoxicating exhaust note that set it apart from German competitors."
  },
  {
    "slug": "levante",
    "name": "Levante",
    "makeSlug": "maserati",
    "makeName": "Maserati",
    "yearStart": 2017,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Maserati Levante is an Italian luxury SUV that brings Maserati's grand touring character to the SUV segment. Available with twin-turbo V6 and V8 engines, the Levante combines genuine off-road capability with the soul of a sports car."
  },
  {
    "slug": "grecale",
    "name": "Grecale",
    "makeSlug": "maserati",
    "makeName": "Maserati",
    "yearStart": 2023,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Maserati Grecale is a compact luxury SUV that competes with the Porsche Macan. Named after the Mediterranean wind, the Grecale offers multiple powertrain options including the electrified Folgore variant, representing Maserati's push toward electrification."
  },
  {
    "slug": "500x",
    "name": "500X",
    "makeSlug": "fiat",
    "makeName": "Fiat",
    "yearStart": 2016,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Fiat 500X is a subcompact crossover SUV that combines Italian style with everyday practicality. Sharing its platform with the Jeep Renegade, the 500X offers available all-wheel drive and a turbocharged engine in a distinctive package."
  },
  {
    "slug": "500e",
    "name": "500e",
    "makeSlug": "fiat",
    "makeName": "Fiat",
    "yearStart": 2024,
    "yearEnd": null,
    "bodyType": "Hatchback",
    "description": "The Fiat 500e is an all-electric city car that brings the iconic Cinquecento into the electric age. With retro-modern styling and zero emissions, the 500e is designed for urban driving with a range suitable for daily commuting."
  },
  {
    "slug": "polestar-2",
    "name": "Polestar 2",
    "makeSlug": "polestar",
    "makeName": "Polestar",
    "yearStart": 2021,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Polestar 2 is a premium all-electric fastback sedan that competes directly with the Tesla Model 3. Built on Volvo's CMA platform, the Polestar 2 offers Scandinavian minimalist design, Google built-in infotainment, and available dual-motor all-wheel drive."
  },
  {
    "slug": "polestar-3",
    "name": "Polestar 3",
    "makeSlug": "polestar",
    "makeName": "Polestar",
    "yearStart": 2025,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Polestar 3 is a luxury electric performance SUV designed to compete with the BMW iX and Mercedes EQE SUV. Built on Volvo's SPA2 platform with advanced aerodynamics, the Polestar 3 features a dual-motor powertrain and advanced lidar-based safety systems."
  },
  {
    "slug": "r1t",
    "name": "R1T",
    "makeSlug": "rivian",
    "makeName": "Rivian",
    "yearStart": 2022,
    "yearEnd": null,
    "bodyType": "Truck",
    "description": "The Rivian R1T was the first electric pickup truck to reach production, offering a quad-motor drivetrain with up to 835 horsepower. With an integrated gear tunnel, powered tonneau cover, and adventure-oriented design, the R1T is purpose-built for outdoor lifestyles."
  },
  {
    "slug": "r1s",
    "name": "R1S",
    "makeSlug": "rivian",
    "makeName": "Rivian",
    "yearStart": 2022,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Rivian R1S is a three-row electric SUV that shares its platform with the R1T pickup. Offering impressive off-road capability with up to 835 horsepower and over 300 miles of range, the R1S competes with the Land Rover Defender and Tesla Model X."
  },
  {
    "slug": "air",
    "name": "Air",
    "makeSlug": "lucid",
    "makeName": "Lucid",
    "yearStart": 2022,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Lucid Air is an ultra-luxury electric sedan that holds the record for the longest-range EV with an EPA-estimated 516 miles. Designed by the former chief engineer of the Tesla Model S, the Air offers a spacious interior with a glass canopy roof and up to 1,234 horsepower in the Sapphire variant."
  },
  {
    "slug": "gravity",
    "name": "Gravity",
    "makeSlug": "lucid",
    "makeName": "Lucid",
    "yearStart": 2025,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Lucid Gravity is a luxury electric SUV that brings Lucid's advanced EV technology to the three-row SUV segment. With seating for up to seven passengers and Lucid's efficient drivetrain technology, the Gravity targets the luxury SUV market dominated by the BMW X7 and Mercedes GLS."
  },
  {
    "slug": "emira",
    "name": "Emira",
    "makeSlug": "lotus",
    "makeName": "Lotus",
    "yearStart": 2023,
    "yearEnd": null,
    "bodyType": "Coupe",
    "description": "The Lotus Emira is the brand's final internal combustion sports car, offering a choice of AMG-sourced four-cylinder turbo or Toyota-derived supercharged V6 engines. Following Colin Chapman's philosophy of lightweight engineering, the Emira delivers exceptional handling in a stunning mid-engine package."
  },
  {
    "slug": "eletre",
    "name": "Eletre",
    "makeSlug": "lotus",
    "makeName": "Lotus",
    "yearStart": 2024,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Lotus Eletre is an all-electric hyper-SUV that marks Lotus's entry into the luxury electric SUV market. With up to 905 horsepower and a 0-60 time under 3 seconds, the Eletre combines Lotus's lightweight engineering expertise with cutting-edge EV technology."
  },
  {
    "slug": "continental-gt",
    "name": "Continental GT",
    "makeSlug": "bentley",
    "makeName": "Bentley",
    "yearStart": 2004,
    "yearEnd": null,
    "bodyType": "Coupe/Convertible",
    "description": "The Bentley Continental GT is the definitive modern grand tourer, combining effortless power with handcrafted luxury. Powered by a twin-turbocharged W12 or V8 engine, the Continental GT can cross continents in supreme comfort while delivering genuine supercar performance."
  },
  {
    "slug": "bentayga",
    "name": "Bentayga",
    "makeSlug": "bentley",
    "makeName": "Bentley",
    "yearStart": 2017,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Bentley Bentayga was the first ultra-luxury SUV, setting a new benchmark for opulence in the SUV segment. Handcrafted at Bentley's Crewe factory with the finest leathers, woods, and metals, the Bentayga offers V8 power with plug-in hybrid efficiency available."
  },
  {
    "slug": "cullinan",
    "name": "Cullinan",
    "makeSlug": "rolls-royce",
    "makeName": "Rolls-Royce",
    "yearStart": 2019,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Rolls-Royce Cullinan is the most luxurious SUV in the world, named after the largest diamond ever discovered. Powered by a twin-turbo V12 and featuring the signature coach doors, the Cullinan brings Rolls-Royce's magic carpet ride to all terrains."
  },
  {
    "slug": "ghost",
    "name": "Ghost",
    "makeSlug": "rolls-royce",
    "makeName": "Rolls-Royce",
    "yearStart": 2010,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Rolls-Royce Ghost is designed for owner-drivers who want the Rolls-Royce experience in a more dynamic package. The second-generation Ghost features a minimalist design philosophy with over 100kg of sound-deadening material for an eerily silent cabin."
  },
  {
    "slug": "spectre",
    "name": "Spectre",
    "makeSlug": "rolls-royce",
    "makeName": "Rolls-Royce",
    "yearStart": 2024,
    "yearEnd": null,
    "bodyType": "Coupe",
    "description": "The Rolls-Royce Spectre is the brand's first fully electric vehicle, a luxury coupe that delivers the silent power befitting the world's most prestigious automaker. With 577 horsepower from dual electric motors and a range of over 260 miles, the Spectre represents the future of ultra-luxury motoring."
  },
  {
    "slug": "urus",
    "name": "Urus",
    "makeSlug": "lamborghini",
    "makeName": "Lamborghini",
    "yearStart": 2019,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Lamborghini Urus is a super SUV that combines Lamborghini's dramatic design and performance with everyday usability. Powered by a twin-turbo V8 producing 641 horsepower, the Urus is the fastest production SUV and has become Lamborghini's best-selling model."
  },
  {
    "slug": "huracan",
    "name": "Huracan",
    "makeSlug": "lamborghini",
    "makeName": "Lamborghini",
    "yearStart": 2015,
    "yearEnd": 2024,
    "bodyType": "Coupe/Convertible",
    "description": "The Lamborghini Huracan is a mid-engine supercar powered by a naturally aspirated 5.2-liter V10 engine. Available in Coupe and Spyder body styles with rear-wheel or all-wheel drive, the Huracan delivers visceral performance with one of the greatest-sounding engines in automotive history."
  },
  {
    "slug": "revuelto",
    "name": "Revuelto",
    "makeSlug": "lamborghini",
    "makeName": "Lamborghini",
    "yearStart": 2024,
    "yearEnd": null,
    "bodyType": "Coupe",
    "description": "The Lamborghini Revuelto is the successor to the Aventador, combining a naturally aspirated V12 with three electric motors for a combined 1,001 horsepower. The first Lamborghini plug-in hybrid, the Revuelto represents the brand's electrified future while preserving the emotional V12 experience."
  },
  {
    "slug": "roma",
    "name": "Roma",
    "makeSlug": "ferrari",
    "makeName": "Ferrari",
    "yearStart": 2021,
    "yearEnd": null,
    "bodyType": "Coupe",
    "description": "The Ferrari Roma is a front-engine grand tourer that embodies the dolce vita spirit of 1960s Rome. With 612 horsepower from a twin-turbo V8, elegant proportions, and a refined cabin, the Roma is Ferrari's most accessible and versatile model."
  },
  {
    "slug": "296-gtb",
    "name": "296 GTB",
    "makeSlug": "ferrari",
    "makeName": "Ferrari",
    "yearStart": 2022,
    "yearEnd": null,
    "bodyType": "Coupe",
    "description": "The Ferrari 296 GTB is a mid-engine plug-in hybrid supercar that pairs a twin-turbo V6 with an electric motor for 819 combined horsepower. The 296 GTB represents Ferrari's new era of electrified performance while introducing a completely new engine architecture."
  },
  {
    "slug": "purosangue",
    "name": "Purosangue",
    "makeSlug": "ferrari",
    "makeName": "Ferrari",
    "yearStart": 2024,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Ferrari Purosangue is the brand's first four-door, four-seat vehicle, powered by a naturally aspirated 6.5-liter V12 producing 715 horsepower. Ferrari insists the Purosangue is not an SUV but a new segment of vehicle, combining Ferrari performance with four-door practicality for the first time."
  },
  {
    "slug": "750s",
    "name": "750S",
    "makeSlug": "mclaren",
    "makeName": "McLaren",
    "yearStart": 2024,
    "yearEnd": null,
    "bodyType": "Coupe/Convertible",
    "description": "The McLaren 750S is a supercar that replaces the 720S, offering 740 horsepower from a twin-turbo V8 in a carbon-fiber structure weighing just over 3,000 pounds. The 750S delivers race-car levels of performance while remaining usable as a grand tourer."
  },
  {
    "slug": "artura",
    "name": "Artura",
    "makeSlug": "mclaren",
    "makeName": "McLaren",
    "yearStart": 2023,
    "yearEnd": null,
    "bodyType": "Coupe",
    "description": "The McLaren Artura is the brand's first series-production hybrid supercar, combining a twin-turbo V6 with an electric motor for 671 combined horsepower. Built on an all-new carbon-fiber architecture, the Artura represents McLaren's transition toward electrified performance."
  },
  {
    "slug": "dbx",
    "name": "DBX",
    "makeSlug": "aston-martin",
    "makeName": "Aston Martin",
    "yearStart": 2021,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Aston Martin DBX is the brand's first SUV, combining British luxury and craftsmanship with genuine performance capability. The DBX707 variant produces 697 horsepower, making it one of the most powerful luxury SUVs in the world."
  },
  {
    "slug": "db12",
    "name": "DB12",
    "makeSlug": "aston-martin",
    "makeName": "Aston Martin",
    "yearStart": 2024,
    "yearEnd": null,
    "bodyType": "Coupe/Convertible",
    "description": "The Aston Martin DB12 is billed as the world's first super tourer, replacing the iconic DB11 with 671 horsepower from a twin-turbo V8. The DB12 combines Aston Martin's timeless design with cutting-edge technology and devastating performance."
  },
  {
    "slug": "vantage",
    "name": "Vantage",
    "makeSlug": "aston-martin",
    "makeName": "Aston Martin",
    "yearStart": 2019,
    "yearEnd": null,
    "bodyType": "Coupe/Convertible",
    "description": "The Aston Martin Vantage is the brand's pure sports car, designed to compete with the Porsche 911 and Mercedes-AMG GT. Powered by a twin-turbo V8, the Vantage delivers sharp handling and dramatic styling in a more compact package than the DB12."
  },
  {
    "slug": "chiron",
    "name": "Chiron",
    "makeSlug": "bugatti",
    "makeName": "Bugatti",
    "yearStart": 2017,
    "yearEnd": 2024,
    "bodyType": "Coupe",
    "description": "The Bugatti Chiron is one of the most extreme production cars ever made, powered by an 8.0-liter quad-turbocharged W16 engine producing 1,500 horsepower. Limited to 500 units worldwide, the Chiron can exceed 300 mph and represents the absolute pinnacle of automotive engineering."
  },
  {
    "slug": "tourbillon",
    "name": "Tourbillon",
    "makeSlug": "bugatti",
    "makeName": "Bugatti",
    "yearStart": 2026,
    "yearEnd": null,
    "bodyType": "Coupe",
    "description": "The Bugatti Tourbillon is the successor to the Chiron, combining a naturally aspirated V16 engine with three electric motors for approximately 1,800 horsepower. Named after the precision watchmaking mechanism, the Tourbillon represents Bugatti's vision for the future of hyper-luxury performance."
  },
  {
    "slug": "s-class-maybach",
    "name": "S-Class Maybach",
    "makeSlug": "maybach",
    "makeName": "Maybach",
    "yearStart": 2016,
    "yearEnd": null,
    "bodyType": "Sedan",
    "description": "The Mercedes-Maybach S-Class is the pinnacle of luxury sedan motoring, featuring an extended wheelbase, reclining rear seats, and the finest materials available. Powered by a twin-turbo V8 or V12 engine, the Maybach S-Class competes with Rolls-Royce and Bentley."
  },
  {
    "slug": "gls-maybach",
    "name": "GLS Maybach",
    "makeSlug": "maybach",
    "makeName": "Maybach",
    "yearStart": 2021,
    "yearEnd": null,
    "bodyType": "SUV",
    "description": "The Mercedes-Maybach GLS is an ultra-luxury SUV that transforms the GLS platform into a four-seat limousine on stilts. With executive rear seating, a refrigerated champagne compartment, and a twin-turbo V8, the Maybach GLS competes with the Bentley Bentayga and Rolls-Royce Cullinan."
  },
  {
    "slug": "9-3",
    "name": "9-3",
    "makeSlug": "saab",
    "makeName": "Saab",
    "yearStart": 1999,
    "yearEnd": 2012,
    "bodyType": "Sedan",
    "description": "The Saab 9-3 was a compact executive car that embodied Saab's aviation-inspired engineering with turbocharged performance and distinctive Scandinavian design. Known for its unique ignition placement between the front seats and strong safety credentials, the 9-3 developed a loyal following among enthusiasts who valued its blend of quirkiness and capability."
  },
  {
    "slug": "9-5",
    "name": "9-5",
    "makeSlug": "saab",
    "makeName": "Saab",
    "yearStart": 1999,
    "yearEnd": 2012,
    "bodyType": "Sedan",
    "description": "The Saab 9-5 was a midsize luxury sedan that served as the brand's flagship, offering turbocharged power, a spacious cabin, and Saab's commitment to safety innovation. The second-generation 9-5 launched in 2010 with striking design but saw limited production before Saab's bankruptcy in 2011."
  },
  {
    "slug": "9-2x",
    "name": "9-2X",
    "makeSlug": "saab",
    "makeName": "Saab",
    "yearStart": 2005,
    "yearEnd": 2006,
    "bodyType": "Wagon",
    "description": "The Saab 9-2X was a compact wagon based on the Subaru Impreza, offering standard all-wheel drive and a turbocharged engine option in the Aero trim. Affectionately nicknamed the 'Saabaru' by enthusiasts, the 9-2X was a unique blend of Subaru capability and Saab styling that lasted only two model years."
  },
  {
    "slug": "9-7x",
    "name": "9-7X",
    "makeSlug": "saab",
    "makeName": "Saab",
    "yearStart": 2005,
    "yearEnd": 2009,
    "bodyType": "SUV",
    "description": "The Saab 9-7X was a midsize SUV based on the Chevrolet TrailBlazer platform, representing Saab's entry into the American SUV market. It featured Saab-specific styling cues and an available V8 engine, offering a more refined experience than its GM platform-mate despite its truck-based underpinnings."
  },
  {
    "slug": "900",
    "name": "900",
    "makeSlug": "saab",
    "makeName": "Saab",
    "yearStart": 1979,
    "yearEnd": 1998,
    "bodyType": "Sedan/Convertible",
    "description": "The Saab 900 was the quintessential Saab, renowned for its turbocharged engines, distinctive wraparound windshield, and aircraft-inspired dashboard. The 900 Convertible became a cultural icon and is considered one of the most desirable Saabs ever produced, helping establish the brand's identity in North America."
  },
  {
    "slug": "aura",
    "name": "Aura",
    "makeSlug": "saturn",
    "makeName": "Saturn",
    "yearStart": 2007,
    "yearEnd": 2010,
    "bodyType": "Sedan",
    "description": "The Saturn Aura was a midsize sedan that earned the 2007 North American Car of the Year award, signaling Saturn's move toward competitive mainstream vehicles. Built on GM's Epsilon platform shared with the Pontiac G6, the Aura offered a refined ride, available V6 power, and a hybrid variant."
  },
  {
    "slug": "vue",
    "name": "Vue",
    "makeSlug": "saturn",
    "makeName": "Saturn",
    "yearStart": 2002,
    "yearEnd": 2010,
    "bodyType": "SUV",
    "description": "The Saturn Vue was a compact crossover SUV that pioneered Saturn's move into the growing SUV segment. The second-generation Vue offered a Green Line hybrid variant and was one of the first affordable hybrid SUVs available to American consumers."
  },
  {
    "slug": "outlook",
    "name": "Outlook",
    "makeSlug": "saturn",
    "makeName": "Saturn",
    "yearStart": 2007,
    "yearEnd": 2010,
    "bodyType": "SUV",
    "description": "The Saturn Outlook was a full-size three-row crossover SUV that shared its Lambda platform with the GMC Acadia and Buick Enclave. The Outlook offered seating for up to eight passengers with a spacious interior and car-like driving dynamics uncommon in vehicles of its size."
  },
  {
    "slug": "ion",
    "name": "Ion",
    "makeSlug": "saturn",
    "makeName": "Saturn",
    "yearStart": 2003,
    "yearEnd": 2007,
    "bodyType": "Sedan",
    "description": "The Saturn Ion was a compact car that replaced the iconic S-Series, featuring Saturn's signature dent-resistant polymer body panels. The Ion Red Line variant offered a supercharged Ecotec engine and sport-tuned suspension, giving the compact Saturn legitimate performance credentials."
  },
  {
    "slug": "sky",
    "name": "Sky",
    "makeSlug": "saturn",
    "makeName": "Saturn",
    "yearStart": 2007,
    "yearEnd": 2010,
    "bodyType": "Convertible",
    "description": "The Saturn Sky was a two-seat roadster that shared its Kappa platform with the Pontiac Solstice, offering open-air driving excitement at an accessible price. The Sky Red Line featured a turbocharged engine producing 260 horsepower, making it one of the most exciting vehicles Saturn ever produced."
  },
  {
    "slug": "sl",
    "name": "SL",
    "makeSlug": "saturn",
    "makeName": "Saturn",
    "yearStart": 1998,
    "yearEnd": 2002,
    "bodyType": "Sedan",
    "description": "The Saturn SL was the original Saturn sedan that helped define the brand with its dent-resistant polymer body panels and no-haggle pricing philosophy. The SL offered practical, fuel-efficient transportation and cultivated a devoted owner community that celebrated the brand at annual Homecoming events in Spring Hill, Tennessee."
  },
  {
    "slug": "g6",
    "name": "G6",
    "makeSlug": "pontiac",
    "makeName": "Pontiac",
    "yearStart": 2005,
    "yearEnd": 2010,
    "bodyType": "Sedan",
    "description": "The Pontiac G6 was a midsize car that gained massive publicity when Oprah Winfrey gave away 276 of them to her studio audience in 2004. Available as a sedan, coupe, and retractable hardtop convertible, the G6 offered versatility and style as Pontiac's volume seller."
  },
  {
    "slug": "grand-am",
    "name": "Grand Am",
    "makeSlug": "pontiac",
    "makeName": "Pontiac",
    "yearStart": 1999,
    "yearEnd": 2005,
    "bodyType": "Sedan",
    "description": "The Pontiac Grand Am was one of the best-selling compact cars in America during its production run, known for its aggressive styling and sport-tuned suspension. The Grand Am GT with its RAM Air hood and distinctive body cladding was a common sight on American roads throughout the early 2000s."
  },
  {
    "slug": "grand-prix",
    "name": "Grand Prix",
    "makeSlug": "pontiac",
    "makeName": "Pontiac",
    "yearStart": 1998,
    "yearEnd": 2008,
    "bodyType": "Sedan",
    "description": "The Pontiac Grand Prix was a midsize sedan with strong NASCAR heritage, known for its powerful supercharged V6 engine in the GTP trim. The Grand Prix GXP with its V8 engine represented the pinnacle of front-wheel-drive performance sedans from General Motors."
  },
  {
    "slug": "gto",
    "name": "GTO",
    "makeSlug": "pontiac",
    "makeName": "Pontiac",
    "yearStart": 2004,
    "yearEnd": 2006,
    "bodyType": "Coupe",
    "description": "The Pontiac GTO was a rebadged Holden Monaro from Australia, reviving one of the most legendary muscle car nameplates in American history. Powered by a Corvette-derived LS-series V8 with up to 400 horsepower, the GTO offered tremendous performance value but had modest sales due to its understated styling."
  },
  {
    "slug": "firebird",
    "name": "Firebird",
    "makeSlug": "pontiac",
    "makeName": "Pontiac",
    "yearStart": 1998,
    "yearEnd": 2002,
    "bodyType": "Coupe",
    "description": "The Pontiac Firebird and its iconic Trans Am variant were among America's most celebrated sports cars, offering V8 power and aggressive styling. The WS6 performance package with the Ram Air V8 made the fourth-generation Firebird one of the best performance bargains of its era."
  },
  {
    "slug": "solstice",
    "name": "Solstice",
    "makeSlug": "pontiac",
    "makeName": "Pontiac",
    "yearStart": 2006,
    "yearEnd": 2010,
    "bodyType": "Convertible",
    "description": "The Pontiac Solstice was a two-seat roadster that proved Pontiac could still build exciting cars in the brand's final years. The Solstice GXP featured a turbocharged engine producing 260 horsepower, and the rare Solstice Coupe is now highly sought after by collectors."
  },
  {
    "slug": "vibe",
    "name": "Vibe",
    "makeSlug": "pontiac",
    "makeName": "Pontiac",
    "yearStart": 2003,
    "yearEnd": 2010,
    "bodyType": "Hatchback",
    "description": "The Pontiac Vibe was a compact hatchback developed jointly with Toyota, sharing its platform and powertrain with the Toyota Matrix. This collaboration gave the Vibe Toyota's renowned reliability, and the Vibe GT offered a high-revving 180-horsepower engine from the Corolla XRS."
  },
  {
    "slug": "cutlass",
    "name": "Cutlass",
    "makeSlug": "oldsmobile",
    "makeName": "Oldsmobile",
    "yearStart": 1998,
    "yearEnd": 1999,
    "bodyType": "Sedan",
    "description": "The Oldsmobile Cutlass carried one of the most storied nameplates in American automotive history, as the original Cutlass was America's best-selling car throughout much of the 1970s. The final-generation Cutlass was a midsize sedan that served as a bridge between Oldsmobile's glorious past and its uncertain future."
  },
  {
    "slug": "alero",
    "name": "Alero",
    "makeSlug": "oldsmobile",
    "makeName": "Oldsmobile",
    "yearStart": 1999,
    "yearEnd": 2004,
    "bodyType": "Sedan",
    "description": "The Oldsmobile Alero was a compact car that served as the brand's final attempt to attract younger buyers with sportier styling and available V6 power. The very last Oldsmobile ever produced was a 2004 Alero, ending over 100 years of continuous Oldsmobile production."
  },
  {
    "slug": "intrigue",
    "name": "Intrigue",
    "makeSlug": "oldsmobile",
    "makeName": "Oldsmobile",
    "yearStart": 1998,
    "yearEnd": 2002,
    "bodyType": "Sedan",
    "description": "The Oldsmobile Intrigue was a midsize sedan powered by a responsive 3.5-liter V6 engine, earning praise for its balanced handling and refined ride quality. The Intrigue represented Oldsmobile's attempt to redefine itself as a driver-focused brand but could not reverse the marque's declining sales."
  },
  {
    "slug": "bravada",
    "name": "Bravada",
    "makeSlug": "oldsmobile",
    "makeName": "Oldsmobile",
    "yearStart": 2002,
    "yearEnd": 2004,
    "bodyType": "SUV",
    "description": "The Oldsmobile Bravada was a midsize luxury SUV that offered standard all-wheel drive and a refined on-road experience compared to its truck-based competitors. The third-generation Bravada shared its platform with the Chevrolet TrailBlazer but added upscale features and a smoother ride befitting the Oldsmobile brand."
  },
  {
    "slug": "aurora",
    "name": "Aurora",
    "makeSlug": "oldsmobile",
    "makeName": "Oldsmobile",
    "yearStart": 1998,
    "yearEnd": 2003,
    "bodyType": "Sedan",
    "description": "The Oldsmobile Aurora was a full-size luxury sedan that represented Oldsmobile's most ambitious attempt to compete with imports like the Lexus ES and Acura TL. Powered by a smooth Northstar-derived V8 or later a Shortstar V6, the Aurora featured sleek styling that deliberately omitted Oldsmobile badging to attract new buyers."
  },
  {
    "slug": "grand-marquis",
    "name": "Grand Marquis",
    "makeSlug": "mercury",
    "makeName": "Mercury",
    "yearStart": 1998,
    "yearEnd": 2011,
    "bodyType": "Sedan",
    "description": "The Mercury Grand Marquis was a full-size body-on-frame sedan that shared its Panther platform with the Ford Crown Victoria and Lincoln Town Car. Known for its smooth V8 power, spacious bench-seat cabin, and comfortable ride, the Grand Marquis was a favorite among traditional American car buyers and fleet operators."
  },
  {
    "slug": "sable",
    "name": "Sable",
    "makeSlug": "mercury",
    "makeName": "Mercury",
    "yearStart": 2000,
    "yearEnd": 2009,
    "bodyType": "Sedan",
    "description": "The Mercury Sable was a midsize sedan that served as the upscale companion to the Ford Taurus, sharing its platform while offering more premium appointments. The Sable's oval-themed design in its later years was polarizing, but it remained a solid choice for buyers seeking a comfortable, well-equipped family sedan."
  },
  {
    "slug": "mountaineer",
    "name": "Mountaineer",
    "makeSlug": "mercury",
    "makeName": "Mercury",
    "yearStart": 2002,
    "yearEnd": 2010,
    "bodyType": "SUV",
    "description": "The Mercury Mountaineer was a midsize SUV based on the Ford Explorer, offering a more luxurious take on the popular Explorer formula. The Mountaineer featured a standard V8 engine in early years and added premium interior materials and quieter ride quality to distinguish itself from its Ford sibling."
  },
  {
    "slug": "mariner",
    "name": "Mariner",
    "makeSlug": "mercury",
    "makeName": "Mercury",
    "yearStart": 2005,
    "yearEnd": 2011,
    "bodyType": "SUV",
    "description": "The Mercury Mariner was a compact SUV based on the Ford Escape, offering a slightly more upscale appearance and additional standard features. The Mariner Hybrid was one of the first hybrid compact SUVs available, demonstrating Mercury's effort to modernize its lineup before the brand's discontinuation."
  },
  {
    "slug": "milan",
    "name": "Milan",
    "makeSlug": "mercury",
    "makeName": "Mercury",
    "yearStart": 2006,
    "yearEnd": 2011,
    "bodyType": "Sedan",
    "description": "The Mercury Milan was a midsize sedan based on the Ford Fusion that offered a more refined alternative with premium features and styling. The Milan Hybrid matched the Fusion Hybrid's impressive fuel economy while adding Mercury's upscale touches, making it one of the brand's final success stories."
  },
  {
    "slug": "cougar",
    "name": "Cougar",
    "makeSlug": "mercury",
    "makeName": "Mercury",
    "yearStart": 1999,
    "yearEnd": 2002,
    "bodyType": "Coupe",
    "description": "The Mercury Cougar was a sporty front-wheel-drive coupe based on the Ford Contour platform, aimed at attracting younger buyers to the Mercury brand. With its distinctive new-edge design and available V6 engine, the Cougar was a bold departure from Mercury's traditional conservative image."
  },
  {
    "slug": "h2",
    "name": "H2",
    "makeSlug": "hummer",
    "makeName": "Hummer",
    "yearStart": 2003,
    "yearEnd": 2009,
    "bodyType": "SUV",
    "description": "The Hummer H2 became a cultural phenomenon of the early 2000s, offering imposing military-inspired styling and genuine off-road capability in a civilian package. Built on a modified Chevrolet Tahoe platform with a Vortec V8, the H2 symbolized the era of large SUVs before rising fuel prices and environmental concerns curtailed its appeal."
  },
  {
    "slug": "h3",
    "name": "H3",
    "makeSlug": "hummer",
    "makeName": "Hummer",
    "yearStart": 2006,
    "yearEnd": 2010,
    "bodyType": "SUV",
    "description": "The Hummer H3 was a more accessible midsize SUV that brought the Hummer brand to a wider audience with a smaller footprint and better fuel economy than the H2. Based on the Chevrolet Colorado platform, the H3 offered impressive off-road capability with its standard four-wheel drive and available Alpha V8 engine."
  },
  {
    "slug": "h1",
    "name": "H1",
    "makeSlug": "hummer",
    "makeName": "Hummer",
    "yearStart": 1998,
    "yearEnd": 2006,
    "bodyType": "SUV",
    "description": "The Hummer H1 was the civilian version of the military HMMWV (Humvee), offering unmatched off-road capability with its massive width, portal axles, and central tire inflation system. Famously championed by Arnold Schwarzenegger, the H1 was the most extreme production SUV available and remains a collector vehicle today."
  },
  {
    "slug": "neon",
    "name": "Neon",
    "makeSlug": "plymouth",
    "makeName": "Plymouth",
    "yearStart": 1998,
    "yearEnd": 2001,
    "bodyType": "Sedan",
    "description": "The Plymouth Neon was an affordable compact sedan that launched with the memorable 'Hi' marketing campaign and a cheerful, rounded design. Despite its budget-friendly price, the Neon offered a responsive engine and nimble handling, earning a strong following in the SCCA racing community where it became a dominant class competitor."
  },
  {
    "slug": "voyager",
    "name": "Voyager",
    "makeSlug": "plymouth",
    "makeName": "Plymouth",
    "yearStart": 1998,
    "yearEnd": 2000,
    "bodyType": "Minivan",
    "description": "The Plymouth Voyager was one of the original minivans that created the segment in 1984, revolutionizing family transportation in America. As the more affordable alternative to the Dodge Caravan, the Voyager offered practical seating for seven and versatile cargo configurations that made it a family favorite throughout the 1990s."
  },
  {
    "slug": "prowler",
    "name": "Prowler",
    "makeSlug": "plymouth",
    "makeName": "Plymouth",
    "yearStart": 1999,
    "yearEnd": 2002,
    "bodyType": "Convertible",
    "description": "The Plymouth Prowler was a factory-built hot rod with an open-wheel retro design that made it one of the most visually striking production cars of its era. Powered by a 3.5-liter V6 and featuring an aluminum chassis, the Prowler was a bold statement that demonstrated Chrysler's willingness to take design risks."
  },
  {
    "slug": "breeze",
    "name": "Breeze",
    "makeSlug": "plymouth",
    "makeName": "Plymouth",
    "yearStart": 1998,
    "yearEnd": 2000,
    "bodyType": "Sedan",
    "description": "The Plymouth Breeze was a midsize sedan that shared its platform with the Dodge Stratus and Chrysler Cirrus, offering value-oriented transportation with a comfortable ride. As Plymouth's final midsize sedan, the Breeze represented the brand's emphasis on affordable, practical vehicles for everyday American families."
  },
  {
    "slug": "tc",
    "name": "tC",
    "makeSlug": "scion",
    "makeName": "Scion",
    "yearStart": 2005,
    "yearEnd": 2016,
    "bodyType": "Coupe",
    "description": "The Scion tC was a sport coupe that became the brand's best-selling model, offering an affordable entry point to sporty driving with a panoramic moonroof as standard equipment. Built on a Toyota platform with a 2.5-liter four-cylinder engine, the tC attracted young buyers with its extensive customization options and no-haggle pricing."
  },
  {
    "slug": "xb",
    "name": "xB",
    "makeSlug": "scion",
    "makeName": "Scion",
    "yearStart": 2004,
    "yearEnd": 2015,
    "bodyType": "Hatchback",
    "description": "The Scion xB was a boxy compact hatchback that became a cult favorite, with its first generation's distinctive toaster-like shape making it an icon of the customization and tuner scene. The xB offered surprisingly spacious interior room despite its compact exterior, and its blank-canvas design made it one of the most modified cars of the 2000s."
  },
  {
    "slug": "fr-s",
    "name": "FR-S",
    "makeSlug": "scion",
    "makeName": "Scion",
    "yearStart": 2013,
    "yearEnd": 2016,
    "bodyType": "Coupe",
    "description": "The Scion FR-S was a lightweight rear-wheel-drive sports coupe developed jointly with Subaru, emphasizing pure driving engagement over raw power. Powered by a naturally aspirated 2.0-liter boxer engine, the FR-S became a tuner favorite and was later rebranded as the Toyota 86 after Scion's discontinuation."
  },
  {
    "slug": "xd",
    "name": "xD",
    "makeSlug": "scion",
    "makeName": "Scion",
    "yearStart": 2008,
    "yearEnd": 2014,
    "bodyType": "Hatchback",
    "description": "The Scion xD was a subcompact hatchback based on the Toyota Yaris platform, offering a sportier look and additional features compared to its Toyota counterpart. The xD served as an affordable entry point to the Scion lineup with practical interior space and Toyota reliability."
  },
  {
    "slug": "im",
    "name": "iM",
    "makeSlug": "scion",
    "makeName": "Scion",
    "yearStart": 2016,
    "yearEnd": 2016,
    "bodyType": "Hatchback",
    "description": "The Scion iM was a compact hatchback based on the Toyota Auris that served as the brand's final new model before Scion's discontinuation. Offering standard Toyota Safety Sense and a practical five-door hatchback body, the iM was seamlessly transitioned to become the Toyota Corolla iM."
  },
  {
    "slug": "grand-vitara",
    "name": "Grand Vitara",
    "makeSlug": "suzuki",
    "makeName": "Suzuki",
    "yearStart": 1999,
    "yearEnd": 2013,
    "bodyType": "SUV",
    "description": "The Suzuki Grand Vitara was a compact SUV that offered genuine body-on-frame off-road capability in an era when most competitors were moving to car-based platforms. With available four-wheel drive and a locking center differential, the Grand Vitara provided real trail capability at a price well below its competitors."
  },
  {
    "slug": "sx4",
    "name": "SX4",
    "makeSlug": "suzuki",
    "makeName": "Suzuki",
    "yearStart": 2007,
    "yearEnd": 2013,
    "bodyType": "Sedan/Hatchback",
    "description": "The Suzuki SX4 was a versatile compact car available as both a sedan and a sporty hatchback with available all-wheel drive. The SX4 Crossover model anticipated the subcompact crossover trend years before it became mainstream, offering raised ride height and rugged styling."
  },
  {
    "slug": "kizashi",
    "name": "Kizashi",
    "makeSlug": "suzuki",
    "makeName": "Suzuki",
    "yearStart": 2010,
    "yearEnd": 2013,
    "bodyType": "Sedan",
    "description": "The Suzuki Kizashi was a midsize sport sedan that earned critical acclaim for its engaging driving dynamics and refined chassis, often compared favorably to the Volkswagen Passat. Despite strong reviews, the Kizashi suffered from Suzuki's limited dealer network and brand recognition in the US sedan market."
  },
  {
    "slug": "xl-7",
    "name": "XL-7",
    "makeSlug": "suzuki",
    "makeName": "Suzuki",
    "yearStart": 2001,
    "yearEnd": 2009,
    "bodyType": "SUV",
    "description": "The Suzuki XL-7 was the brand's largest vehicle, offering three-row seating and V6 power in a midsize SUV package. The second-generation XL-7 was developed jointly with General Motors and offered a more refined on-road experience, though it arrived as fuel prices were rising sharply."
  },
  {
    "slug": "rodeo",
    "name": "Rodeo",
    "makeSlug": "isuzu",
    "makeName": "Isuzu",
    "yearStart": 1998,
    "yearEnd": 2004,
    "bodyType": "SUV",
    "description": "The Isuzu Rodeo was a midsize SUV known for its rugged body-on-frame construction and genuine off-road capability. Powered by a 3.2-liter V6 engine with available four-wheel drive, the Rodeo competed with the Ford Explorer and Chevrolet Blazer at a competitive price point."
  },
  {
    "slug": "trooper",
    "name": "Trooper",
    "makeSlug": "isuzu",
    "makeName": "Isuzu",
    "yearStart": 1998,
    "yearEnd": 2002,
    "bodyType": "SUV",
    "description": "The Isuzu Trooper was a full-size SUV that earned a reputation for rugged dependability in harsh conditions worldwide. With its Torque-On-Demand four-wheel-drive system and a powerful 3.5-liter V6, the Trooper offered serious off-road capability in a traditional body-on-frame package."
  },
  {
    "slug": "ascender",
    "name": "Ascender",
    "makeSlug": "isuzu",
    "makeName": "Isuzu",
    "yearStart": 2003,
    "yearEnd": 2008,
    "bodyType": "SUV",
    "description": "The Isuzu Ascender was a midsize SUV based on the Chevrolet TrailBlazer platform, serving as Isuzu's final passenger vehicle offering in the United States. With available V8 power and a spacious interior, the Ascender aimed to maintain Isuzu's SUV presence as the brand transitioned to commercial trucks only."
  },
  {
    "slug": "axiom",
    "name": "Axiom",
    "makeSlug": "isuzu",
    "makeName": "Isuzu",
    "yearStart": 2002,
    "yearEnd": 2004,
    "bodyType": "SUV",
    "description": "The Isuzu Axiom was a midsize SUV with futuristic styling that set it apart from the more conservative Rodeo. Featuring a 3.5-liter V6, available all-wheel drive, and a distinctive fastback roofline, the Axiom was praised for its bold design and comfortable on-road manners."
  },
  {
    "slug": "vehicross",
    "name": "VehiCROSS",
    "makeSlug": "isuzu",
    "makeName": "Isuzu",
    "yearStart": 1999,
    "yearEnd": 2001,
    "bodyType": "SUV",
    "description": "The Isuzu VehiCROSS was a limited-production sport utility that brought a near-concept-car design to the road with virtually no changes from the show car. With its aggressive styling, Torque-On-Demand four-wheel drive, and only about 4,153 units produced for the US market, the VehiCROSS has become a collectible cult classic."
  },
  {
    "slug": "fortwo",
    "name": "Fortwo",
    "makeSlug": "smart",
    "makeName": "Smart",
    "yearStart": 2008,
    "yearEnd": 2019,
    "bodyType": "Hatchback",
    "description": "The Smart Fortwo was an ultra-compact city car measuring under nine feet long, designed specifically for tight urban environments and easy parking. Created through a partnership between Swatch and Mercedes-Benz, the Fortwo offered a surprisingly safe and fun driving experience in the smallest package available on the American market."
  },
  {
    "slug": "forfour",
    "name": "Forfour",
    "makeSlug": "smart",
    "makeName": "Smart",
    "yearStart": 2016,
    "yearEnd": 2019,
    "bodyType": "Hatchback",
    "description": "The Smart Forfour was a four-seat variant of the microcar brand's lineup, developed in partnership with Renault to offer more passenger space than the tiny Fortwo. Though more practical than its two-seat sibling, the Forfour saw limited availability in the US market before Smart exited North America in 2019."
  },
  {
    "slug": "ocean",
    "name": "Ocean",
    "makeSlug": "fisker",
    "makeName": "Fisker",
    "yearStart": 2023,
    "yearEnd": 2024,
    "bodyType": "SUV",
    "description": "The Fisker Ocean was a mid-size all-electric SUV that aimed to combine sustainable materials with accessible pricing and striking design by Henrik Fisker. Featuring a solar-panel roof option and a rotating center display, the Ocean showcased innovative ideas but was cut short when Fisker filed for bankruptcy in 2024 due to production and distribution challenges."
  },
  {
    "slug": "xt5",
    "name": "XT5",
    "makeSlug": "cadillac",
    "makeName": "Cadillac",
    "yearStart": 2017,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Cadillac XT5 is a midsize luxury crossover serving as one of Cadillac's most popular models. It delivers a smooth ride, spacious interior, and refined driving experience with available AWD."
  },
  {
    "slug": "ct5",
    "name": "CT5",
    "makeSlug": "cadillac",
    "makeName": "Cadillac",
    "yearStart": 2020,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Cadillac CT5 is a midsize luxury sedan delivering refined comfort with available Blackwing performance. It combines American luxury with sharp handling and advanced Super Cruise hands-free driving technology."
  },
  {
    "slug": "xt4",
    "name": "XT4",
    "makeSlug": "cadillac",
    "makeName": "Cadillac",
    "yearStart": 2019,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Cadillac XT4 is a compact luxury crossover offering bold styling and turbocharged performance. It provides an accessible entry to the Cadillac lineup with modern technology and a comfortable cabin."
  },
  {
    "slug": "xt6",
    "name": "XT6",
    "makeSlug": "cadillac",
    "makeName": "Cadillac",
    "yearStart": 2020,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Cadillac XT6 is a three-row luxury crossover offering premium comfort and versatile seating. It fills the gap between the XT5 and Escalade with an elegant design and composed driving character."
  },
  {
    "slug": "ct4",
    "name": "CT4",
    "makeSlug": "cadillac",
    "makeName": "Cadillac",
    "yearStart": 2020,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Cadillac CT4 is a compact luxury sport sedan offering sharp driving dynamics and bold American styling. It serves as Cadillac's entry-level sedan with available powerful turbocharged engines and the Blackwing performance variant."
  },
  {
    "slug": "lyriq",
    "name": "Lyriq",
    "makeSlug": "cadillac",
    "makeName": "Cadillac",
    "yearStart": 2023,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Cadillac Lyriq is an all-electric luxury SUV showcasing Cadillac's electric future. Built on GM's Ultium platform, it delivers impressive range, stunning design, and a 33-inch LED display."
  },
  {
    "slug": "es",
    "name": "ES",
    "makeSlug": "lexus",
    "makeName": "Lexus",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Lexus ES is a midsize luxury sedan renowned for its exceptional comfort and reliability. As one of Lexus's best-selling models, it offers a serene driving experience with available hybrid powertrain efficiency."
  },
  {
    "slug": "is",
    "name": "IS",
    "makeSlug": "lexus",
    "makeName": "Lexus",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Lexus IS is a compact luxury sport sedan competing with the BMW 3 Series and Mercedes C-Class. Known for its sharp styling, engaging rear-wheel drive dynamics, and Lexus reliability."
  },
  {
    "slug": "nx",
    "name": "NX",
    "makeSlug": "lexus",
    "makeName": "Lexus",
    "yearStart": 2015,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Lexus NX is a compact luxury crossover and one of the brand's best-selling models. It features bold spindle grille styling, hybrid powertrain options, and Lexus's renowned quality and reliability."
  },
  {
    "slug": "gx",
    "name": "GX",
    "makeSlug": "lexus",
    "makeName": "Lexus",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Lexus GX is a luxury body-on-frame SUV delivering genuine off-road capability with premium refinement. Built on a rugged truck platform, it offers three-row seating and Toyota's legendary reliability."
  },
  {
    "slug": "lx",
    "name": "LX",
    "makeSlug": "lexus",
    "makeName": "Lexus",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Lexus LX is the brand's flagship luxury SUV based on the Toyota Land Cruiser. It offers unmatched off-road capability combined with opulent luxury appointments and seating for up to eight."
  },
  {
    "slug": "ux",
    "name": "UX",
    "makeSlug": "lexus",
    "makeName": "Lexus",
    "yearStart": 2019,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Lexus UX is a subcompact luxury crossover designed for urban environments. It offers nimble handling, efficient hybrid powertrain options, and Lexus craftsmanship in a city-friendly package."
  },
  {
    "slug": "mazda3",
    "name": "Mazda3",
    "makeSlug": "mazda",
    "makeName": "Mazda",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan/Hatchback",
    "description": "The Mazda3 is a compact car offering sedan and hatchback body styles with premium build quality. Known for its Skyactiv technology, engaging driving dynamics, and interior refinement that challenges luxury competitors."
  },
  {
    "slug": "cx-50",
    "name": "CX-50",
    "makeSlug": "mazda",
    "makeName": "Mazda",
    "yearStart": 2023,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Mazda CX-50 is a compact crossover with rugged styling designed for outdoor adventures. Built on an all-new platform, it offers Skyactiv powertrain efficiency with increased ground clearance and a wilderness-ready attitude."
  },
  {
    "slug": "cx-30",
    "name": "CX-30",
    "makeSlug": "mazda",
    "makeName": "Mazda",
    "yearStart": 2020,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Mazda CX-30 is a subcompact crossover bridging the gap between the CX-3 and CX-5. It features Mazda's premium Kodo design language, engaging Skyactiv dynamics, and an upscale interior that rivals luxury brands."
  },
  {
    "slug": "cx-90",
    "name": "CX-90",
    "makeSlug": "mazda",
    "makeName": "Mazda",
    "yearStart": 2024,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Mazda CX-90 is a three-row luxury SUV that replaced the CX-9 with even more premium appointments. It features a new rear-wheel-drive platform with inline-six and plug-in hybrid powertrain options."
  },
  {
    "slug": "mx-5-miata",
    "name": "MX-5 Miata",
    "makeSlug": "mazda",
    "makeName": "Mazda",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Convertible",
    "description": "The Mazda MX-5 Miata is the world's best-selling roadster, celebrated for its pure driving joy and lightweight design. It embodies the Jinba Ittai philosophy of horse-and-rider unity with perfectly balanced handling."
  },
  {
    "slug": "cx-9",
    "name": "CX-9",
    "makeSlug": "mazda",
    "makeName": "Mazda",
    "yearStart": 2010,
    "yearEnd": 2024,
    "bodyType": "SUV",
    "description": "The Mazda CX-9 is a three-row midsize SUV delivering premium quality and engaging driving dynamics. Known for its upscale interior, turbocharged power, and refined handling unusual for its class."
  },
  {
    "slug": "xc90",
    "name": "XC90",
    "makeSlug": "volvo",
    "makeName": "Volvo",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Volvo XC90 is a three-row luxury SUV that reset Volvo's design direction when it debuted. Known for its commanding presence, world-class safety features, and elegant Scandinavian interior with premium materials."
  },
  {
    "slug": "xc40",
    "name": "XC40",
    "makeSlug": "volvo",
    "makeName": "Volvo",
    "yearStart": 2019,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Volvo XC40 is a compact luxury crossover and Volvo's entry-level SUV. It features distinctive Scandinavian design, advanced safety technology, and is available in both combustion and fully electric Recharge variants."
  },
  {
    "slug": "s60",
    "name": "S60",
    "makeSlug": "volvo",
    "makeName": "Volvo",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Volvo S60 is a compact luxury sedan offering Scandinavian design and advanced safety technology. Available in mild hybrid and plug-in hybrid variants, it competes with the BMW 3 Series and Mercedes C-Class."
  },
  {
    "slug": "s90",
    "name": "S90",
    "makeSlug": "volvo",
    "makeName": "Volvo",
    "yearStart": 2017,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Volvo S90 is a midsize luxury sedan showcasing Volvo's elegant Scandinavian design philosophy. It offers a serene cabin with natural materials, advanced safety systems, and refined plug-in hybrid powertrains."
  },
  {
    "slug": "v60",
    "name": "V60",
    "makeSlug": "volvo",
    "makeName": "Volvo",
    "yearStart": 2019,
    "yearEnd": 2026,
    "bodyType": "Wagon",
    "description": "The Volvo V60 is a luxury sport wagon combining versatile cargo space with sleek design. One of the few premium wagons available, it offers the practicality of an SUV with the driving dynamics of a sedan."
  },
  {
    "slug": "c40",
    "name": "C40",
    "makeSlug": "volvo",
    "makeName": "Volvo",
    "yearStart": 2022,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Volvo C40 Recharge is an all-electric coupe-styled crossover combining Volvo's safety leadership with zero-emission driving. Its sleek fastback design distinguishes it from the XC40 on which it's based."
  },
  {
    "slug": "phantom",
    "name": "Phantom",
    "makeSlug": "rolls-royce",
    "makeName": "Rolls-Royce",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Rolls-Royce Phantom is the ultimate expression of automotive luxury and the brand's flagship sedan. Hand-built at Goodwood, each Phantom offers unparalleled refinement, bespoke customization, and a magic carpet ride."
  },
  {
    "slug": "wraith",
    "name": "Wraith",
    "makeSlug": "rolls-royce",
    "makeName": "Rolls-Royce",
    "yearStart": 2014,
    "yearEnd": 2024,
    "bodyType": "Coupe",
    "description": "The Rolls-Royce Wraith is a luxury grand tourer coupe combining effortless performance with opulent craftsmanship. Its fastback design, starlight headliner, and V12 power create the most dynamic Rolls-Royce driving experience."
  },
  {
    "slug": "dawn",
    "name": "Dawn",
    "makeSlug": "rolls-royce",
    "makeName": "Rolls-Royce",
    "yearStart": 2016,
    "yearEnd": 2024,
    "bodyType": "Convertible",
    "description": "The Rolls-Royce Dawn is a luxury convertible drophead coupe offering open-air grand touring at its finest. Its whisper-quiet fabric roof and hand-crafted interior create the ultimate four-seat convertible experience."
  },
  {
    "slug": "aventador",
    "name": "Aventador",
    "makeSlug": "lamborghini",
    "makeName": "Lamborghini",
    "yearStart": 2012,
    "yearEnd": 2024,
    "bodyType": "Coupe",
    "description": "The Lamborghini Aventador is a flagship supercar powered by a naturally aspirated V12 engine. Its dramatic scissor doors, aggressive styling, and visceral performance make it one of the most iconic modern supercars."
  },
  {
    "slug": "gallardo",
    "name": "Gallardo",
    "makeSlug": "lamborghini",
    "makeName": "Lamborghini",
    "yearStart": 2004,
    "yearEnd": 2014,
    "bodyType": "Coupe",
    "description": "The Lamborghini Gallardo was the brand's most successful model ever, bringing V10 supercar performance to a broader audience. Its mid-engine layout, all-wheel drive, and stunning design made the exotic car dream more attainable."
  },
  {
    "slug": "sf90",
    "name": "SF90",
    "makeSlug": "ferrari",
    "makeName": "Ferrari",
    "yearStart": 2020,
    "yearEnd": 2026,
    "bodyType": "Coupe",
    "description": "The Ferrari SF90 Stradale is a plug-in hybrid supercar producing a combined 986 horsepower from its V8 and three electric motors. It represents Ferrari's technological pinnacle with all-wheel drive and pure electric driving capability."
  },
  {
    "slug": "f8-tributo",
    "name": "F8 Tributo",
    "makeSlug": "ferrari",
    "makeName": "Ferrari",
    "yearStart": 2020,
    "yearEnd": 2024,
    "bodyType": "Coupe",
    "description": "The Ferrari F8 Tributo is a mid-engine supercar paying tribute to Ferrari's legendary V8 heritage. Its twin-turbo V8 delivers 710 horsepower with razor-sharp handling and aerodynamic innovation."
  },
  {
    "slug": "812",
    "name": "812",
    "makeSlug": "ferrari",
    "makeName": "Ferrari",
    "yearStart": 2018,
    "yearEnd": 2024,
    "bodyType": "Coupe",
    "description": "The Ferrari 812 Superfast is a front-engine grand tourer powered by Ferrari's most powerful naturally aspirated V12. With 789 horsepower and stunning Italian design, it represents the pinnacle of the GT formula."
  },
  {
    "slug": "720s",
    "name": "720S",
    "makeSlug": "mclaren",
    "makeName": "McLaren",
    "yearStart": 2018,
    "yearEnd": 2024,
    "bodyType": "Coupe",
    "description": "The McLaren 720S is a supercar that redefined mid-engine performance with its twin-turbo V8 and carbon fiber MonoCell II chassis. Its dihedral doors and prodigious power-to-weight ratio deliver breathtaking speed."
  },
  {
    "slug": "gt",
    "name": "GT",
    "makeSlug": "mclaren",
    "makeName": "McLaren",
    "yearStart": 2020,
    "yearEnd": 2026,
    "bodyType": "Coupe",
    "description": "The McLaren GT is a grand touring supercar designed for comfortable long-distance driving without sacrificing performance. Its unique luggage space and refined cabin make it the most practical McLaren ever built."
  },
  {
    "slug": "dbs",
    "name": "DBS",
    "makeSlug": "aston-martin",
    "makeName": "Aston Martin",
    "yearStart": 2019,
    "yearEnd": 2026,
    "bodyType": "Coupe",
    "description": "The Aston Martin DBS Superleggera is the brand's flagship super GT delivering 715 horsepower from its twin-turbo V12. Its name pays homage to the legendary lightweight construction technique pioneered by Touring Superleggera."
  },
  {
    "slug": "db11",
    "name": "DB11",
    "makeSlug": "aston-martin",
    "makeName": "Aston Martin",
    "yearStart": 2017,
    "yearEnd": 2024,
    "bodyType": "Coupe/Convertible",
    "description": "The Aston Martin DB11 is a grand touring coupe that reinvented the brand's GT formula with modern technology. Available with twin-turbo V8 and V12 engines, it combines breathtaking design with cutting-edge aerodynamics."
  },
  {
    "slug": "valkyrie",
    "name": "Valkyrie",
    "makeSlug": "aston-martin",
    "makeName": "Aston Martin",
    "yearStart": 2024,
    "yearEnd": 2026,
    "bodyType": "Coupe",
    "description": "The Aston Martin Valkyrie is a hypercar developed with Red Bull Racing, pushing the boundaries of road-car performance. Its Cosworth V12 and hybrid system produce over 1,100 horsepower with Formula 1-inspired aerodynamics."
  },
  {
    "slug": "flying-spur",
    "name": "Flying Spur",
    "makeSlug": "bentley",
    "makeName": "Bentley",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Bentley Flying Spur is an ultra-luxury four-door sedan combining handcrafted British elegance with effortless performance. Its rotating display, diamond-knurled controls, and W12 or V8 power define modern grand touring."
  },
  {
    "slug": "veyron",
    "name": "Veyron",
    "makeSlug": "bugatti",
    "makeName": "Bugatti",
    "yearStart": 2005,
    "yearEnd": 2015,
    "bodyType": "Coupe",
    "description": "The Bugatti Veyron redefined automotive performance with its quad-turbo W16 engine producing 1,001 horsepower. As the first production car to exceed 250 mph, it established Bugatti's modern legacy of engineering extremes."
  },
  {
    "slug": "mistral",
    "name": "Mistral",
    "makeSlug": "bugatti",
    "makeName": "Bugatti",
    "yearStart": 2024,
    "yearEnd": 2026,
    "bodyType": "Convertible",
    "description": "The Bugatti Mistral is a limited-edition open-top hypercar marking the final chapter of the legendary W16 engine era. This roadster delivers 1,577 horsepower while showcasing Bugatti's ultimate engineering artistry."
  },
  {
    "slug": "quattroporte",
    "name": "Quattroporte",
    "makeSlug": "maserati",
    "makeName": "Maserati",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Maserati Quattroporte is a full-size luxury sedan combining Italian passion with executive refinement. As one of the first luxury sport sedans ever created, it continues to offer a unique alternative to German flagships."
  },
  {
    "slug": "mc20",
    "name": "MC20",
    "makeSlug": "maserati",
    "makeName": "Maserati",
    "yearStart": 2022,
    "yearEnd": 2026,
    "bodyType": "Coupe",
    "description": "The Maserati MC20 is a mid-engine supercar marking Maserati's return to high-performance racing-inspired vehicles. Its innovative Nettuno twin-turbo V6 with pre-chamber combustion delivers 621 horsepower."
  },
  {
    "slug": "clubman",
    "name": "Clubman",
    "makeSlug": "mini",
    "makeName": "Mini",
    "yearStart": 2010,
    "yearEnd": 2024,
    "bodyType": "Wagon",
    "description": "The Mini Clubman is a compact wagon offering more space and sophistication than the standard Mini. Its distinctive split rear barn doors and premium interior make it a stylish alternative to conventional small wagons."
  },
  {
    "slug": "cooper-se",
    "name": "Cooper SE",
    "makeSlug": "mini",
    "makeName": "Mini",
    "yearStart": 2020,
    "yearEnd": 2026,
    "bodyType": "Hatchback",
    "description": "The Mini Cooper SE is an all-electric version of the iconic Mini Cooper hatchback. It brings zero-emission driving to the Mini brand with instant electric torque and the go-kart handling Mini is famous for."
  },
  {
    "slug": "xe",
    "name": "XE",
    "makeSlug": "jaguar",
    "makeName": "Jaguar",
    "yearStart": 2017,
    "yearEnd": 2024,
    "bodyType": "Sedan",
    "description": "The Jaguar XE is a sedan from Jaguar offering distinctive styling and performance. Decode any VIN to check for open recalls, full specifications, and vehicle history."
  },
  {
    "slug": "xf",
    "name": "XF",
    "makeSlug": "jaguar",
    "makeName": "Jaguar",
    "yearStart": 2010,
    "yearEnd": 2024,
    "bodyType": "Sedan",
    "description": "The Jaguar XF is a sedan from Jaguar offering distinctive styling and performance. Decode any VIN to check for open recalls, full specifications, and vehicle history."
  },
  {
    "slug": "500",
    "name": "500",
    "makeSlug": "fiat",
    "makeName": "Fiat",
    "yearStart": 2012,
    "yearEnd": 2026,
    "bodyType": "Hatchback",
    "description": "The Fiat 500 is an iconic Italian city car blending retro charm with modern practicality. Its compact dimensions and distinctive styling make it a beloved urban commuter available in electric and combustion variants."
  },
  {
    "slug": "polestar-4",
    "name": "Polestar 4",
    "makeSlug": "polestar",
    "makeName": "Polestar",
    "yearStart": 2025,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Polestar 4 is an electric performance SUV coupe with a unique rear-window-less design replaced by cameras. It represents Polestar's push into the luxury electric crossover segment with distinctive Scandinavian design."
  },
  {
    "slug": "mirage",
    "name": "Mirage",
    "makeSlug": "mitsubishi",
    "makeName": "Mitsubishi",
    "yearStart": 2014,
    "yearEnd": 2026,
    "bodyType": "Hatchback",
    "description": "The Mitsubishi Mirage is a subcompact hatchback offering exceptional fuel economy and one of the lowest starting prices of any new car. Its lightweight design and efficient engine make it a practical urban commuter."
  },
  {
    "slug": "outlander-sport",
    "name": "Outlander Sport",
    "makeSlug": "mitsubishi",
    "makeName": "Mitsubishi",
    "yearStart": 2011,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Mitsubishi Outlander Sport is a compact crossover delivering all-weather capability at a competitive price. It offers standard all-wheel drive options and Mitsubishi's comprehensive warranty coverage."
  },
  {
    "slug": "evora",
    "name": "Evora",
    "makeSlug": "lotus",
    "makeName": "Lotus",
    "yearStart": 2010,
    "yearEnd": 2024,
    "bodyType": "Coupe",
    "description": "The Lotus Evora is a mid-engine sports car offering the rare combination of Lotus handling precision with everyday usability. Its Toyota-sourced V6 and available supercharger deliver impressive performance in a surprisingly refined package."
  },
  {
    "slug": "elise",
    "name": "Elise",
    "makeSlug": "lotus",
    "makeName": "Lotus",
    "yearStart": 2005,
    "yearEnd": 2022,
    "bodyType": "Convertible",
    "description": "The Lotus Elise is a lightweight mid-engine roadster that epitomizes Colin Chapman's philosophy of simplicity and lightness. Its bonded aluminum chassis and minimalist approach create one of the purest driving experiences available."
  },
  {
    "slug": "exige",
    "name": "Exige",
    "makeSlug": "lotus",
    "makeName": "Lotus",
    "yearStart": 2006,
    "yearEnd": 2022,
    "bodyType": "Coupe",
    "description": "The Lotus Exige is a track-focused coupe based on the Elise platform with added aerodynamic bodywork and supercharged power. It delivers uncompromising performance and handling for enthusiasts who prioritize driving purity."
  },
  {
    "slug": "eqs-maybach",
    "name": "EQS Maybach",
    "makeSlug": "maybach",
    "makeName": "Maybach",
    "yearStart": 2024,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Mercedes-Maybach EQS is an ultra-luxury all-electric SUV representing the pinnacle of Mercedes' EV lineup. It combines Maybach's opulent craftsmanship with the EQS platform's advanced electric technology."
  },
  {
    "slug": "granturismo",
    "name": "GranTurismo",
    "makeSlug": "maserati",
    "makeName": "Maserati",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Coupe",
    "description": "The Maserati GranTurismo is a luxury grand touring coupe embodying Italian elegance and performance. Its Ferrari-derived engine note and sculptural design create one of the most emotionally engaging GT cars on the road."
  },
  {
    "slug": "cherokee",
    "name": "Cherokee",
    "makeSlug": "jeep",
    "makeName": "Jeep",
    "yearStart": 2014,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Jeep Cherokee is a midsize SUV blending everyday comfort with genuine off-road capability. Its Trailhawk trim offers serious trail performance while maintaining civilized on-road manners for daily driving."
  },
  {
    "slug": "compass",
    "name": "Compass",
    "makeSlug": "jeep",
    "makeName": "Jeep",
    "yearStart": 2017,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Jeep Compass is a compact SUV offering Jeep's legendary off-road heritage in a city-friendly size. It provides available 4x4 systems and Trailhawk capability at an accessible price point."
  },
  {
    "slug": "renegade",
    "name": "Renegade",
    "makeSlug": "jeep",
    "makeName": "Jeep",
    "yearStart": 2015,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Jeep Renegade is a subcompact SUV bringing trail-rated capability to the smallest Jeep. Its distinctive retro-modern styling and available Trailhawk off-road package make it unique in the subcompact segment."
  },
  {
    "slug": "gladiator",
    "name": "Gladiator",
    "makeSlug": "jeep",
    "makeName": "Jeep",
    "yearStart": 2020,
    "yearEnd": 2026,
    "bodyType": "Truck",
    "description": "The Jeep Gladiator is a midsize pickup truck combining Wrangler DNA with genuine truck utility. It's the only convertible pickup truck on the market, offering open-air freedom with a five-foot bed."
  },
  {
    "slug": "wagoneer",
    "name": "Wagoneer",
    "makeSlug": "jeep",
    "makeName": "Jeep",
    "yearStart": 2022,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Jeep Wagoneer is a full-size luxury SUV reviving a legendary nameplate. It offers premium three-row accommodations, advanced technology, and powerful V8 performance for buyers seeking American luxury."
  },
  {
    "slug": "range-rover-sport",
    "name": "Range Rover Sport",
    "makeSlug": "land-rover",
    "makeName": "Land Rover",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Range Rover Sport is a performance-oriented luxury SUV combining athletic dynamics with Range Rover refinement. It offers powerful engine options including a plug-in hybrid while maintaining impressive off-road capability."
  },
  {
    "slug": "defender",
    "name": "Defender",
    "makeSlug": "land-rover",
    "makeName": "Land Rover",
    "yearStart": 2020,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Land Rover Defender is an iconic off-road SUV reborn with modern capability and technology. It combines legendary go-anywhere ability with premium amenities and distinctive boxy styling."
  },
  {
    "slug": "discovery",
    "name": "Discovery",
    "makeSlug": "land-rover",
    "makeName": "Land Rover",
    "yearStart": 2017,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Land Rover Discovery is a versatile luxury SUV offering genuine seven-seat comfort with off-road prowess. Its ingenious stadium seating and terrain response system make it equally capable on and off the road."
  },
  {
    "slug": "evoque",
    "name": "Range Rover Evoque",
    "makeSlug": "land-rover",
    "makeName": "Land Rover",
    "yearStart": 2012,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Range Rover Evoque is a compact luxury crossover with striking coupe-like styling. It brings Range Rover prestige and capability to a city-friendly package with premium materials throughout."
  },
  {
    "slug": "velar",
    "name": "Range Rover Velar",
    "makeSlug": "land-rover",
    "makeName": "Land Rover",
    "yearStart": 2018,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Range Rover Velar is a midsize luxury SUV known for its minimalist design and cutting-edge technology. Its flush door handles and dual-touchscreen interior create a sleek, modern aesthetic."
  },
  {
    "slug": "aviator",
    "name": "Aviator",
    "makeSlug": "lincoln",
    "makeName": "Lincoln",
    "yearStart": 2020,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Lincoln Aviator is a midsize luxury SUV offering sophisticated styling and serene ride quality. Its available plug-in hybrid Grand Touring powertrain delivers both impressive power and electric capability."
  },
  {
    "slug": "corsair",
    "name": "Corsair",
    "makeSlug": "lincoln",
    "makeName": "Lincoln",
    "yearStart": 2020,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Lincoln Corsair is a compact luxury crossover providing a refined alternative to European rivals. It features Lincoln's signature quiet luxury approach with available hybrid powertrain and massage seats."
  },
  {
    "slug": "nautilus",
    "name": "Nautilus",
    "makeSlug": "lincoln",
    "makeName": "Lincoln",
    "yearStart": 2019,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Lincoln Nautilus is a midsize luxury SUV that replaced the MKX with elevated design and technology. Its spacious cabin features premium materials and Lincoln's signature tranquil driving experience."
  },
  {
    "slug": "model-s",
    "name": "Model S",
    "makeSlug": "tesla",
    "makeName": "Tesla",
    "yearStart": 2012,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Tesla Model S is the luxury electric sedan that launched the EV revolution. As Tesla's flagship sedan, it offers blistering acceleration in Plaid trim, industry-leading range, and continuous over-the-air improvements."
  },
  {
    "slug": "model-x",
    "name": "Model X",
    "makeSlug": "tesla",
    "makeName": "Tesla",
    "yearStart": 2016,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Tesla Model X is a luxury electric SUV featuring distinctive falcon wing doors and seating for up to seven. It combines Tesla's electric performance with SUV versatility and advanced autopilot technology."
  },
  {
    "slug": "cybertruck",
    "name": "Cybertruck",
    "makeSlug": "tesla",
    "makeName": "Tesla",
    "yearStart": 2024,
    "yearEnd": 2026,
    "bodyType": "Truck",
    "description": "The Tesla Cybertruck is a revolutionary all-electric pickup truck with a bold stainless steel exoskeleton. Its angular design and impressive specifications including armor glass windows and vault storage redefine the pickup category."
  },
  {
    "slug": "macan",
    "name": "Macan",
    "makeSlug": "porsche",
    "makeName": "Porsche",
    "yearStart": 2015,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Porsche Macan is a compact luxury SUV delivering genuine sports car performance in an SUV package. As Porsche's best-selling model, it combines everyday practicality with exhilarating driving dynamics."
  },
  {
    "slug": "taycan",
    "name": "Taycan",
    "makeSlug": "porsche",
    "makeName": "Porsche",
    "yearStart": 2020,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Porsche Taycan is an all-electric sport sedan that proved EVs can deliver authentic Porsche driving excitement. Its innovative 800-volt architecture enables rapid charging and repeatable high-performance launches."
  },
  {
    "slug": "panamera",
    "name": "Panamera",
    "makeSlug": "porsche",
    "makeName": "Porsche",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Porsche Panamera is a luxury sport sedan proving that four doors and Porsche performance can coexist brilliantly. It offers powerful engine options including plug-in hybrid variants with genuine supercar acceleration."
  },
  {
    "slug": "718",
    "name": "718",
    "makeSlug": "porsche",
    "makeName": "Porsche",
    "yearStart": 2017,
    "yearEnd": 2026,
    "bodyType": "Coupe/Convertible",
    "description": "The Porsche 718 encompasses the Cayman coupe and Boxster roadster, delivering pure mid-engine sports car thrills. With turbocharged flat-four and flat-six engines, they offer razor-sharp handling and accessible Porsche performance."
  },
  {
    "slug": "q60",
    "name": "Q60",
    "makeSlug": "infiniti",
    "makeName": "Infiniti",
    "yearStart": 2017,
    "yearEnd": 2026,
    "bodyType": "Coupe",
    "description": "The Infiniti Q60 is a luxury sport coupe offering bold styling and twin-turbo V6 power. Its aggressive design and available Red Sport 400 trim deliver a compelling alternative to German sport coupes."
  },
  {
    "slug": "qx55",
    "name": "QX55",
    "makeSlug": "infiniti",
    "makeName": "Infiniti",
    "yearStart": 2022,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Infiniti QX55 is a coupe-styled luxury crossover reviving the spirit of the original FX. Its fastback roofline and variable compression turbo engine combine distinctive style with innovative technology."
  },
  {
    "slug": "encore",
    "name": "Encore",
    "makeSlug": "buick",
    "makeName": "Buick",
    "yearStart": 2013,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Buick Encore is a subcompact luxury crossover offering Buick's signature quiet ride in a city-friendly package. It provides premium amenities and refined driving experience at an accessible luxury price point."
  },
  {
    "slug": "2500",
    "name": "2500",
    "makeSlug": "ram",
    "makeName": "Ram",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Truck",
    "description": "The Ram 2500 is a heavy-duty pickup truck built for serious towing and hauling. Available with a powerful Cummins turbo diesel, it delivers exceptional capability while maintaining Ram's signature refined interior."
  },
  {
    "slug": "3500",
    "name": "3500",
    "makeSlug": "ram",
    "makeName": "Ram",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Truck",
    "description": "The Ram 3500 is the ultimate heavy-duty pickup offering class-leading towing capacity. With the available Cummins diesel producing massive torque, it's the choice for the heaviest commercial and recreational towing demands."
  },
  {
    "slug": "promaster",
    "name": "ProMaster",
    "makeSlug": "ram",
    "makeName": "Ram",
    "yearStart": 2014,
    "yearEnd": 2026,
    "bodyType": "Van",
    "description": "The Ram ProMaster is a full-size cargo van designed for commercial use and upfitting versatility. Its front-wheel-drive layout creates a low load floor while the spacious cargo area accommodates diverse business needs."
  },
  {
    "slug": "g90",
    "name": "G90",
    "makeSlug": "genesis",
    "makeName": "Genesis",
    "yearStart": 2017,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Genesis G90 is the brand's flagship luxury sedan showcasing Korean automotive excellence. It rivals the Mercedes S-Class and BMW 7 Series with opulent appointments, refined ride quality, and exceptional value."
  },
  {
    "slug": "gv60",
    "name": "GV60",
    "makeSlug": "genesis",
    "makeName": "Genesis",
    "yearStart": 2023,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Genesis GV60 is a compact all-electric luxury crossover built on Hyundai's E-GMP platform. It combines Genesis premium design with cutting-edge EV technology including Face Connect and a crystal sphere gear selector."
  },
  {
    "slug": "5-series",
    "name": "5 Series",
    "makeSlug": "bmw",
    "makeName": "BMW",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The BMW 5 Series is a midsize luxury sport sedan that exemplifies the brand's balance of driving dynamics and executive comfort. A perennial benchmark in its class, it offers powerful engines and cutting-edge technology."
  },
  {
    "slug": "x5",
    "name": "X5",
    "makeSlug": "bmw",
    "makeName": "BMW",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The BMW X5 is a midsize luxury SUV that pioneered the sports activity vehicle segment. Known for its athletic handling, powerful engine options, and luxurious interior, it remains one of BMW's best-selling models."
  },
  {
    "slug": "x1",
    "name": "X1",
    "makeSlug": "bmw",
    "makeName": "BMW",
    "yearStart": 2013,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The BMW X1 is a compact luxury crossover combining BMW's sporty driving character with everyday versatility. As the brand's most accessible SUV, it delivers premium features and efficient turbocharged performance."
  },
  {
    "slug": "7-series",
    "name": "7 Series",
    "makeSlug": "bmw",
    "makeName": "BMW",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The BMW 7 Series is the brand's flagship luxury sedan, offering the ultimate in comfort, technology, and performance. It showcases BMW's most advanced features and sets the standard for executive sedans."
  },
  {
    "slug": "4-series",
    "name": "4 Series",
    "makeSlug": "bmw",
    "makeName": "BMW",
    "yearStart": 2014,
    "yearEnd": 2026,
    "bodyType": "Coupe",
    "description": "The BMW 4 Series is a premium coupe and convertible offering athletic performance and elegant styling. It builds on 3 Series underpinnings with a more dramatic design and sport-focused character."
  },
  {
    "slug": "e-class",
    "name": "E-Class",
    "makeSlug": "mercedes-benz",
    "makeName": "Mercedes-Benz",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Mercedes-Benz E-Class is a midsize luxury sedan that has defined executive motoring for decades. Known for exceptional comfort, cutting-edge safety technology, and refined powertrains."
  },
  {
    "slug": "glc",
    "name": "GLC",
    "makeSlug": "mercedes-benz",
    "makeName": "Mercedes-Benz",
    "yearStart": 2016,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Mercedes-Benz GLC is a compact luxury SUV and one of the brand's best-selling models worldwide. It delivers a smooth ride, elegant cabin, and a range of powertrains including plug-in hybrid options."
  },
  {
    "slug": "s-class",
    "name": "S-Class",
    "makeSlug": "mercedes-benz",
    "makeName": "Mercedes-Benz",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Mercedes-Benz S-Class is the pinnacle of automotive luxury and technology, serving as the brand's flagship sedan. It consistently debuts the most advanced features in the industry before they trickle down to other models."
  },
  {
    "slug": "gla",
    "name": "GLA",
    "makeSlug": "mercedes-benz",
    "makeName": "Mercedes-Benz",
    "yearStart": 2015,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Mercedes-Benz GLA is a subcompact luxury crossover blending urban agility with Mercedes-Benz sophistication. It offers turbocharged power, available 4MATIC AWD, and the brand's signature premium interior."
  },
  {
    "slug": "a-class",
    "name": "A-Class",
    "makeSlug": "mercedes-benz",
    "makeName": "Mercedes-Benz",
    "yearStart": 2019,
    "yearEnd": 2025,
    "bodyType": "Sedan",
    "description": "The Mercedes-Benz A-Class is a compact luxury sedan serving as the brand's entry point. It features the MBUX infotainment system, turbocharged performance, and Mercedes-Benz build quality in a city-friendly size."
  },
  {
    "slug": "q7",
    "name": "Q7",
    "makeSlug": "audi",
    "makeName": "Audi",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Audi Q7 is a full-size luxury three-row SUV combining spacious seating with refined performance. Known for its smooth ride, advanced technology, and premium materials throughout the cabin."
  },
  {
    "slug": "a6",
    "name": "A6",
    "makeSlug": "audi",
    "makeName": "Audi",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Audi A6 is a midsize luxury sedan known for its elegant design, cutting-edge technology, and refined ride quality. It competes at the heart of the luxury sedan market with powerful engine options and Audi's acclaimed virtual cockpit."
  },
  {
    "slug": "q3",
    "name": "Q3",
    "makeSlug": "audi",
    "makeName": "Audi",
    "yearStart": 2015,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Audi Q3 is a subcompact luxury crossover offering premium amenities in a city-friendly package. It features turbocharged power, available Quattro AWD, and Audi's signature interior quality."
  },
  {
    "slug": "a3",
    "name": "A3",
    "makeSlug": "audi",
    "makeName": "Audi",
    "yearStart": 2015,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Audi A3 is a premium compact sedan combining sophisticated design with turbocharged performance. As Audi's entry-level luxury offering, it delivers a refined driving experience with the brand's signature Quattro all-wheel drive and advanced technology."
  },
  {
    "slug": "e-tron",
    "name": "e-tron",
    "makeSlug": "audi",
    "makeName": "Audi",
    "yearStart": 2019,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Audi e-tron is an all-electric luxury SUV marking Audi's entry into the EV market. It combines typical Audi luxury and build quality with dual-motor all-wheel drive and impressive electric range."
  },
  {
    "slug": "pathfinder",
    "name": "Pathfinder",
    "makeSlug": "nissan",
    "makeName": "Nissan",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Nissan Pathfinder is a three-row midsize SUV designed for family adventures. It combines capable performance with modern technology and spacious seating for up to eight passengers."
  },
  {
    "slug": "sentra",
    "name": "Sentra",
    "makeSlug": "nissan",
    "makeName": "Nissan",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Nissan Sentra is a compact sedan delivering an upscale experience at an affordable price. Recent generations feature bold styling, advanced safety tech, and a comfortable interior that punches above its class."
  },
  {
    "slug": "frontier",
    "name": "Frontier",
    "makeSlug": "nissan",
    "makeName": "Nissan",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Truck",
    "description": "The Nissan Frontier is a midsize pickup truck offering rugged capability with everyday practicality. Known for its reliable powertrain and competitive value in the midsize truck segment."
  },
  {
    "slug": "murano",
    "name": "Murano",
    "makeSlug": "nissan",
    "makeName": "Nissan",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Nissan Murano is a midsize luxury-leaning crossover with distinctive styling and a refined cabin. Known for its comfortable ride, Zero Gravity seats, and V6 power."
  },
  {
    "slug": "kicks",
    "name": "Kicks",
    "makeSlug": "nissan",
    "makeName": "Nissan",
    "yearStart": 2018,
    "yearEnd": 2026,
    "bodyType": "SUV",
    "description": "The Nissan Kicks is a subcompact crossover delivering excellent fuel economy and modern technology at an accessible price point. Its bold styling and efficient powertrain make it a smart city vehicle."
  },
  {
    "slug": "versa",
    "name": "Versa",
    "makeSlug": "nissan",
    "makeName": "Nissan",
    "yearStart": 2010,
    "yearEnd": 2026,
    "bodyType": "Sedan",
    "description": "The Nissan Versa is a subcompact sedan offering exceptional value with standard safety features and a spacious interior for its class. It provides reliable transportation at one of the lowest entry prices in the market."
  }
]