[
  {"slug":"camry","name":"Camry","makeSlug":"toyota","makeName":"Toyota","yearStart":1983,"yearEnd":null,"bodyType":"Sedan","description":"The Toyota Camry has been America's best-selling sedan for over two decades, offering a balanced combination of comfort, reliability, and fuel efficiency. Known for exceptional resale value and low cost of ownership, the Camry is the benchmark midsize sedan."},
  {"slug":"corolla","name":"Corolla","makeSlug":"toyota","makeName":"Toyota","yearStart":1966,"yearEnd":null,"bodyType":"Sedan/Hatchback","description":"The Toyota Corolla is the best-selling car in history with over 50 million units sold worldwide. Known for bulletproof reliability and low running costs, the Corolla offers practical transportation with modern technology and safety features."},
  {"slug":"rav4","name":"RAV4","makeSlug":"toyota","makeName":"Toyota","yearStart":1996,"yearEnd":null,"bodyType":"SUV","description":"The Toyota RAV4 is one of the best-selling SUVs in the world, pioneering the compact crossover segment in 1996. Available as a gas model, hybrid, plug-in hybrid, and the sporty RAV4 Prime, it offers versatility for every buyer."},
  {"slug":"highlander","name":"Highlander","makeSlug":"toyota","makeName":"Toyota","yearStart":2001,"yearEnd":null,"bodyType":"SUV","description":"The Toyota Highlander is a three-row midsize SUV that combines family-friendly space with Toyota reliability. Available with a fuel-efficient hybrid powertrain, the Highlander offers comfortable seating for up to eight passengers."},
  {"slug":"tacoma","name":"Tacoma","makeSlug":"toyota","makeName":"Toyota","yearStart":1995,"yearEnd":null,"bodyType":"Truck","description":"The Toyota Tacoma is the best-selling midsize pickup truck in America, prized for its off-road capability and legendary resale value. The TRD Pro trim is one of the most capable factory off-road trucks available."},
  {"slug":"civic","name":"Civic","makeSlug":"honda","makeName":"Honda","yearStart":1973,"yearEnd":null,"bodyType":"Sedan/Hatchback","description":"The Honda Civic is one of the most popular compact cars in history, known for excellent fuel efficiency, engaging driving dynamics, and long-term reliability. The Civic Type R is one of the most acclaimed performance hatchbacks available."},
  {"slug":"accord","name":"Accord","makeSlug":"honda","makeName":"Honda","yearStart":1976,"yearEnd":null,"bodyType":"Sedan","description":"The Honda Accord is a midsize sedan that consistently earns top marks for quality, value, and driving enjoyment. The Accord has won more Car and Driver 10Best awards than any other vehicle in history."},
  {"slug":"cr-v","name":"CR-V","makeSlug":"honda","makeName":"Honda","yearStart":1997,"yearEnd":null,"bodyType":"SUV","description":"The Honda CR-V is one of the best-selling compact SUVs in America, offering a spacious interior, excellent fuel economy, and Honda's reputation for dependability. The CR-V Hybrid adds electric assistance for even better efficiency."},
  {"slug":"f-150","name":"F-150","makeSlug":"ford","makeName":"Ford","yearStart":1948,"yearEnd":null,"bodyType":"Truck","description":"The Ford F-150 has been America's best-selling vehicle for over 40 consecutive years, offering unmatched versatility from work truck to luxury hauler. The F-150 Lightning brings full-size truck capability to the electric age."},
  {"slug":"explorer","name":"Explorer","makeSlug":"ford","makeName":"Ford","yearStart":1991,"yearEnd":null,"bodyType":"SUV","description":"The Ford Explorer helped create the SUV boom of the 1990s and remains one of the most popular three-row SUVs in America. The Explorer offers seating for seven with a range of powertrains including a performance ST model."},
  {"slug":"mustang","name":"Mustang","makeSlug":"ford","makeName":"Ford","yearStart":1965,"yearEnd":null,"bodyType":"Coupe/Convertible","description":"The Ford Mustang is an American icon and the world's best-selling sports car, offering thrilling performance at accessible prices. From the turbocharged EcoBoost to the supercharged GT500, the Mustang delivers excitement for every budget."},
  {"slug":"silverado","name":"Silverado","makeSlug":"chevrolet","makeName":"Chevrolet","yearStart":1999,"yearEnd":null,"bodyType":"Truck","description":"The Chevrolet Silverado is one of America's best-selling full-size trucks, competing directly with the Ford F-150 and Ram 1500. Available in a wide range of trims from work truck to luxury High Country, the Silverado offers capability for every need."},
  {"slug":"equinox","name":"Equinox","makeSlug":"chevrolet","makeName":"Chevrolet","yearStart":2005,"yearEnd":null,"bodyType":"SUV","description":"The Chevrolet Equinox is a compact crossover SUV that offers a comfortable ride, good fuel economy, and a competitive price point. The all-electric Equinox EV brings affordable electric transportation to the mainstream market."},
  {"slug":"3-series","name":"3 Series","makeSlug":"bmw","makeName":"BMW","yearStart":1975,"yearEnd":null,"bodyType":"Sedan","description":"The BMW 3 Series is the sports sedan benchmark, setting the standard for driving dynamics in the luxury segment for nearly five decades. Available as a sedan and wagon, with rear-wheel and all-wheel drive options."},
  {"slug":"x3","name":"X3","makeSlug":"bmw","makeName":"BMW","yearStart":2004,"yearEnd":null,"bodyType":"SUV","description":"The BMW X3 is one of the best-selling luxury compact SUVs, offering BMW's trademark driving dynamics in a practical package. The X3 M Competition delivers supercar-rivaling performance in an SUV body."},
  {"slug":"c-class","name":"C-Class","makeSlug":"mercedes-benz","makeName":"Mercedes-Benz","yearStart":1993,"yearEnd":null,"bodyType":"Sedan","description":"The Mercedes-Benz C-Class is the entry point to the Mercedes luxury sedan lineup, offering cutting-edge technology, refined comfort, and the prestige of the three-pointed star badge. The AMG C 63 variant delivers explosive performance."},
  {"slug":"gle","name":"GLE","makeSlug":"mercedes-benz","makeName":"Mercedes-Benz","yearStart":1998,"yearEnd":null,"bodyType":"SUV","description":"The Mercedes-Benz GLE is a midsize luxury SUV that combines comfort, technology, and capability in a sophisticated package. Available with mild-hybrid, plug-in hybrid, and high-performance AMG powertrains."},
  {"slug":"a4","name":"A4","makeSlug":"audi","makeName":"Audi","yearStart":1996,"yearEnd":null,"bodyType":"Sedan","description":"The Audi A4 is a compact luxury sedan known for its refined interior, advanced technology, and available quattro all-wheel drive. The A4 competes with the BMW 3 Series and Mercedes C-Class in the fiercely competitive entry luxury segment."},
  {"slug":"q5","name":"Q5","makeSlug":"audi","makeName":"Audi","yearStart":2009,"yearEnd":null,"bodyType":"SUV","description":"The Audi Q5 is one of the best-selling luxury compact SUVs, offering a premium interior, smooth ride, and Audi's legendary quattro all-wheel-drive system. The Q5 is available in standard, Sportback, and high-performance SQ5 variants."},
  {"slug":"altima","name":"Altima","makeSlug":"nissan","makeName":"Nissan","yearStart":1993,"yearEnd":null,"bodyType":"Sedan","description":"The Nissan Altima is a midsize sedan that offers available all-wheel drive, a rarity in the segment, along with good fuel economy and a comfortable cabin. The Altima competes with the Camry, Accord, and Malibu."},
  {"slug":"rogue","name":"Rogue","makeSlug":"nissan","makeName":"Nissan","yearStart":2008,"yearEnd":null,"bodyType":"SUV","description":"The Nissan Rogue is one of the best-selling compact SUVs in America, offering a spacious interior, excellent fuel economy, and a comprehensive suite of safety technology. The Rogue was completely redesigned with bold styling."},
  {"slug":"elantra","name":"Elantra","makeSlug":"hyundai","makeName":"Hyundai","yearStart":1991,"yearEnd":null,"bodyType":"Sedan","description":"The Hyundai Elantra is a compact sedan that punches above its weight with a stylish design, generous features, and excellent warranty coverage. The Elantra N variant offers genuine sports sedan performance at an accessible price."},
  {"slug":"tucson","name":"Tucson","makeSlug":"hyundai","makeName":"Hyundai","yearStart":2005,"yearEnd":null,"bodyType":"SUV","description":"The Hyundai Tucson is a compact crossover SUV with bold styling, a premium interior, and available hybrid and plug-in hybrid powertrains. The Tucson offers one of the best value propositions in its class."},
  {"slug":"sorento","name":"Sorento","makeSlug":"kia","makeName":"Kia","yearStart":2003,"yearEnd":null,"bodyType":"SUV","description":"The Kia Sorento is a midsize SUV offering three rows of seating, available hybrid and plug-in hybrid powertrains, and Kia's industry-leading warranty. The Sorento combines family practicality with attractive design."},
  {"slug":"telluride","name":"Telluride","makeSlug":"kia","makeName":"Kia","yearStart":2020,"yearEnd":null,"bodyType":"SUV","description":"The Kia Telluride quickly became one of the most acclaimed SUVs in America, winning multiple SUV of the Year awards with its spacious three-row interior, premium feel, and competitive pricing."},
  {"slug":"model-3","name":"Model 3","makeSlug":"tesla","makeName":"Tesla","yearStart":2017,"yearEnd":null,"bodyType":"Sedan","description":"The Tesla Model 3 brought electric vehicles to the mainstream market with impressive range, instant acceleration, and access to the Tesla Supercharger network. The Model 3 is one of the best-selling electric vehicles in history."},
  {"slug":"model-y","name":"Model Y","makeSlug":"tesla","makeName":"Tesla","yearStart":2020,"yearEnd":null,"bodyType":"SUV","description":"The Tesla Model Y is a compact electric SUV that has become one of the best-selling vehicles in the world across all powertrains. Offering impressive range, cargo space, and Tesla's technology ecosystem."},
  {"slug":"wrangler","name":"Wrangler","makeSlug":"jeep","makeName":"Jeep","yearStart":1987,"yearEnd":null,"bodyType":"SUV","description":"The Jeep Wrangler is the ultimate off-road SUV, offering removable doors and roof panels, solid axles, and legendary Trail Rated capability. The Wrangler 4xe plug-in hybrid adds electric torque for trail crawling."},
  {"slug":"grand-cherokee","name":"Grand Cherokee","makeSlug":"jeep","makeName":"Jeep","yearStart":1993,"yearEnd":null,"bodyType":"SUV","description":"The Jeep Grand Cherokee is a premium midsize SUV that combines genuine off-road capability with on-road luxury. The Grand Cherokee L adds a third row, while the Grand Cherokee 4xe offers plug-in hybrid efficiency."},
  {"slug":"1500","name":"1500","makeSlug":"ram","makeName":"Ram","yearStart":2010,"yearEnd":null,"bodyType":"Truck","description":"The Ram 1500 is widely praised as having the most refined interior and smoothest ride in the full-size truck segment. The coil-spring rear suspension and available air suspension set it apart from competitors."},
  {"slug":"outback","name":"Outback","makeSlug":"subaru","makeName":"Subaru","yearStart":1995,"yearEnd":null,"bodyType":"Wagon/SUV","description":"The Subaru Outback is a rugged wagon-SUV crossover with standard all-wheel drive and impressive ground clearance. Popular with outdoor enthusiasts, the Outback offers reliable all-weather capability and excellent visibility."},
  {"slug":"cx-5","name":"CX-5","makeSlug":"mazda","makeName":"Mazda","yearStart":2013,"yearEnd":null,"bodyType":"SUV","description":"The Mazda CX-5 is a compact crossover that offers a premium driving experience at mainstream prices, with engaging handling and an upscale interior. The CX-5 consistently earns top ratings for driving dynamics in its class."},
  {"slug":"rx","name":"RX","makeSlug":"lexus","makeName":"Lexus","yearStart":1999,"yearEnd":null,"bodyType":"SUV","description":"The Lexus RX is the best-selling luxury SUV in America, pioneering the luxury crossover segment with its combination of comfort, reliability, and refinement. Available as a hybrid and plug-in hybrid for exceptional fuel efficiency."},
  {"slug":"jetta","name":"Jetta","makeSlug":"volkswagen","makeName":"Volkswagen","yearStart":1979,"yearEnd":null,"bodyType":"Sedan","description":"The Volkswagen Jetta is a compact sedan that offers German engineering and build quality at an accessible price point. The Jetta GLI provides genuine sport sedan performance with an affordable price tag."},
  {"slug":"tiguan","name":"Tiguan","makeSlug":"volkswagen","makeName":"Volkswagen","yearStart":2008,"yearEnd":null,"bodyType":"SUV","description":"The Volkswagen Tiguan is a compact SUV that offers European driving dynamics, a spacious interior, and available third-row seating. The Tiguan combines VW's engineering heritage with everyday practicality."},
  {"slug":"cayenne","name":"Cayenne","makeSlug":"porsche","makeName":"Porsche","yearStart":2003,"yearEnd":null,"bodyType":"SUV","description":"The Porsche Cayenne redefined the luxury performance SUV segment, offering genuine Porsche driving dynamics in a practical five-seat package. Available with twin-turbo V6, V8, and plug-in hybrid powertrains."},
  {"slug":"911","name":"911","makeSlug":"porsche","makeName":"Porsche","yearStart":1964,"yearEnd":null,"bodyType":"Coupe/Convertible","description":"The Porsche 911 is one of the most iconic sports cars ever made, evolving over six decades while maintaining its distinctive rear-engine layout. From the base Carrera to the track-focused GT3 RS, the 911 offers performance for every enthusiast."},
  {"slug":"xc60","name":"XC60","makeSlug":"volvo","makeName":"Volvo","yearStart":2009,"yearEnd":null,"bodyType":"SUV","description":"The Volvo XC60 is a compact luxury SUV that prioritizes safety, Scandinavian design, and comfort. Available with mild-hybrid and plug-in hybrid powertrains, the XC60 combines elegance with environmental consciousness."},
  {"slug":"range-rover","name":"Range Rover","makeSlug":"land-rover","makeName":"Land Rover","yearStart":1970,"yearEnd":null,"bodyType":"SUV","description":"The Range Rover is the definitive luxury SUV, combining aristocratic elegance with genuine off-road capability. Each generation has advanced the art of luxury motoring, with the latest offering hybrid powertrains and breathtaking refinement."},
  {"slug":"escalade","name":"Escalade","makeSlug":"cadillac","makeName":"Cadillac","yearStart":1999,"yearEnd":null,"bodyType":"SUV","description":"The Cadillac Escalade is an icon of American luxury, featuring a massive OLED display, Super Cruise hands-free driving, and opulent appointments. The Escalade-V adds supercharged V8 power for performance luxury."},
  {"slug":"navigator","name":"Navigator","makeSlug":"lincoln","makeName":"Lincoln","yearStart":1998,"yearEnd":null,"bodyType":"SUV","description":"The Lincoln Navigator is a full-size luxury SUV that competes with the Cadillac Escalade, offering serene comfort, premium materials, and the spaciousness of a true three-row luxury vehicle."}
]
