[
  {
    "name": "Alabama",
    "slug": "alabama",
    "abbreviation": "AL",
    "capital": "Montgomery",
    "region": "Southeast",
    "description": "Alabama requires liability insurance for all registered vehicles. The state has a lemon law that covers new vehicles purchased or leased in Alabama, and does not require emissions testing statewide.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1,
    "hasLemonLaw": true,
    "lemonLawSummary": "Alabama's Lemon Law covers new motor vehicles that develop substantial defects within the first year or 12,000 miles. Manufacturers must be given a reasonable number of repair attempts before a refund or replacement is required.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$15 - $23 plus county fees",
    "registrationNotes": "Alabama charges a flat registration fee plus additional county-level taxes. Title fees are $18. Plates must be renewed annually by the owner's birthday.",
    "titleFee": "$18",
    "plateFee": "$23"
  },
  {
    "name": "Alaska",
    "slug": "alaska",
    "abbreviation": "AK",
    "capital": "Juneau",
    "region": "Pacific",
    "description": "Alaska has some of the most unique vehicle ownership requirements in the nation. While liability insurance is mandatory, the state does not require emissions testing or safety inspections for most vehicles.",
    "insuranceMinimum": "50/100/25",
    "insuranceMinimumDetail": "$50,000 bodily injury per person / $100,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1262,
    "hasLemonLaw": true,
    "lemonLawSummary": "Alaska's Lemon Law protects buyers of new vehicles that have substantial defects. The manufacturer must be given a reasonable number of attempts to repair the defect before the consumer can seek a refund or replacement.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$100 for most vehicles",
    "registrationNotes": "Alaska charges a biennial registration fee of $100 for most passenger vehicles. There is no state sales tax, but some municipalities charge local taxes on vehicle purchases.",
    "titleFee": "$15",
    "plateFee": "Included in registration"
  },
  {
    "name": "Arizona",
    "slug": "arizona",
    "abbreviation": "AZ",
    "capital": "Phoenix",
    "region": "Southwest",
    "description": "Arizona vehicle owners benefit from relatively low insurance minimums but must comply with emissions testing in the Phoenix and Tucson metro areas. The state offers incentives for electric and alternative fuel vehicles.",
    "insuranceMinimum": "25/50/15",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $15,000 property damage",
    "averageInsuranceCost": 1374,
    "hasLemonLaw": true,
    "lemonLawSummary": "Arizona's Lemon Law requires manufacturers to repair defects within a reasonable number of attempts. If the vehicle remains defective, the buyer can request a replacement or refund through the state's arbitration program.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in the Phoenix and Tucson metro areas for vehicles older than five model years. Vehicles are tested every other year. Testing costs approximately $17.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "Arizona offers a reduced vehicle license tax for electric and alternative-fuel vehicles. EV owners also benefit from HOV lane access and some utility company charging incentives.",
    "registrationFeeRange": "$8 base fee plus vehicle license tax",
    "registrationNotes": "Arizona charges a low base registration fee of $8 but adds a vehicle license tax based on assessed value. New vehicles are assessed at 60% of MSRP, decreasing by 16.25% each year.",
    "titleFee": "$4",
    "plateFee": "$5"
  },
  {
    "name": "Arkansas",
    "slug": "arkansas",
    "abbreviation": "AR",
    "capital": "Little Rock",
    "region": "South",
    "description": "Arkansas requires liability insurance and has a lemon law protecting new vehicle buyers. The state does not mandate emissions testing but does require annual safety inspections in some counties.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1478,
    "hasLemonLaw": true,
    "lemonLawSummary": "Arkansas's New Motor Vehicle Quality Assurance Act covers vehicles with substantial defects reported within 24 months or 24,000 miles. The manufacturer gets a reasonable number of repair attempts before a buyback is required.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$17 - $30 depending on vehicle weight",
    "registrationNotes": "Arkansas registration fees are based on vehicle weight. An annual personal property tax is also assessed on vehicles. Title transfers cost $10.",
    "titleFee": "$10",
    "plateFee": "$1 - $3"
  },
  {
    "name": "California",
    "slug": "california",
    "abbreviation": "CA",
    "capital": "Sacramento",
    "region": "West",
    "description": "California has the most comprehensive vehicle regulations in the country, including strict emissions standards, generous EV incentives, and strong consumer protection laws including a robust lemon law.",
    "insuranceMinimum": "15/30/5",
    "insuranceMinimumDetail": "$15,000 bodily injury per person / $30,000 bodily injury per accident / $5,000 property damage",
    "averageInsuranceCost": 2003,
    "hasLemonLaw": true,
    "lemonLawSummary": "California's Song-Beverly Consumer Warranty Act is one of the strongest lemon laws in the nation. It covers new and used certified vehicles with manufacturer warranties. After two or more repair attempts for serious defects, or 30+ days out of service, buyers may be entitled to a refund or replacement.",
    "hasEmissions": true,
    "emissionsDetails": "California requires biennial smog checks for vehicles older than eight model years in most areas. The state sets its own emissions standards through CARB, which are stricter than federal standards. Testing typically costs $30-$70.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "California offers the Clean Vehicle Rebate Project (CVRP) with rebates up to $7,500 for eligible EVs. Additional perks include HOV lane access, reduced registration fees for zero-emission vehicles, and various utility company incentives for home charging installation.",
    "registrationFeeRange": "$46 base fee plus additional fees",
    "registrationNotes": "California charges a base registration fee of $46, a vehicle license fee (0.65% of vehicle value), plus various surcharges. Total first-year costs for a new vehicle can exceed $400. Renewal is annual.",
    "titleFee": "$23",
    "plateFee": "$23"
  },
  {
    "name": "Colorado",
    "slug": "colorado",
    "abbreviation": "CO",
    "capital": "Denver",
    "region": "Mountain West",
    "description": "Colorado combines mandatory liability insurance with emissions testing in the Denver metro area. The state is a leader in EV incentives, offering substantial tax credits for electric vehicle purchases.",
    "insuranceMinimum": "25/50/15",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $15,000 property damage",
    "averageInsuranceCost": 1835,
    "hasLemonLaw": true,
    "lemonLawSummary": "Colorado's Lemon Law covers new motor vehicles that develop nonconformities within the first year. After four repair attempts or 30 business days out of service, the manufacturer must replace the vehicle or refund the purchase price.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in the Denver-Boulder-Greeley-Fort Collins metro area for vehicles 4-11 model years old. Testing is performed at Air Care Colorado stations and costs approximately $25.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "Colorado offers one of the most generous state EV tax credits in the nation, up to $5,000 for new electric vehicles. Combined with the federal credit, Colorado buyers can save over $12,000. Additional perks include reduced registration fees and utility incentives.",
    "registrationFeeRange": "$50 - $100+ based on weight and year",
    "registrationNotes": "Colorado registration fees are based on vehicle weight and taxable value. A specific ownership tax is assessed that decreases with vehicle age. Registration is annual, due on the owner's birth month.",
    "titleFee": "$7.20",
    "plateFee": "$5.56"
  },
  {
    "name": "Connecticut",
    "slug": "connecticut",
    "abbreviation": "CT",
    "capital": "Hartford",
    "region": "Northeast",
    "description": "Connecticut requires emissions testing for most vehicles and has strong consumer protection laws. The state mandates relatively high insurance minimums compared to the national average.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1702,
    "hasLemonLaw": true,
    "lemonLawSummary": "Connecticut's Lemon Law covers new vehicles that develop defects within 2 years or 24,000 miles. After four repair attempts or 30+ days out of service, buyers can request arbitration for a refund or replacement.",
    "hasEmissions": true,
    "emissionsDetails": "Biennial emissions testing is required for most vehicles registered in Connecticut. Testing follows the OBD-II protocol for vehicles 4+ model years old. Cost is approximately $20.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "Connecticut offers the CHEAPR rebate program with up to $2,250 for new battery electric vehicles and $750 for plug-in hybrids. Additional incentives for low-income residents are available.",
    "registrationFeeRange": "$80 for most passenger vehicles",
    "registrationNotes": "Connecticut charges a biennial registration fee of $80 for most passenger vehicles. A supplemental fee applies to vehicles with a value above $50,000. Title fee is $25.",
    "titleFee": "$25",
    "plateFee": "Included in registration"
  },
  {
    "name": "Delaware",
    "slug": "delaware",
    "abbreviation": "DE",
    "capital": "Dover",
    "region": "Mid-Atlantic",
    "description": "Delaware requires liability insurance and biennial vehicle inspections. The state has no sales tax on vehicle purchases, which can represent significant savings for car buyers.",
    "insuranceMinimum": "25/50/10",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $10,000 property damage",
    "averageInsuranceCost": 1573,
    "hasLemonLaw": true,
    "lemonLawSummary": "Delaware's Lemon Law covers new vehicles with defects reported within the express warranty period. The manufacturer must be given a reasonable opportunity to repair before arbitration can be pursued.",
    "hasEmissions": true,
    "emissionsDetails": "Delaware requires biennial emissions testing for vehicles in New Castle County that are more than 4 model years old. Testing uses OBD-II diagnostics and costs approximately $20.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Delaware requires biennial safety inspections for all registered vehicles. Inspections cover brakes, tires, lights, windshield, exhaust, and other safety systems. Cost is approximately $35-$50 at authorized inspection stations.",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$40 for most vehicles",
    "registrationNotes": "Delaware charges a flat registration fee and a 4.25% document fee on the purchase price in lieu of sales tax. Title fee is $55. No state sales tax applies to vehicle purchases.",
    "titleFee": "$55",
    "plateFee": "$10"
  },
  {
    "name": "Florida",
    "slug": "florida",
    "abbreviation": "FL",
    "capital": "Tallahassee",
    "region": "Southeast",
    "description": "Florida is a no-fault insurance state, meaning your own insurance covers your injuries regardless of who caused the accident. The state does not require emissions testing or safety inspections.",
    "insuranceMinimum": "10/20/10 (PIP required)",
    "insuranceMinimumDetail": "$10,000 personal injury protection (PIP) / $10,000 property damage liability. Bodily injury liability is only required if the driver has had license or registration suspended.",
    "averageInsuranceCost": 2560,
    "hasLemonLaw": true,
    "lemonLawSummary": "Florida's Lemon Law covers new or demonstrator vehicles within 24 months of delivery. After three repair attempts for the same defect or 15+ cumulative days out of service, the buyer can seek arbitration for a full refund or replacement.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$14.50 - $32.50 based on weight",
    "registrationNotes": "Florida registration fees are based on vehicle weight. An initial registration fee applies, plus a $225 new wheels fee for first-time registrations. Title fee is $77.25 including lien recording.",
    "titleFee": "$77.25",
    "plateFee": "$28"
  },
  {
    "name": "Georgia",
    "slug": "georgia",
    "abbreviation": "GA",
    "capital": "Atlanta",
    "region": "Southeast",
    "description": "Georgia requires liability insurance and emissions testing in the metro Atlanta area. The state replaced its traditional sales tax on vehicles with a one-time title ad valorem tax (TAVT).",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1876,
    "hasLemonLaw": true,
    "lemonLawSummary": "Georgia's Lemon Law covers new vehicles that develop defects within the first 24 months or 24,000 miles. After three repair attempts or 30 days out of service, the buyer may be entitled to a replacement or refund.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in the 13-county metro Atlanta area for vehicles 3-25 model years old. Annual OBD-II testing costs $25 at Georgia Clean Air Force stations.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "Georgia has reinstated an alternative fuel vehicle tax credit program. Electric vehicle owners benefit from reduced charging costs through Georgia Power incentive programs and potential HOV lane access.",
    "registrationFeeRange": "$20 for most vehicles",
    "registrationNotes": "Georgia charges a $20 annual registration fee plus a title ad valorem tax (TAVT) of 7% of the vehicle's fair market value at the time of purchase. This replaces the traditional annual ad valorem tax.",
    "titleFee": "$18",
    "plateFee": "$25"
  },
  {
    "name": "Hawaii",
    "slug": "hawaii",
    "abbreviation": "HI",
    "capital": "Honolulu",
    "region": "Pacific",
    "description": "Hawaii requires all registered vehicles to pass a periodic safety inspection. The state has mandatory no-fault insurance and offers growing incentives for electric vehicles as part of its clean energy goals.",
    "insuranceMinimum": "20/40/10 (PIP required)",
    "insuranceMinimumDetail": "$20,000 bodily injury per person / $40,000 bodily injury per accident / $10,000 property damage / $10,000 PIP",
    "averageInsuranceCost": 1218,
    "hasLemonLaw": true,
    "lemonLawSummary": "Hawaii's Lemon Law covers new vehicles with defects reported within the express warranty period or 2 years, whichever comes first. After three repair attempts or 30 days out of service, consumers may seek a refund or replacement.",
    "hasEmissions": true,
    "emissionsDetails": "Oahu requires annual emissions inspections for gasoline-powered vehicles as part of the safety inspection process. Other islands only require safety inspections.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Annual safety inspections are required for all registered vehicles in Hawaii. Inspections cover brakes, lights, tires, steering, and exhaust systems. Cost is typically $20-$30.",
    "evIncentives": true,
    "evIncentiveDetails": "Hawaii offers EV rebates through its state energy office, reduced registration fees for electric vehicles, and access to HOV lanes. The state aims for 100% clean transportation by 2045.",
    "registrationFeeRange": "$45 plus county weight tax",
    "registrationNotes": "Hawaii charges a state registration fee plus a county-specific vehicle weight tax that varies by island. Registration is annual. Title fee is $5.",
    "titleFee": "$5",
    "plateFee": "$5"
  },
  {
    "name": "Idaho",
    "slug": "idaho",
    "abbreviation": "ID",
    "capital": "Boise",
    "region": "Mountain West",
    "description": "Idaho has relatively low insurance requirements and does not mandate emissions testing or safety inspections for most personal vehicles. The state has a straightforward registration process.",
    "insuranceMinimum": "25/50/15",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $15,000 property damage",
    "averageInsuranceCost": 1064,
    "hasLemonLaw": true,
    "lemonLawSummary": "Idaho's Lemon Law covers new motor vehicles with defects that substantially impair use, value, or safety. The manufacturer must be given a reasonable number of repair attempts within the warranty period.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$45 - $69 based on vehicle age",
    "registrationNotes": "Idaho registration fees are based on the age of the vehicle, ranging from $69 for newer vehicles to $45 for those over 8 years old. An additional county fee and plate fee may apply.",
    "titleFee": "$14",
    "plateFee": "$8"
  },
  {
    "name": "Illinois",
    "slug": "illinois",
    "abbreviation": "IL",
    "capital": "Springfield",
    "region": "Midwest",
    "description": "Illinois requires liability insurance and emissions testing in the Chicago metro area and Metro East St. Louis. The state has a strong lemon law and offers incentives for electric vehicle purchases.",
    "insuranceMinimum": "25/50/20",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $20,000 property damage",
    "averageInsuranceCost": 1499,
    "hasLemonLaw": true,
    "lemonLawSummary": "Illinois's New Vehicle Buyer Protection Act covers vehicles in the first 12 months or 12,000 miles. After four repair attempts or 30 business days out of service, consumers can demand a replacement or refund.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in the greater Chicago area and Metro East St. Louis region for most vehicles 4-13 model years old. OBD-II testing is used, and testing costs $20.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "Illinois offers EV rebates of up to $4,000 for new electric vehicles through the Illinois EPA. Additional rebates are available for charging equipment installation. Some utility companies offer discounted charging rates.",
    "registrationFeeRange": "$151 for most passenger vehicles",
    "registrationNotes": "Illinois charges an annual registration fee of $151 for standard passenger vehicles. Electric vehicles pay an additional $100 annual fee. Title fee is $150.",
    "titleFee": "$150",
    "plateFee": "$29"
  },
  {
    "name": "Indiana",
    "slug": "indiana",
    "abbreviation": "IN",
    "capital": "Indianapolis",
    "region": "Midwest",
    "description": "Indiana requires liability insurance for all registered vehicles and has a lemon law covering new car purchases. The state does not require emissions testing or safety inspections.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1288,
    "hasLemonLaw": true,
    "lemonLawSummary": "Indiana's Motor Vehicle Protection Act covers new vehicles within 18 months or 18,000 miles. After four repair attempts or 30 business days out of service, the consumer is entitled to a replacement or refund.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$21.35 plus excise tax",
    "registrationNotes": "Indiana charges a base registration fee of $21.35 plus an annual excise tax based on the vehicle's value and age. The excise tax decreases as the vehicle ages.",
    "titleFee": "$15",
    "plateFee": "$9.40"
  },
  {
    "name": "Iowa",
    "slug": "iowa",
    "abbreviation": "IA",
    "capital": "Des Moines",
    "region": "Midwest",
    "description": "Iowa requires liability insurance and has a lemon law for new vehicles. The state does not require emissions testing but does have some of the most affordable vehicle registration fees in the nation.",
    "insuranceMinimum": "20/40/15",
    "insuranceMinimumDetail": "$20,000 bodily injury per person / $40,000 bodily injury per accident / $15,000 property damage",
    "averageInsuranceCost": 1139,
    "hasLemonLaw": true,
    "lemonLawSummary": "Iowa's Lemon Law protects purchasers of new vehicles that develop nonconformities within 2 years or 24,000 miles. After three repair attempts or 30 days out of service, the buyer may seek a refund or replacement.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "1% of value annually, decreasing with age",
    "registrationNotes": "Iowa charges a fee-for-new-registration that is 5% of the purchase price, plus an annual registration fee based on the vehicle's book value (1% for the first year, decreasing to a minimum). Title fee is $25.",
    "titleFee": "$25",
    "plateFee": "$5"
  },
  {
    "name": "Kansas",
    "slug": "kansas",
    "abbreviation": "KS",
    "capital": "Topeka",
    "region": "Midwest",
    "description": "Kansas requires liability insurance and has a lemon law for new vehicles. Some counties in the Kansas City metro area require emissions testing. The state has a relatively straightforward registration process.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1515,
    "hasLemonLaw": true,
    "lemonLawSummary": "Kansas's Lemon Law covers new vehicles with defects reported within the warranty period or 1 year, whichever is shorter. After four repair attempts or 30 days out of service, arbitration can be requested.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in Johnson and Wyandotte counties (Kansas City metro area) for vehicles 4+ model years old. Biennial OBD-II testing costs approximately $17.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Kansas requires a safety inspection when a vehicle is first registered in the state. Annual inspections are not required for most vehicles after initial registration.",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$39 - $59 based on weight",
    "registrationNotes": "Kansas registration fees are based on vehicle weight. Personal property taxes are also assessed on vehicles. Registration is annual.",
    "titleFee": "$10",
    "plateFee": "$3 - $5"
  },
  {
    "name": "Kentucky",
    "slug": "kentucky",
    "abbreviation": "KY",
    "capital": "Frankfort",
    "region": "Southeast",
    "description": "Kentucky requires liability insurance and has a lemon law for new vehicles. The state does not require emissions testing but mandates personal property taxes on all vehicles.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1740,
    "hasLemonLaw": true,
    "lemonLawSummary": "Kentucky's Lemon Law covers new vehicles with defects within the first 12 months or 12,000 miles. After four repair attempts or 30 days out of service, the consumer can request arbitration.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$21 for most vehicles",
    "registrationNotes": "Kentucky charges a $21 annual registration fee for most passenger vehicles plus county clerk fees. A 6% usage tax applies to vehicle purchases. Personal property tax is assessed annually.",
    "titleFee": "$9",
    "plateFee": "$21"
  },
  {
    "name": "Louisiana",
    "slug": "louisiana",
    "abbreviation": "LA",
    "capital": "Baton Rouge",
    "region": "South",
    "description": "Louisiana requires liability insurance and has a lemon law for new vehicles. The state requires periodic safety inspections but does not mandate emissions testing statewide.",
    "insuranceMinimum": "15/30/25",
    "insuranceMinimumDetail": "$15,000 bodily injury per person / $30,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 2724,
    "hasLemonLaw": true,
    "lemonLawSummary": "Louisiana's Lemon Law covers new vehicles with defects within the warranty period. After four repair attempts or 30 days out of service, the consumer can seek a refund or replacement through arbitration.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Louisiana requires an annual or biennial safety inspection for all registered vehicles. Inspections cover brakes, steering, lights, horn, mirrors, and tires. Cost is typically $10-$20.",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$20 - $82 depending on purchase price",
    "registrationNotes": "Louisiana registration fees are based on the vehicle purchase price. Vehicles priced under $10,000 pay $20, while more expensive vehicles pay up to $82. License plate fees vary by parish.",
    "titleFee": "$68.50",
    "plateFee": "$8 - $15"
  },
  {
    "name": "Maine",
    "slug": "maine",
    "abbreviation": "ME",
    "capital": "Augusta",
    "region": "New England",
    "description": "Maine requires liability insurance and annual vehicle inspections. The state has a strong lemon law and participates in the Regional Greenhouse Gas Initiative, promoting cleaner transportation.",
    "insuranceMinimum": "50/100/25",
    "insuranceMinimumDetail": "$50,000 bodily injury per person / $100,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1002,
    "hasLemonLaw": true,
    "lemonLawSummary": "Maine's Lemon Law covers new vehicles within 3 years or 18,000 miles. After three repair attempts or 15 business days out of service, the consumer can invoke arbitration for a refund or replacement.",
    "hasEmissions": true,
    "emissionsDetails": "Maine follows California's CARB emissions standards and requires OBD-II emissions testing in Cumberland County for vehicles older than the current plus one model year. Testing is annual.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Maine requires annual safety inspections for all registered vehicles. Inspections cover brakes, tires, lights, steering, exhaust, glass, and other safety components. Cost is typically $12.50.",
    "evIncentives": true,
    "evIncentiveDetails": "Maine offers the Efficiency Maine EV rebate program with incentives up to $2,000 for new battery electric vehicles. Low-income residents may qualify for enhanced rebates.",
    "registrationFeeRange": "$35 for most passenger vehicles",
    "registrationNotes": "Maine charges an annual registration fee based on vehicle weight, typically $35 for most passenger vehicles. Excise tax is also assessed based on the vehicle's MSRP and age.",
    "titleFee": "$33",
    "plateFee": "$5"
  },
  {
    "name": "Maryland",
    "slug": "maryland",
    "abbreviation": "MD",
    "capital": "Annapolis",
    "region": "Mid-Atlantic",
    "description": "Maryland requires liability insurance, safety inspections for vehicle transfers, and has a strong lemon law. The state mandates emissions testing and offers growing EV incentive programs.",
    "insuranceMinimum": "30/60/15",
    "insuranceMinimumDetail": "$30,000 bodily injury per person / $60,000 bodily injury per accident / $15,000 property damage",
    "averageInsuranceCost": 1639,
    "hasLemonLaw": true,
    "lemonLawSummary": "Maryland's Lemon Law covers new vehicles within 15 months or 15,000 miles. After four repair attempts or 30 days out of service, the manufacturer must accept the vehicle for arbitration. The law also covers used vehicles through the Used Vehicle Warranty Enforcement Act.",
    "hasEmissions": true,
    "emissionsDetails": "Maryland requires biennial emissions testing in most counties for vehicles 4+ model years old using OBD-II testing. The Vehicle Emissions Inspection Program (VEIP) test is free at state-operated stations.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Maryland requires a safety inspection when a vehicle is sold or changes ownership. The inspection covers major safety systems. Cost varies by inspection station, typically $60-$100.",
    "evIncentives": true,
    "evIncentiveDetails": "Maryland offers an excise tax credit of up to $3,000 for qualifying electric vehicles. The state also provides rebates for EV charging equipment installation and offers reduced tolls for EV owners.",
    "registrationFeeRange": "$135 - $187 for most vehicles",
    "registrationNotes": "Maryland charges a biennial registration fee based on vehicle weight. The state also charges a 6% excise tax on vehicle purchases. Title fee is $100.",
    "titleFee": "$100",
    "plateFee": "$10"
  },
  {
    "name": "Massachusetts",
    "slug": "massachusetts",
    "abbreviation": "MA",
    "capital": "Boston",
    "region": "New England",
    "description": "Massachusetts requires annual vehicle inspections that include both safety and emissions components. The state has strong consumer protections and significant EV incentive programs.",
    "insuranceMinimum": "20/40/5",
    "insuranceMinimumDetail": "$20,000 bodily injury per person / $40,000 bodily injury per accident / $5,000 property damage",
    "averageInsuranceCost": 1388,
    "hasLemonLaw": true,
    "lemonLawSummary": "Massachusetts's Lemon Law covers new vehicles within the first year or 15,000 miles. After three repair attempts or 15 business days out of service, the consumer can invoke the law. The state also has strong used car warranty protections.",
    "hasEmissions": true,
    "emissionsDetails": "Massachusetts requires annual emissions testing as part of the combined safety and emissions inspection for vehicles older than the current plus one model year. OBD-II testing is used.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Annual combined safety and emissions inspections are required for all registered vehicles. Inspections cover brakes, tires, lights, windshield, exhaust, and OBD-II emissions. Cost is $35.",
    "evIncentives": true,
    "evIncentiveDetails": "Massachusetts offers MOR-EV rebates of up to $3,500 for new battery electric vehicles. Additional incentives include reduced registration fees, HOV lane access, and utility-sponsored charging programs.",
    "registrationFeeRange": "$60 for most passenger vehicles",
    "registrationNotes": "Massachusetts charges a $60 biennial registration fee for most passenger vehicles. A 6.25% sales tax applies to vehicle purchases. Title fee is $75.",
    "titleFee": "$75",
    "plateFee": "Included in registration"
  },
  {
    "name": "Michigan",
    "slug": "michigan",
    "abbreviation": "MI",
    "capital": "Lansing",
    "region": "Midwest",
    "description": "Michigan is a no-fault insurance state with unique auto insurance requirements. As the heart of the American auto industry, the state has comprehensive vehicle laws and strong consumer protections.",
    "insuranceMinimum": "50/100/10 (PIP required)",
    "insuranceMinimumDetail": "$50,000 bodily injury per person / $100,000 bodily injury per accident / $10,000 property damage / PIP coverage required",
    "averageInsuranceCost": 2541,
    "hasLemonLaw": true,
    "lemonLawSummary": "Michigan's Lemon Law covers new vehicles within the warranty period. After four repair attempts for the same defect or 30 days out of service, the consumer can request arbitration. Michigan also uniquely allows claims for used vehicles under certain conditions.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "Michigan offers incentives through its Charge Up Michigan program and various utility company rebates for home charging station installation. The state is also investing heavily in EV infrastructure.",
    "registrationFeeRange": "$100 - $200+ based on MSRP",
    "registrationNotes": "Michigan registration fees are based on the vehicle's list price (MSRP). Fees range from $100 for vehicles with an MSRP below $6,000 to over $200 for more expensive vehicles. No annual property tax on vehicles.",
    "titleFee": "$15",
    "plateFee": "Included in registration"
  },
  {
    "name": "Minnesota",
    "slug": "minnesota",
    "abbreviation": "MN",
    "capital": "St. Paul",
    "region": "Midwest",
    "description": "Minnesota requires liability insurance and has a no-fault insurance component. The state has a lemon law for new vehicles and offers growing incentives for EV adoption.",
    "insuranceMinimum": "30/60/10",
    "insuranceMinimumDetail": "$30,000 bodily injury per person / $60,000 bodily injury per accident / $10,000 property damage / $40,000 PIP",
    "averageInsuranceCost": 1426,
    "hasLemonLaw": true,
    "lemonLawSummary": "Minnesota's Lemon Law covers new vehicles within the warranty period or 2 years, whichever comes first. After four repair attempts or 30 business days out of service, the consumer may seek a refund or replacement.",
    "hasEmissions": true,
    "emissionsDetails": "Minnesota requires emissions testing in the seven-county Twin Cities metro area for most vehicles. Testing is performed at state-contracted stations. Newer vehicles and electric vehicles are exempt.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "Minnesota offers rebates of up to $2,500 for battery electric vehicle purchases through its Clean Cars Minnesota initiative. Utility incentives for home charging are also available.",
    "registrationFeeRange": "$35 plus registration tax",
    "registrationNotes": "Minnesota charges a $35 base registration fee plus a registration tax based on the vehicle's value (1.285% of base value, which decreases with age). Title fee is $8.25.",
    "titleFee": "$8.25",
    "plateFee": "$6.75"
  },
  {
    "name": "Mississippi",
    "slug": "mississippi",
    "abbreviation": "MS",
    "capital": "Jackson",
    "region": "South",
    "description": "Mississippi requires liability insurance for all registered vehicles and has a lemon law for new vehicle purchases. The state does not require emissions testing or annual safety inspections.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1593,
    "hasLemonLaw": true,
    "lemonLawSummary": "Mississippi's Lemon Law covers new vehicles within the first year or 12,000 miles. After three repair attempts or 15 business days out of service, the consumer can pursue arbitration for a refund or replacement.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$12.75 - $24.75 based on vehicle class",
    "registrationNotes": "Mississippi has some of the lowest registration fees in the nation. Fees range from $12.75 for vehicles under 6,500 lbs to $24.75 for larger vehicles. A 5% use tax applies to vehicle purchases.",
    "titleFee": "$9",
    "plateFee": "$3.75"
  },
  {
    "name": "Missouri",
    "slug": "missouri",
    "abbreviation": "MO",
    "capital": "Jefferson City",
    "region": "Midwest",
    "description": "Missouri requires liability insurance and safety inspections. The state has emissions testing in the St. Louis and Kansas City metro areas and a lemon law protecting new vehicle buyers.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1569,
    "hasLemonLaw": true,
    "lemonLawSummary": "Missouri's Lemon Law covers new vehicles within the first year or 12,000 miles. After four repair attempts or 30 business days out of service, the consumer can seek a refund or replacement.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in the St. Louis and Kansas City metro areas for gasoline-powered vehicles from 2 to 25 model years old. Biennial OBD-II testing costs approximately $24.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Missouri requires safety inspections every two years or when a vehicle changes ownership. Inspections cover brakes, lights, steering, tires, glass, and horn. Cost is typically $12.",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$18.25 - $51.25 based on horsepower",
    "registrationNotes": "Missouri registration fees are uniquely based on vehicle horsepower. Fees range from $18.25 for vehicles under 12 hp to $51.25 for vehicles over 72 hp. Personal property tax is also assessed annually.",
    "titleFee": "$8.50",
    "plateFee": "$8.50"
  },
  {
    "name": "Montana",
    "slug": "montana",
    "abbreviation": "MT",
    "capital": "Helena",
    "region": "Mountain West",
    "description": "Montana is popular for vehicle registration due to its lack of sales tax. The state requires liability insurance but does not mandate emissions testing or safety inspections for most vehicles.",
    "insuranceMinimum": "25/50/20",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $20,000 property damage",
    "averageInsuranceCost": 1341,
    "hasLemonLaw": true,
    "lemonLawSummary": "Montana's Lemon Law covers new vehicles within 2 years or 18,000 miles. After four repair attempts or 30 business days out of service, the consumer can seek a refund or replacement.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "Based on vehicle age, typically $100-$300 for newer vehicles",
    "registrationNotes": "Montana does not charge a sales tax on vehicle purchases, making it popular for out-of-state registrations. Registration fees are based on the vehicle's age, with newer vehicles paying more. A county option tax may also apply.",
    "titleFee": "$12",
    "plateFee": "$10"
  },
  {
    "name": "Nebraska",
    "slug": "nebraska",
    "abbreviation": "NE",
    "capital": "Lincoln",
    "region": "Midwest",
    "description": "Nebraska requires liability insurance and has a lemon law for new vehicles. The state does not require emissions testing and has a motor vehicle tax based on vehicle value.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1305,
    "hasLemonLaw": true,
    "lemonLawSummary": "Nebraska's Lemon Law covers new vehicles within the manufacturer's express warranty period. After four repair attempts or 40 days out of service, the consumer may be entitled to a refund or replacement.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$15 plus motor vehicle tax",
    "registrationNotes": "Nebraska charges a $15 registration fee plus a motor vehicle tax based on the vehicle's value and age. The tax decreases as the vehicle ages. Title fee is $10.",
    "titleFee": "$10",
    "plateFee": "$3.30"
  },
  {
    "name": "Nevada",
    "slug": "nevada",
    "abbreviation": "NV",
    "capital": "Carson City",
    "region": "West",
    "description": "Nevada requires liability insurance and emissions testing in the Las Vegas and Reno metro areas. The state has a lemon law for new vehicles and offers growing EV incentive programs.",
    "insuranceMinimum": "25/50/20",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $20,000 property damage",
    "averageInsuranceCost": 1860,
    "hasLemonLaw": true,
    "lemonLawSummary": "Nevada's Lemon Law covers new vehicles within the first year or 12,000 miles. After four repair attempts or 30 calendar days out of service, the consumer can demand a replacement or refund.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in Clark County (Las Vegas) and Washoe County (Reno) for vehicles of certain ages. Testing uses OBD-II for newer vehicles and costs approximately $21.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "Nevada offers a partial vehicle registration fee discount for electric vehicles and a property tax exemption for EV charging equipment. NV Energy offers home charging incentives.",
    "registrationFeeRange": "$33 plus governmental services tax",
    "registrationNotes": "Nevada charges a $33 registration fee plus a governmental services tax based on the vehicle's depreciated MSRP. Registration is annual. The state does not have a state income tax.",
    "titleFee": "$28.25",
    "plateFee": "$8"
  },
  {
    "name": "New Hampshire",
    "slug": "new-hampshire",
    "abbreviation": "NH",
    "capital": "Concord",
    "region": "New England",
    "description": "New Hampshire is unique in that it does not require auto insurance by law, though drivers remain financially responsible for damages. The state mandates annual safety inspections.",
    "insuranceMinimum": "25/50/25 (not mandatory)",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage. Note: Insurance is not mandatory in New Hampshire, but these minimums apply if you carry coverage.",
    "averageInsuranceCost": 1014,
    "hasLemonLaw": true,
    "lemonLawSummary": "New Hampshire's Lemon Law covers new vehicles within the warranty period. After three repair attempts or 30 business days out of service, the consumer can request arbitration.",
    "hasEmissions": true,
    "emissionsDetails": "New Hampshire requires annual OBD-II emissions testing as part of the annual safety inspection for vehicles 2 or more model years old. Diesel vehicles are exempt.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Annual safety inspections are required for all registered vehicles. Inspections cover brakes, exhaust, lights, steering, tires, glass, and emissions (OBD-II). Cost is typically $25-$50.",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$31.20 - $43.20 based on weight",
    "registrationNotes": "New Hampshire registration fees are based on vehicle weight. A municipal permit fee based on vehicle value is also assessed by the town or city. No sales tax on vehicle purchases.",
    "titleFee": "$25",
    "plateFee": "$4"
  },
  {
    "name": "New Jersey",
    "slug": "new-jersey",
    "abbreviation": "NJ",
    "capital": "Trenton",
    "region": "Mid-Atlantic",
    "description": "New Jersey requires no-fault insurance with some of the highest minimum coverage requirements in the nation. The state mandates emissions testing and has strong consumer protection laws.",
    "insuranceMinimum": "15/30/5 (PIP required)",
    "insuranceMinimumDetail": "$15,000 bodily injury per person / $30,000 bodily injury per accident / $5,000 property damage / $15,000 PIP",
    "averageInsuranceCost": 1592,
    "hasLemonLaw": true,
    "lemonLawSummary": "New Jersey's Lemon Law covers new vehicles within 2 years or 24,000 miles. After three repair attempts or 20 days out of service, the consumer can seek a refund or replacement. The state also covers leased vehicles.",
    "hasEmissions": true,
    "emissionsDetails": "New Jersey requires biennial emissions inspections for most vehicles 5+ model years old. Testing is performed at state Motor Vehicle Commission inspection stations at no charge.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "New Jersey exempts electric vehicles from sales tax and offers a Charge Up New Jersey rebate of up to $4,000 for new EV purchases. The state is also investing heavily in public charging infrastructure.",
    "registrationFeeRange": "$46.50 - $84 based on weight",
    "registrationNotes": "New Jersey charges annual registration fees based on vehicle weight. A 6.625% sales tax applies to vehicle purchases (EVs are exempt). Title fee is $60.",
    "titleFee": "$60",
    "plateFee": "$6"
  },
  {
    "name": "New Mexico",
    "slug": "new-mexico",
    "abbreviation": "NM",
    "capital": "Santa Fe",
    "region": "Southwest",
    "description": "New Mexico requires liability insurance for all registered vehicles. The state has emissions testing in the Albuquerque area and a lemon law covering new vehicle purchases.",
    "insuranceMinimum": "25/50/10",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $10,000 property damage",
    "averageInsuranceCost": 1275,
    "hasLemonLaw": true,
    "lemonLawSummary": "New Mexico's Lemon Law covers new vehicles within the warranty period or 1 year. After four repair attempts or 30 business days out of service, the consumer can seek a replacement or refund.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in Bernalillo County (Albuquerque) for most vehicles 2+ model years old. Biennial OBD-II testing is performed at authorized stations.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "New Mexico offers a tax credit of up to $2,500 for the purchase of new alternative fuel vehicles. Additional incentives are available through local utilities for home charging installation.",
    "registrationFeeRange": "$27 - $62 based on vehicle age",
    "registrationNotes": "New Mexico registration fees are based on vehicle year. Newer vehicles (0-2 years) pay $62, with fees decreasing to $27 for vehicles 7+ years old. Registration is annual.",
    "titleFee": "$5",
    "plateFee": "$7 - $14"
  },
  {
    "name": "New York",
    "slug": "new-york",
    "abbreviation": "NY",
    "capital": "Albany",
    "region": "Northeast",
    "description": "New York has comprehensive vehicle ownership requirements including no-fault insurance, annual safety and emissions inspections, and one of the strongest lemon laws in the nation.",
    "insuranceMinimum": "25/50/10 (PIP required)",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $10,000 property damage / $50,000 PIP (no-fault) required",
    "averageInsuranceCost": 2321,
    "hasLemonLaw": true,
    "lemonLawSummary": "New York's Lemon Law covers new vehicles within 2 years or 18,000 miles. After four repair attempts or 30 days out of service, the consumer can seek a refund or replacement. New York also has a strong Used Car Lemon Law covering recent-model used vehicles.",
    "hasEmissions": true,
    "emissionsDetails": "Annual emissions testing is required statewide as part of the annual safety inspection for most vehicles 2+ model years old. OBD-II testing is used for 1996+ model year vehicles.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Annual safety inspections are required for all registered vehicles. Inspections cover brakes, steering, tires, lights, glass, exhaust, and emissions. Cost varies by shop but is typically $10-$37.",
    "evIncentives": true,
    "evIncentiveDetails": "New York offers the Drive Clean rebate of up to $2,000 for new EVs. Additional incentives include the EV Make-Ready program for charging infrastructure, Con Edison rebates for NYC-area EV owners, and HOV lane access.",
    "registrationFeeRange": "$26 - $140 based on weight",
    "registrationNotes": "New York registration fees are based on vehicle weight, ranging from $26 to $140 for a biennial period. NYC residents also pay a supplemental registration fee. Sales tax varies by county.",
    "titleFee": "$50",
    "plateFee": "$25"
  },
  {
    "name": "North Carolina",
    "slug": "north-carolina",
    "abbreviation": "NC",
    "capital": "Raleigh",
    "region": "Southeast",
    "description": "North Carolina requires liability insurance and annual safety and emissions inspections. The state has a lemon law for new vehicles and collects a highway use tax on vehicle purchases.",
    "insuranceMinimum": "30/60/25",
    "insuranceMinimumDetail": "$30,000 bodily injury per person / $60,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1220,
    "hasLemonLaw": true,
    "lemonLawSummary": "North Carolina's Lemon Law covers new vehicles within 24 months or 24,000 miles. After four repair attempts or 20 cumulative business days out of service, the consumer can seek a replacement or refund.",
    "hasEmissions": true,
    "emissionsDetails": "Annual emissions and safety inspections are required in 47 of 100 counties for vehicles 3-20 model years old. OBD-II testing is used and costs approximately $30.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Annual safety inspections are required statewide for all registered vehicles. In some counties, the inspection includes both safety and emissions components. Cost is approximately $13.60 for safety only.",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$38.75 for most passenger vehicles",
    "registrationNotes": "North Carolina charges a $38.75 annual registration fee for most vehicles. A 3% highway use tax (capped at $250) applies to vehicle purchases. Title fee is $56.",
    "titleFee": "$56",
    "plateFee": "$38.75"
  },
  {
    "name": "North Dakota",
    "slug": "north-dakota",
    "abbreviation": "ND",
    "capital": "Bismarck",
    "region": "Midwest",
    "description": "North Dakota requires liability insurance and has a lemon law for new vehicles. The state does not require emissions testing or safety inspections and has some of the lowest insurance rates in the nation.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1148,
    "hasLemonLaw": true,
    "lemonLawSummary": "North Dakota's Lemon Law covers new vehicles within the express warranty period or 1 year. After three repair attempts or 30 business days out of service, the consumer can seek a replacement or refund.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$49 - $274 based on weight and year",
    "registrationNotes": "North Dakota registration fees are based on vehicle weight and model year. Fees decrease as the vehicle ages. Annual renewal is required.",
    "titleFee": "$5",
    "plateFee": "$5"
  },
  {
    "name": "Ohio",
    "slug": "ohio",
    "abbreviation": "OH",
    "capital": "Columbus",
    "region": "Midwest",
    "description": "Ohio requires liability insurance but is unique in that it uses a financial responsibility law rather than mandatory insurance. The state requires emissions testing in certain urban counties.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1083,
    "hasLemonLaw": true,
    "lemonLawSummary": "Ohio's Lemon Law covers new vehicles within 1 year or 18,000 miles. After three repair attempts or 30 days out of service, the consumer can request arbitration for a refund or replacement.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing (E-Check) is required in select urban counties including parts of greater Cleveland and greater Akron for vehicles 4-25 model years old. Testing is free at designated stations.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$31 - $55 for most vehicles",
    "registrationNotes": "Ohio charges a base registration fee of $31 plus a highway use tax and county-specific permissive taxes that vary. Electric vehicles pay an additional $200 annual fee. Title fee is $15.",
    "titleFee": "$15",
    "plateFee": "$7.50"
  },
  {
    "name": "Oklahoma",
    "slug": "oklahoma",
    "abbreviation": "OK",
    "capital": "Oklahoma City",
    "region": "South Central",
    "description": "Oklahoma requires liability insurance and has a lemon law for new vehicles. The state does not require emissions testing but mandates personal property taxes on vehicles, known as excise tax.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1577,
    "hasLemonLaw": true,
    "lemonLawSummary": "Oklahoma's Lemon Law covers new vehicles within the first year or 12,000 miles. After four repair attempts or 45 days out of service, the consumer can seek a replacement or refund through arbitration.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$16 - $96 based on age and value",
    "registrationNotes": "Oklahoma charges a registration fee based on the vehicle's age and original factory price. An excise tax of 1.25% of the purchase price or NADA book value applies for first-time registrations.",
    "titleFee": "$11",
    "plateFee": "$5"
  },
  {
    "name": "Oregon",
    "slug": "oregon",
    "abbreviation": "OR",
    "capital": "Salem",
    "region": "Pacific Northwest",
    "description": "Oregon has no sales tax on vehicle purchases and requires emissions testing in the Portland metro area. The state has a strong lemon law and offers significant incentives for electric vehicles.",
    "insuranceMinimum": "25/50/20",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $20,000 property damage",
    "averageInsuranceCost": 1302,
    "hasLemonLaw": true,
    "lemonLawSummary": "Oregon's Lemon Law covers new vehicles within the warranty period or 1 year. After four repair attempts or 30 business days out of service, the consumer can seek a replacement or refund.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in the Portland metro area and Rogue Valley for vehicles 1975 and newer. DEQ testing is performed every two years and costs $21-$25.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "Oregon offers the Clean Vehicle Rebate of up to $5,000 for new EVs and $2,500 for used EVs. Low-income buyers may qualify for an additional $2,500 rebate. The state also has no sales tax on any vehicle purchase.",
    "registrationFeeRange": "$122 - $306 for most vehicles",
    "registrationNotes": "Oregon charges registration fees based on vehicle fuel type and MPG rating. Standard vehicles pay $122 for 2 years. Electric vehicles pay $306 for 2 years. No sales tax applies.",
    "titleFee": "$98.50",
    "plateFee": "$26.50"
  },
  {
    "name": "Pennsylvania",
    "slug": "pennsylvania",
    "abbreviation": "PA",
    "capital": "Harrisburg",
    "region": "Mid-Atlantic",
    "description": "Pennsylvania requires liability insurance and annual safety and emissions inspections. The state has a lemon law for new vehicles and is part of a multi-state emissions standards agreement.",
    "insuranceMinimum": "15/30/5",
    "insuranceMinimumDetail": "$15,000 bodily injury per person / $30,000 bodily injury per accident / $5,000 property damage",
    "averageInsuranceCost": 1419,
    "hasLemonLaw": true,
    "lemonLawSummary": "Pennsylvania's Lemon Law covers new vehicles within the first year, warranty period, or 12,000 miles, whichever comes first. After three repair attempts or 30 days out of service, the consumer can invoke the law.",
    "hasEmissions": true,
    "emissionsDetails": "Annual emissions testing is required in 25 counties, including the Pittsburgh and Philadelphia metro areas. Testing follows OBD-II protocols for 1996+ model year vehicles. Cost is typically $34-$38.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Annual safety inspections are required for all registered vehicles. Inspections cover brakes, steering, suspension, tires, lights, glass, body, and chassis. Cost is typically $35-$50.",
    "evIncentives": true,
    "evIncentiveDetails": "Pennsylvania offers rebates through the Alternative Fuel Vehicle program and DCED grants for EV charging station installation. Some utility companies offer additional incentives for home charging.",
    "registrationFeeRange": "$38 for most passenger vehicles",
    "registrationNotes": "Pennsylvania charges a flat $38 annual registration fee for most passenger vehicles. A 6% sales tax applies to vehicle purchases. Title fee is $55.",
    "titleFee": "$55",
    "plateFee": "$10"
  },
  {
    "name": "Rhode Island",
    "slug": "rhode-island",
    "abbreviation": "RI",
    "capital": "Providence",
    "region": "New England",
    "description": "Rhode Island requires liability insurance and biennial safety and emissions inspections. The state has a lemon law for new vehicles and eliminated the car excise tax in recent years.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1537,
    "hasLemonLaw": true,
    "lemonLawSummary": "Rhode Island's Lemon Law covers new vehicles within 1 year or 15,000 miles. After four repair attempts or 30 days out of service, the consumer can seek a refund or replacement.",
    "hasEmissions": true,
    "emissionsDetails": "Rhode Island requires biennial emissions inspections for all vehicles 2 or more model years old. OBD-II testing is used for 1996+ model year vehicles. Testing is performed at private stations.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Biennial safety inspections are required for all registered vehicles. Inspections cover brakes, tires, lights, steering, exhaust, glass, and wipers. Cost varies by station.",
    "evIncentives": true,
    "evIncentiveDetails": "Rhode Island offers the DRIVE EV rebate program with incentives up to $2,500 for new battery electric vehicles. The state also provides incentives for charging station installation.",
    "registrationFeeRange": "$30 biennial for most vehicles",
    "registrationNotes": "Rhode Island charges a biennial registration fee of $30 for most vehicles. A 7% sales tax applies to vehicle purchases. Title fee is $52.50.",
    "titleFee": "$52.50",
    "plateFee": "$6"
  },
  {
    "name": "South Carolina",
    "slug": "south-carolina",
    "abbreviation": "SC",
    "capital": "Columbia",
    "region": "Southeast",
    "description": "South Carolina requires liability insurance and has a lemon law for new vehicles. The state does not require emissions testing or annual safety inspections and has a low personal property tax on vehicles.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1579,
    "hasLemonLaw": true,
    "lemonLawSummary": "South Carolina's Lemon Law covers new vehicles within the warranty period or 1 year. After three repair attempts or 30 days out of service, the consumer can request arbitration for a refund or replacement.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$40 biennial for most vehicles",
    "registrationNotes": "South Carolina charges a $40 biennial registration fee for most vehicles. A 5% infrastructure maintenance fee (IMF) applies in lieu of sales tax, capped at $500. Personal property tax is also assessed.",
    "titleFee": "$15",
    "plateFee": "$8"
  },
  {
    "name": "South Dakota",
    "slug": "south-dakota",
    "abbreviation": "SD",
    "capital": "Pierre",
    "region": "Midwest",
    "description": "South Dakota requires liability insurance and has a lemon law for new vehicles. The state does not require emissions testing or safety inspections and has no state income tax.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1192,
    "hasLemonLaw": true,
    "lemonLawSummary": "South Dakota's Lemon Law covers new vehicles within the warranty period. After four repair attempts or 30 days out of service, the consumer can seek a replacement or refund through arbitration.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$36 - $144 based on weight and age",
    "registrationNotes": "South Dakota charges registration fees based on vehicle weight and age. A 4% excise tax applies to all vehicle purchases. No annual personal property tax on vehicles.",
    "titleFee": "$10",
    "plateFee": "$4 - $6"
  },
  {
    "name": "Tennessee",
    "slug": "tennessee",
    "abbreviation": "TN",
    "capital": "Nashville",
    "region": "Southeast",
    "description": "Tennessee requires liability insurance and has emissions testing in select metro counties. The state has a lemon law for new vehicles and charges no state income tax on wages.",
    "insuranceMinimum": "25/50/15",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $15,000 property damage",
    "averageInsuranceCost": 1370,
    "hasLemonLaw": true,
    "lemonLawSummary": "Tennessee's Motor Vehicle Warranty Enforcement Act covers new vehicles within the warranty period. After four repair attempts or 30 days out of service, the consumer can seek a replacement or refund.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in Davidson, Hamilton, Rutherford, Sumner, Williamson, and Wilson counties for vehicles 3-25 model years old. Annual OBD-II testing costs $9.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "Tennessee offers incentives through TVA partnerships and local utility programs for EV charging station installation. The state is home to several EV manufacturing facilities and offers related tax incentives.",
    "registrationFeeRange": "$26.50 for most vehicles",
    "registrationNotes": "Tennessee charges a flat $26.50 annual registration fee for most passenger vehicles. A state and local sales tax (typically 7-9.75%) applies to vehicle purchases. Title fee is $11.",
    "titleFee": "$11",
    "plateFee": "$1"
  },
  {
    "name": "Texas",
    "slug": "texas",
    "abbreviation": "TX",
    "capital": "Austin",
    "region": "South Central",
    "description": "Texas requires liability insurance and annual safety inspections. The state has emissions testing in select urban counties and is one of the largest vehicle markets in the country.",
    "insuranceMinimum": "30/60/25",
    "insuranceMinimumDetail": "$30,000 bodily injury per person / $60,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1823,
    "hasLemonLaw": true,
    "lemonLawSummary": "Texas's Lemon Law covers new vehicles within the warranty period or 24 months. After four repair attempts, two attempts for a serious safety defect, or 30 days out of service, the consumer can file a complaint with the Texas Department of Motor Vehicles.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required as part of the annual safety inspection in 17 urban counties including Dallas-Fort Worth, Houston, Austin, San Antonio, and El Paso. Cost is approximately $11.50 for the emissions portion.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Annual safety inspections are required for all registered vehicles in Texas. Inspections cover brakes, horn, lights, mirrors, steering, tires, exhaust, glass, and other safety systems. Cost is $7.50 for non-commercial vehicles.",
    "evIncentives": true,
    "evIncentiveDetails": "Texas offers the Light-Duty Motor Vehicle Purchase or Lease Incentive Program with up to $2,500 for new EVs. Various utility companies offer additional rebates for home charging installation. Some cities offer additional local incentives.",
    "registrationFeeRange": "$50.75 for most passenger vehicles",
    "registrationNotes": "Texas charges a base registration fee of $50.75 for most passenger vehicles. A 6.25% motor vehicle sales tax applies to purchases. Title fee is $33.",
    "titleFee": "$33",
    "plateFee": "Included in registration"
  },
  {
    "name": "Utah",
    "slug": "utah",
    "abbreviation": "UT",
    "capital": "Salt Lake City",
    "region": "Mountain West",
    "description": "Utah requires liability insurance and has emissions testing in several Wasatch Front counties. The state has a lemon law for new vehicles and safety inspections based on vehicle age.",
    "insuranceMinimum": "25/65/15",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $65,000 bodily injury per accident / $15,000 property damage / $3,000 PIP",
    "averageInsuranceCost": 1375,
    "hasLemonLaw": true,
    "lemonLawSummary": "Utah's New Motor Vehicle Warranties Act covers new vehicles within the warranty period. After four repair attempts or 30 business days out of service, the consumer can seek a refund or replacement.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in Salt Lake, Davis, Utah, Weber, and Cache counties. Testing frequency varies by county and vehicle age (annual or biennial). OBD-II testing costs approximately $30.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Safety inspections are required annually for vehicles 10+ years old in most counties. Newer vehicles are exempt until they reach 4-8 years old, depending on county. Cost is approximately $30.",
    "evIncentives": true,
    "evIncentiveDetails": "Utah offers a Clean Fuel Vehicle tax credit and reduced registration fees for electric vehicles through certain years. Rocky Mountain Power offers incentives for EV charging station installation.",
    "registrationFeeRange": "$44 - $69 based on vehicle age",
    "registrationNotes": "Utah charges registration fees based on vehicle age. Newer vehicles pay $69, with fees decreasing to $44 for vehicles 12+ years old. A uniform fee of $150 applies to all new vehicle registrations.",
    "titleFee": "$6",
    "plateFee": "$6"
  },
  {
    "name": "Vermont",
    "slug": "vermont",
    "abbreviation": "VT",
    "capital": "Montpelier",
    "region": "New England",
    "description": "Vermont requires liability insurance and annual safety and emissions inspections. The state follows California emissions standards and offers incentives for electric and plug-in hybrid vehicles.",
    "insuranceMinimum": "25/50/10",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $10,000 property damage",
    "averageInsuranceCost": 1031,
    "hasLemonLaw": true,
    "lemonLawSummary": "Vermont's Lemon Law covers new vehicles within the warranty period or 2 years. After three repair attempts or 30 days out of service, the consumer can seek a refund or replacement through arbitration.",
    "hasEmissions": true,
    "emissionsDetails": "Annual OBD-II emissions testing is required as part of the annual safety inspection for vehicles 2+ model years old. Vermont follows California's vehicle emission standards (CARB).",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Annual safety inspections are required for all registered vehicles. Inspections cover brakes, steering, tires, lights, exhaust, glass, and OBD-II emissions. Cost is typically $35.",
    "evIncentives": true,
    "evIncentiveDetails": "Vermont offers incentives through the Mileage Smart program, providing up to $5,000 in incentives for income-eligible residents purchasing efficient or electric vehicles. Additional utility incentives are available.",
    "registrationFeeRange": "$76 for most passenger vehicles",
    "registrationNotes": "Vermont charges an annual registration fee of $76 for most vehicles. A 6% purchase and use tax applies to vehicle purchases. Title fee is $35.",
    "titleFee": "$35",
    "plateFee": "Included in registration"
  },
  {
    "name": "Virginia",
    "slug": "virginia",
    "abbreviation": "VA",
    "capital": "Richmond",
    "region": "Mid-Atlantic",
    "description": "Virginia requires liability insurance and annual safety inspections statewide. The state has emissions testing in Northern Virginia and has a lemon law protecting new vehicle buyers.",
    "insuranceMinimum": "30/60/20",
    "insuranceMinimumDetail": "$30,000 bodily injury per person / $60,000 bodily injury per accident / $20,000 property damage",
    "averageInsuranceCost": 1336,
    "hasLemonLaw": true,
    "lemonLawSummary": "Virginia's Lemon Law covers new vehicles within 18 months of purchase. After three repair attempts or 30 days out of service, the consumer can invoke the Virginia Motor Vehicle Warranty Enforcement Act.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in Northern Virginia and certain other localities as part of the annual safety inspection. OBD-II testing is used for 1996+ model year vehicles.",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Annual safety inspections are required for all registered vehicles statewide. Inspections cover brakes, steering, suspension, tires, lights, glass, horn, exhaust, and mirrors. Cost is $20.",
    "evIncentives": true,
    "evIncentiveDetails": "Virginia offers a reduced rate for HOV lane tolling for qualifying clean fuel vehicles. Some utility companies offer rebates for home EV charging equipment. The state is investing in charging infrastructure through the VW settlement funds.",
    "registrationFeeRange": "$30.75 - $46.75 based on weight",
    "registrationNotes": "Virginia charges annual registration fees based on vehicle weight. An annual personal property tax is also assessed by the locality, with partial state relief available. Title fee is $15.",
    "titleFee": "$15",
    "plateFee": "$10"
  },
  {
    "name": "Washington",
    "slug": "washington",
    "abbreviation": "WA",
    "capital": "Olympia",
    "region": "Pacific Northwest",
    "description": "Washington requires liability insurance and has emissions testing in certain areas. The state has no income tax, a strong lemon law, and significant incentives for electric vehicle adoption.",
    "insuranceMinimum": "25/50/10",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $10,000 property damage",
    "averageInsuranceCost": 1394,
    "hasLemonLaw": true,
    "lemonLawSummary": "Washington's Lemon Law covers new vehicles within 24 months or 24,000 miles. After four repair attempts, two for a condition likely to cause death or serious injury, or 30 days out of service, the consumer can seek a refund or replacement.",
    "hasEmissions": true,
    "emissionsDetails": "Emissions testing is required in parts of Clark, King, Pierce, Snohomish, and Spokane counties for vehicles 5-25 model years old. Biennial OBD-II testing costs $15.",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": true,
    "evIncentiveDetails": "Washington exempts electric vehicles from state sales tax on the first $15,000 of the purchase price. The state also offers HOV lane access for EVs and is investing heavily in charging infrastructure.",
    "registrationFeeRange": "$30 base plus RTA tax in some areas",
    "registrationNotes": "Washington charges a $30 base registration fee. In areas with regional transit authority (Sound Transit), an additional RTA excise tax of 1.1% of vehicle value applies. EV owners pay a $225 annual fee.",
    "titleFee": "$15",
    "plateFee": "$10"
  },
  {
    "name": "West Virginia",
    "slug": "west-virginia",
    "abbreviation": "WV",
    "capital": "Charleston",
    "region": "Mid-Atlantic",
    "description": "West Virginia requires liability insurance and has a lemon law for new vehicles. The state does not require emissions testing but mandates annual vehicle safety inspections.",
    "insuranceMinimum": "25/50/25",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $25,000 property damage",
    "averageInsuranceCost": 1285,
    "hasLemonLaw": true,
    "lemonLawSummary": "West Virginia's Lemon Law covers new vehicles within the first year or warranty period. After three repair attempts or 30 days out of service, the consumer can seek a refund or replacement.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": true,
    "safetyInspectionDetails": "Annual safety inspections are required for all registered vehicles. Inspections cover brakes, steering, tires, lights, glass, exhaust, horn, and mirrors. Cost is typically $10-$19.",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$51.50 for most passenger vehicles",
    "registrationNotes": "West Virginia charges a $51.50 annual registration fee for most passenger vehicles. A 6% sales tax applies to vehicle purchases. Title fee is $15. Personal property tax is also assessed.",
    "titleFee": "$15",
    "plateFee": "$5"
  },
  {
    "name": "Wisconsin",
    "slug": "wisconsin",
    "abbreviation": "WI",
    "capital": "Madison",
    "region": "Midwest",
    "description": "Wisconsin requires liability insurance and has a lemon law for new vehicles. The state does not require emissions testing or safety inspections for most personal vehicles.",
    "insuranceMinimum": "25/50/10",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $10,000 property damage",
    "averageInsuranceCost": 1099,
    "hasLemonLaw": true,
    "lemonLawSummary": "Wisconsin's Lemon Law covers new vehicles within the warranty period or 1 year. After four repair attempts or 30 days out of service, the consumer can seek a replacement or refund through the state's dispute resolution program.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "$85 for most passenger vehicles",
    "registrationNotes": "Wisconsin charges an $85 annual registration fee for most passenger vehicles. A 5% sales tax applies to vehicle purchases, plus a 0.5% county tax. Title fee is $164.50.",
    "titleFee": "$164.50",
    "plateFee": "$2"
  },
  {
    "name": "Wyoming",
    "slug": "wyoming",
    "abbreviation": "WY",
    "capital": "Cheyenne",
    "region": "Mountain West",
    "description": "Wyoming requires liability insurance and has a lemon law for new vehicles. The state does not require emissions testing or safety inspections and has no state income tax.",
    "insuranceMinimum": "25/50/20",
    "insuranceMinimumDetail": "$25,000 bodily injury per person / $50,000 bodily injury per accident / $20,000 property damage",
    "averageInsuranceCost": 1105,
    "hasLemonLaw": true,
    "lemonLawSummary": "Wyoming's Lemon Law covers new vehicles within the warranty period or 1 year. After three repair attempts or 30 days out of service, the consumer can seek a replacement or refund.",
    "hasEmissions": false,
    "emissionsDetails": "",
    "hasSafetyInspection": false,
    "safetyInspectionDetails": "",
    "evIncentives": false,
    "evIncentiveDetails": "",
    "registrationFeeRange": "Based on value, typically $30 - $90",
    "registrationNotes": "Wyoming charges registration fees based on the vehicle's fair market value and county mills. A 5% use tax applies to vehicle purchases. No state income tax.",
    "titleFee": "$15",
    "plateFee": "$5"
  }
]
